using MimeKit.Cryptography;
using Org.BouncyCastle.Asn1.Crmf;
using System;
using System.Collections.Generic;
using System.Drawing.Printing;
using System.Linq;
using System.Linq.Expressions;
using System.Runtime.CompilerServices;
using System.Runtime.InteropServices.WindowsRuntime;
using System.Security.Cryptography.Xml;
using System.Text;
using System.Threading.Tasks;

namespace BizPortal.ViewModels
{
    public class DBDBusinessModel
    {
        public string BusinessType { get; set; }

        public string TSIC { get; set; }

        public string BusinessName { get; set; }

        public string BusinessInfo { get; set; }

        public string InfoTitle { get; set; }

        public string InfoMessage { get; set; }

        public string Remark { get; set; }
    
        public string SecretKey { get; set; }
    }

    public class BusinessListViewModel 
    {
        public List<DBDBusinessModel> AppModel { get; set; }
    }

    public static class BusinessDataTable 
    {

        public static List<DBDBusinessModel> GetSecretKey(List<DBDBusinessModel> model) 
        {
            List<DBDBusinessModel> appModel = new List<DBDBusinessModel>();

            foreach (DBDBusinessModel app in model) 
            {
                DBDBusinessModel obj = new DBDBusinessModel();

                obj = app;
                obj.SecretKey = SecretKeyGenerator(app.TSIC);

                appModel.Add(obj);
            }

            return appModel;
        }

        private static string SecretKeyGenerator(string tsicID) 
        {
            StringBuilder strKey = new StringBuilder();
            byte[] plainTextBye;
            string strInsertKey2 = string.Empty;
            string strBase64 = string.Empty;

            strKey.Append("b6oYHyU6g4fGSTYu"); // Key1
            strKey.Append("No2usIEJs1BUlqR6HV0S"); // SALT
            strKey.Append(tsicID.Trim()); // Tsic
            strKey.Append("dga"); // User
            strKey.Append("b6oYHyU6g4fGSTYu"); // Key1

            plainTextBye = System.Text.Encoding.UTF8.GetBytes(strKey.ToString());

            strBase64 = Convert.ToBase64String(plainTextBye);
            strInsertKey2 = strBase64.Substring(0, 3);
            return string.Format("{0}{1}{2}", strInsertKey2, "EY4lS3NA1", strBase64.Replace(strInsertKey2, string.Empty));
        }

        public static List<DBDBusinessModel> GetBusnessDataTable(string bType) 
        {

            List<DBDBusinessModel> model = new List<DBDBusinessModel>();

            switch (bType)
            {

                case "RESTAURANT":
                    model = AddRestaurant();
                    break;
                case "RETAIL":
                    model = AddRetail();
                    break;
                case "COFFEESHOP":
                    model = AddCoffeeshop();
                    break;
                case "HOTEL":
                    model = AddHotel();
                    break;
                case "AGP":
                    model = AddAGP();
                    break;
                case "LOGISTICS":
                    model = AddLogistics();
                    break;
                case "MEDICTOOL":
                    model = AddMedicTool();
                    break;
                case "PATIENTSERVICE":
                    model = AddPatientService();
                    break;
                case "COSMETICSHORTTERM":
                    model = AddCosmeticShortTerm();
                    break;
                case "SPA":
                    model = AddSpa();
                    break;
                case "PETMEDICINE":
                    model = AddPetMedicine();
                    break;
                case "CONSTRUCTION":
                    model = AddConstruction();
                    break;
                case "ELECTRONICSELL":
                    model = AddElectronicSell();
                    break;
                case "FITNESS":
                    model = AddFitness();
                    break;
                case "CARCARE":
                    model = AddCarCare();
                    break;
                case "ACCOUNTANDLAWCONSULT":
                    model = AddAccountAndLawConsult();
                    break;
                case "COSMETIC":
                    model = AddCosmetic();
                    break;
                case "TOURISM":
                    model = AddTourism();
                    break;
                case "SOFTWAREHOUSE":
                    model = AddSoftwareHouse();
                    break;
                case "COSMETICONLINE":
                    model = AddCosmeticOnline();
                    break;
                case "FABRICECOMMERCE":
                    model = AddFabricECommerce();
                    break;
                case "SPARPOWER":
                    model = AddSparPower();
                    break;
                case "EDUCATION":
                    model = AddEducation();
                    break;
                case "SEC":
                    model = AddSEC();
                    break;
                case "ORGANICPLANT":
                    model = AddOrganicPlant();
                    break;
            }
           
            return model.OrderBy(x => x.TSIC).ToList();

        }

        private static List<DBDBusinessModel> AddRestaurant() 
        {

            List<DBDBusinessModel> model = new List<DBDBusinessModel>();

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Restaurant,
                TSIC = "46102",
                BusinessName = "การขายส่งอาหารเครื่องดื่มและยาสูบโดยได้รับค่าตอบแทนหรือตามสัญญาจ้าง",
                InfoTitle = "การขายส่งอาหารเครื่องดื่มและยาสูบโดยได้รับค่าตอบแทนหรือตามสัญญาจ้าง",
                InfoMessage = "กิจกรรมขายส่งอาหาร เครื่องดื่มและยาสูบ โดยได้รับค่าตอบแทนหรือตามสัญญาจ้าง ผลไม้และผัก เนื้อสัตว์และผลิตภัณฑ์เนื้อสัตว์ และผลิตภัณฑ์ประมง ผลิตภัณฑ์นม ไข่และผลิตภัณฑ์ไข่ น้ำมัน และไขมันจากสัตว์หรือพืชที่บริโภคได้ แป้งและผลิตภัณฑ์อาหารประเภทแป้ง น้ำตาล ช็อกโกแลต และลูกกวาด และผลิตภัณฑ์ประเภทอบ เครื่องดื่ม กาแฟ ชา โกโก้และเครื่องเทศ ผลิตภัณฑ์ยาสูบ ไวน์ที่ซื้อมาจำนวนมากและบรรจุขวดใหม่โดยไม่มีการดัดแปลงอาหารสำหรับสัตว์เลี้ยง ทั้งนี้รวมถึงวิธีการขายทอดตลาดสินค้าดังกล่าว",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Restaurant,
                TSIC = "46321",
                BusinessName = "การขายส่งเครื่องดื่มที่มีแอลกอฮอล์",
                InfoTitle = "การขายส่งเครื่องดื่มที่มีแอลกอฮอล์",
                InfoMessage = "การขายส่งสุรากลั่น เช่น วิสกี้ วอดก้า รัม บรั่นดี คอนยัค เกาเหลียง เหล้าโรง หรือเหล้าขาว สุราผสม เช่น เชี่ยงชุน ยิน ลิเคียว สุราผสมพิเศษ เช่น หงษ์ทอง มังกรทอง สุราปรุงพิเศษ เช่น แม่โขง สุราที่มีสรรพคุณเป็นยา ค็อกเทลสำเร็จรูป การขายส่งไวน์องุ่นและไวน์ผลไม้อื่น ๆ ไวน์สมุนไพร เช่น กระชายดำ ส้มแขก ยอ กระวาน สุราแช่ที่ผลิตจากผลผลิตทางการเกษตรอื่น ๆ เช่น สาเก อุ สาโท กระแช่ น้ำตาลเมา ไวน์น้ำผึ้ง รวมถึงการซื้อไวน์เป็นจำนวนมากและบรรจุขวดใหม่ โดยไม่มีการดัดแปลง การขายส่งเบียร์ รวมถึงเบียร์ที่มีแอลกอฮอล์ต่ำ หรือไม่มีแอลกอฮอล์",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Restaurant,
                TSIC = "46322",
                BusinessName = "การขายส่งเครื่องดื่มที่ไม่มีแอลกอฮอล์",
                InfoTitle = "การขายส่งเครื่องดื่มที่ไม่มีแอลกอฮอล์",
                InfoMessage = "การขายส่งน้ำแร่ธรรมชาติ และน้ำดื่มในภาชนะบรรจุที่ปิดสนิท การขายส่งน้ำอัดลม รวมถึงโซดา การขายส่งเครื่องดื่มประเภทกาแฟ ชาและชาชงสมุนไพรพร้อมดื่ม การขายส่งน้ำผักและผลไม้และน้ำธัญพืช การขายส่งเครื่องดื่มให้พลังงานหรือเครื่องดื่มเกลือแร่และเครื่องดื่มที่ไม่มีแอลกอฮอล์อื่น ๆ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Restaurant,
                TSIC = "47190",
                BusinessName = "การขายปลีกสินค้าอื่นๆในร้านค้าทั่วไป",
                InfoTitle = "การขายปลีกสินค้าอื่นๆในร้านค้าทั่วไป",
                InfoMessage = "",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Restaurant,
                TSIC = " 47221",
                BusinessName = "ร้านขายปลีกเครื่องดื่มที่มีแอลกอฮอล์",
                InfoTitle = "ร้านขายปลีกเครื่องดื่มที่มีแอลกอฮอล์",
                InfoMessage = "การขายปลีกสุรากลั่น เช่น วิสกี้ วอดก้า รัม บรั่นดี คอนยัค เกาเหลียง เหล้าโรงหรือเหล้าขาว สุราผสม เช่น เชี่ยงชุน ยินลิเคียว สุราผสมพิเศษ เช่น หงษ์ทอง มังกรทอง สุราปรุงพิเศษ เช่น แม่โขง สุราที่มีสรรพคุณเป็นยา ค็อกเทลสำเร็จรูป การขายปลีกไวน์องุ่นและไวน์ผลไม้อื่น ๆ ไวน์สมุนไพร เช่น กระชายดำ ส้มแขก ยอ กระวาน สุราแช่ที่ผลิตจากผลผลิตทางการเกษตรอื่น ๆ เช่น สาเก อุ สาโท กระแช่ น้ำตาลเมา ไวน์น้ำผึ้ง รวมถึงการซื้อไวน์เป็นจำนวนมาก และบรรจุขวดใหม่โดยไม่มีการดัดแปลง ร้านขายปลีกเบียร์ รวมถึงเบียร์ที่มีแอลกอฮอล์ต่ำหรือไม่มีแอลกอฮอล์",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Restaurant,
                TSIC = " 47222",
                BusinessName = "ร้านขายปลีกเครื่องดื่มที่ไม่มีแอลกอฮอล์",
                InfoTitle = "ร้านขายปลีกเครื่องดื่มที่ไม่มีแอลกอฮอล์",
                InfoMessage = "ร้านขายปลีกน้ำแร่ธรรมชาติและน้ำดื่มในภาชนะบรรจุที่ปิดสนิท ร้านขายปลีกน้ำอัดลม รวมถึงโซดา ร้านขายปลีกเครื่องดื่มประเภทกาแฟ ชาและชาชงสมุนไพรพร้อมดื่ม ร้านขายปลีกน้ำผักและผลไม้และน้ำธัญพืช ร้านขายปลีกเครื่องดื่มให้พลังงานหรือเครื่องดื่มเกลือแร่และเครื่องดื่มที่ไม่มีแอลกอฮอล์อื่น ๆ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Restaurant,
                TSIC = " 47812",
                BusinessName = "การขายปลีกเครื่องดื่มบนแผงลอยและตลาด",
                InfoTitle = "การขายปลีกเครื่องดื่มบนแผงลอยและตลาด",
                InfoMessage = "การขายปลีกเครื่องดื่มบนแผงลอยและตลาด ทั้งเครื่องดื่มที่มีแอลกอฮอล์ เช่น สุรา ไวน์ เบียร์และเครื่องดื่มที่ไม่มีแอลกอฮอล์ เช่น น้ำแร่และน้ำดื่มบรรจุขวดน้ำอัดลม น้ำผักและผลไม้และน้ำธัญพืช เครื่องดื่มให้พลังงานหรือเครื่องดื่มเกลือแร่",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Restaurant,
                TSIC = " 47999",
                BusinessName = "การขายปลีกโดยไม่มีร้านซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "การขายปลีกโดยไม่มีร้านซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "การขายปลีกโดยเร่ขายสินค้าตามถนนหรือตามบ้าน การขายปลีกโดยเครื่องขายสินค้าแบบหยอดเหรียญ การประมูลโดยไม่มีร้านอื่น ๆ (ขายปลีก) ได้แก่ การขายสินค้าประเภทอาหาร เครื่องดื่มและผลิตภัณฑ์ยาสูบ สิ่งทอ เสื้อผ้า รองเท้าและเครื่องหนัง สินค้าทางเภสัชภัณฑ์และทางการแพทย์ เครื่องหอม และเครื่องสำอาง คอมพิวเตอร์ อุปกรณ์สื่อสาร โทรคมนาคม เครื่องใช้ไฟฟ้าและอิเล็กทรอนิกส์ สินค้าวัฒนธรรม และพักผ่อนหย่อนใจ สินค้าทางเภสัชภัณฑ์และทางการแพทย์ เครื่องหอม และเครื่องสำอาง เป็นต้น",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Restaurant,
                TSIC = "56101",
                BusinessName = "การบริการด้านอาหารในภัตตาคาร/ร้านอาหาร",
                InfoTitle = "การบริการด้านอาหารในภัตตาคาร/ร้านอาหาร",
                InfoMessage = "การบริการจัดอาหารและเครื่องดื่ม รวมถึงไอศกรีมและเค้ก จัดเตรียมไว้พร้อมบริโภค มีหรือไม่มีที่นั่งก็ตาม ไม่ว่าจะเป็นบริการแบบให้นั่งโต๊ะหรือแบบบริการตนเองจากชั้นวางอาหาร ไม่ว่าจะรับประทานอาหารภายในร้านนำกลับ หรือสั่งให้จัดส่งที่บ้าน เช่น ร้านอาหาร ภัตตาคาร คาเฟ่ต์ เคาน์เตอร์ หรือบูธ ร้านอาหารแบบบริการตนเอง ร้านอาหารจานด่วน ร้านอาหาร/ภัตตาคาร คาเฟ่ต์ เคาน์เตอร์หรือบูธในยานพาหนะ เช่น รถไฟ เรือหรือเครื่องบินที่ดำเนินการโดยหน่วยงานอื่น ร้านอาหารที่ให้บริการจัดส่ง",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Restaurant,
                TSIC = "56102",
                BusinessName = "การบริการด้านอาหารบนแผงลอยและตลาด",
                InfoTitle = "การบริการด้านอาหารบนแผงลอยและตลาด",
                InfoMessage = "การบริการอาหารและเครื่องดื่ม รวมถึงไอศกรีมและเค้ก พร้อมบริโภคบนแผงลอยและตลาด ไม่ว่าจะมีหรือไม่มีความบันเทิง มีที่นั่งหรือไม่มีที่นั่งก็ตาม",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Restaurant,
                TSIC = "56103",
                BusinessName = "การบริการด้านอาหารโดยร้านอาหารแบบเคลื่อนที่",
                InfoTitle = "การบริการด้านอาหารโดยร้านอาหารแบบเคลื่อนที่",
                InfoMessage = "การให้บริการอาหารและเครื่องดื่ม ไอศกรีมและเค้ก พร้อมบริโภคโดยร้านอาหารแบบเคลื่อนที่ เช่น เร่ขายโดยการเดิน รถยนต์หรือรถเข็นเป็นพาหนะ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Restaurant,
                TSIC = "56210",
                BusinessName = "การบริการด้านการจัดเลี้ยง",
                InfoTitle = "การบริการด้านการจัดเลี้ยง",
                InfoMessage = "การจัดบริการอาหารตามข้อตกลงกับลูกค้า ณ สถานที่ที่ลูกค้ากำหนดสำหรับงานนั้น ๆ รวมถึงผู้รับจัดงานเลี้ยง",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Restaurant,
                TSIC = "56291",
                BusinessName = "การบริการอาหารสำหรับกิจการขนส่ง",
                InfoTitle = "การบริการอาหารสำหรับกิจการขนส่ง",
                InfoMessage = "การบริการอาหารของผู้รับเหมาดำเนินการที่ดำเนินงานตามข้อตกลงหรือสัญญาที่ให้ไว้กับบริษัทสายการบินหรือกิจการด้านการขนส่งอื่น ๆ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Restaurant,
                TSIC = "56292",
                BusinessName = "การดำเนินงานของโรงอาหาร",
                InfoTitle = "การดำเนินงานของโรงอาหาร",
                InfoMessage = "การดำเนินงานตามที่ได้รับสิทธิบริการอาหารในสถานที่จัดกิจกรรมกีฬาและอื่น ๆ การดำเนินงานของห้องอาหารภายในหน่วยงาน เช่น ห้องอาหารในโรงงาน สำนักงาน โรงพยาบาล โรงเรียน และในมหาวิทยาลัย",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Restaurant,
                TSIC = "56299",
                BusinessName = "การบริการด้านอาหารอื่นๆซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "การบริการด้านอาหารอื่นๆซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "การบริการอาหารในอุตสาหกรรมต่าง ๆ เช่น การบริการอาหารตามข้อตกลงกับลูกค้าตามระยะเวลา สถานที่ที่ลูกค้ากำหนดสำหรับงานนั้น ๆ โดยมีหน่วยงานกลางทำหน้าที่จัดเตรียมอาหารให้ บริการจัดเลี้ยงสำหรับงานในโอกาสต่าง ๆ หรือในเฉพาะช่วงเวลา การบริการอาหารอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Restaurant,
                TSIC = "56301",
                BusinessName = "การบริการด้านเครื่องดื่มที่มีแอลกอฮอล์เป็นหลักในร้าน",
                InfoTitle = "การบริการด้านเครื่องดื่มที่มีแอลกอฮอล์เป็นหลักในร้าน",
                InfoMessage = "การบริการเครื่องดื่มที่มีแอลกอฮอล์เป็นหลักในร้านแบบพร้อมบริโภค ไม่ว่าจะมีหรือไม่มีความบันเทิง มีที่นั่งหรือไม่มีที่นั่งก็ตาม ไม่ว่าจะเป็นแบบให้บริการที่โต๊ะ บริการตนเอง นำออกไปดื่มข้างนอก เช่น บาร์ ร้านขายเหล้า ค็อกเทลเลาจ์ ดิสโก้เธค (ที่ให้บริการเครื่องดื่มเป็นหลัก)",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Restaurant,
                TSIC = "56302",
                BusinessName = "การบริการด้านเครื่องดื่มที่ไม่มีแอลกอฮอล์เป็นหลักในร้าน",
                InfoTitle = "การบริการด้านเครื่องดื่มที่ไม่มีแอลกอฮอล์เป็นหลักในร้าน",
                InfoMessage = "การบริการเครื่องดื่มที่ไม่มีแอลกอฮอล์เป็นหลักในร้านแบบพร้อมบริโภคไม่ว่าจะมีหรือไม่มีความบันเทิง มีที่นั่งหรือไม่มีที่นั่งก็ตาม ไม่ว่าจะเป็นแบบให้บริการที่โต๊ะ บริการตนเอง นำออกไปดื่มข้างนอก เช่น คอฟฟี่ช็อป ร้านกาแฟร้านน้ำผลไม้",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Restaurant,
                TSIC = "56303",
                BusinessName = "การบริการด้านเครื่องดื่มบนแผงลอยและตลาด",
                InfoTitle = "การบริการด้านเครื่องดื่มบนแผงลอยและตลาด",
                InfoMessage = "การบริการเครื่องดื่มบนแผงลอยและตลาดแบบพร้อมบริโภค ไม่ว่าจะมีหรือไม่มีความบันเทิง มีที่นั่งหรือไม่มีที่นั่งก็ตาม",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Restaurant,
                TSIC = "56304",
                BusinessName = "การบริการด้านเครื่องดื่มโดยร้านเคลื่อนที่",
                InfoTitle = "การบริการด้านเครื่องดื่มโดยร้านเคลื่อนที่",
                InfoMessage = "การบริการเครื่องดื่มโดยร้านเคลื่อนที่แบบพร้อมบริโภค เช่น เร่ขายโดยการเดินโดยรถยนต์หรือรถเข็นเป็นพาหนะ",
            });

            return model;

        }

        private static List<DBDBusinessModel> AddRetail() 
        {
            List<DBDBusinessModel> model = new List<DBDBusinessModel>();

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47111",
                BusinessName = "ซุปเปอร์มาร์เก็ต",
                InfoTitle = "ซุปเปอร์มาร์เก็ต",
                InfoMessage = "ร้านค้าที่ดำเนินการขายปลีกสินค้าอุปโภคบริโภคที่จำเป็นต่อการดำรงชีวิตประจำวันสินค้าส่วนใหญ่ ได้แก่ อาหารแห้ง อาหารสด เช่น เนื้อสัตว์ ผักและผลไม้อาหารสำเร็จรูปต่าง ๆ ตลอดจนสินค้าอุปโภคบริโภคที่ใช้ในชีวิตประจำวันที่ไม่ใช่อาหาร",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47112",
                BusinessName = "ดิสเคาท์สโตร์/ซุปเปอร์เซ็นเตอร์/ไฮเปอร์มาร์เก็ต",
                InfoTitle = "ดิสเคาท์สโตร์/ซุปเปอร์เซ็นเตอร์/ไฮเปอร์มาร์เก็ต",
                InfoMessage = "ร้านค้าที่ดำเนินการขายปลีกสินค้าอุปโภคบริโภคทั่วไป เน้นการขายสินค้าจำนวนมากในราคาถูก เป็นร้านค้าที่วางจำหน่ายสินค้าอุปโภคที่จำเป็นร้อยละ 80 และสินค้าทั่วไปร้อยละ 20 และยังมีบริการอื่น ๆ เช่น ซ่อมรองเท้า ขายยาและศูนย์อาหาร",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47113",
                BusinessName = "ร้านสะดวกซื้อ/มินิมาร์ท",
                InfoTitle = "ร้านสะดวกซื้อ/มินิมาร์ท",
                InfoMessage = "ร้านขายปลีกขนาดเล็ก โดยส่วนใหญ่จำหน่ายอาหารและเครื่องดื่มประเภทจานด่วนและสินค้าอุปโภคอื่น ๆ ที่จำเป็นต่อชีวิตประจำวัน ตั้งอยู่ในเขตชุมชนและมักจะเปิดบริการตลอด 24 ชั่วโมง เน้นการขยายสาขาด้วยระบบแฟรนไชส์มีการบริหารงานอย่างเป็นระบบภายใต้การกำกับดูแลของบริษัทแม่ รวมถึง ร้านสะดวกซื้อที่ให้บริการตามสถานีบริการน้ำมัน",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47114",
                BusinessName = "ร้านขายของชำ",
                InfoTitle = "ร้านขายของชำ",
                InfoMessage = "ร้านขายปลีกขนาดเล็กแบบดั้งเดิม หรือร้านโชห่วยกระจายอยู่ตามตรอก ซอย ขายสินค้าอุปโภค บริโภคที่จำเป็นต่อชีวิตประจำวันหลายชนิด เช่น ข้าว แป้ง อาหารกระป๋อง น้ำตาล เครื่องเทศ มีการบริหารงานแบบครอบครัวเป็นหลัก",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47190",
                BusinessName = "การขายปลีกสินค้าอื่นๆในร้านค้าทั่วไป",
                InfoTitle = "การขายปลีกสินค้าอื่นๆในร้านค้าทั่วไป",
                InfoMessage = "การขายปลีกสินค้าหลายชนิด ซึ่งผลิตภัณฑ์อาหาร เครื่องดื่มหรือยาสูบ มิได้เป็นสินค้าหลัก เช่น กิจกรรมการขายปลีกในห้างสรรพสินค้าที่ขายสินค้าทั่วไป รวมทั้งเสื้อผ้า เครื่องแต่งกาย เฟอร์นิเจอร์ เครื่องใช้ในบ้าน เครื่องมือที่ทำจากโลหะ เครื่องสำอาง เครื่องประดับ ของเล่น อุปกรณ์กีฬา ฯลฯ ทั้งนี้รวมถึงวิธีการขายทอดตลาดสินค้าดังกล่าว",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47211",
                BusinessName = "ร้านขายปลีกเนื้อสัตว์และผลิตภัณฑ์เนื้อสัตว์",
                InfoTitle = "ร้านขายปลีกเนื้อสัตว์และผลิตภัณฑ์เนื้อสัตว์",
                InfoMessage = "ร้านขายปลีกเนื้อสัตว์ เนื้อสัตว์ปีกและเนื้อสัตว์ล่า ทั้งชนิดสด แช่เย็นหรือแช่แข็ง รวมถึงผลิตภัณฑ์จากเนื้อสัตว์ ส่วนอื่นของสัตว์ที่บริโภคได้ เนื้อสัตว์ที่ผ่านกระบวนการถนอมและแปรรูป",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47212",
                BusinessName = "ร้านขายปลีกปลาและผลิตภัณฑ์สัตว์น้ำ",
                InfoTitle = "ร้านขายปลีกปลาและผลิตภัณฑ์สัตว์น้ำ",
                InfoMessage = "ร้านขายปลีกสัตว์น้ำ เช่น ปลา กุ้ง หอย ปู ปลาหมึก ฯลฯ ทั้งชนิดสด แช่เย็นหรือแช่แข็ง ผลิตภัณฑ์สัตว์น้ำบรรจุกระป๋อง ผลิตภัณฑ์สัตว์น้ำที่ผ่านกระบวนการถนอมและแปรรูป รวมถึงผลิตภัณฑ์สาหร่ายแปรรูป",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47213",
                BusinessName = "ร้านขายปลีกผักและผลไม้",
                InfoTitle = "ร้านขายปลีกผักและผลไม้",
                InfoMessage = "ร้านขายปลีกผัก ผลไม้และถั่วเปลือกแข็ง ทั้งชนิดสด แช่เย็นหรือแช่แข็ง ผลิตภัณฑ์ที่ผ่านกระบวนการถนอมและแปรรูปจากผลไม้และผัก เช่น ผักและผลไม้บรรจุกระป๋อง รวมถึงผลิตภัณฑ์ผลไม้และผักที่ถนอมโดยใช้น้ำตาล (ยกเว้น น้ำผัก และผลไม้และน้ำธัญพืช)",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47214",
                BusinessName = "ร้านขายปลีกข้าวและผลิตภัณฑ์ที่ได้จากการสีข้าว",
                InfoTitle = "ร้านขายปลีกข้าวและผลิตภัณฑ์ที่ได้จากการสีข้าว",
                InfoMessage = "ร้านขายปลีกข้าวที่สี ที่ขัด ที่นึ่งหรือข้าวปรับปรุงให้เก็บไว้ได้นาน เช่น ข้าวเจ้า ข้าวเหนียว ข้าวกล้อง เยิร์มของข้าว รำ เศษหัก หรือเศษอื่น ๆ ของข้าว",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47215",
                BusinessName = "ร้านขายปลีกผลิตภัณฑ์ขนมอบ",
                InfoTitle = "ร้านขายปลีกผลิตภัณฑ์ขนมอบ",
                InfoMessage = "ร้านขายปลีกผลิตภัณฑ์ประเภทอบ เช่น ขนมปัง เค้กและเพสตรี ผลิตภัณฑ์ขนมอบแช่แข็ง ขนมปังกรอบ บิสกิต คุกกี้ แครกเกอร์และผลิตภัณฑ์ขนมอบชนิดกรอบอื่น ๆ รวมถึงขนมไทยประเภทอบ เช่น ขนมหม้อแกง ขนมบ้าบิ่น ขนมผิง ขนมไข่ ขนมกุฎีจีน ขนมทองม้วน ขนมสาลี่กรอบ ขนมชนิดเคลือบและมีไส้เป็นน้ำตาล ฯลฯ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47219",
                BusinessName = "ร้านขายปลีกอาหารอื่นๆซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "ร้านขายปลีกอาหารอื่นๆซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "ร้านขายปลีกอาหารอื่น ๆ เช่น น้ำมันและไขมันจากสัตว์หรือพืชที่ใช้ในการบริโภค รวมถึงเนยเทียม ไขมันที่ใช้ในการปรุงอาหาร เนยขาว ไข่ แป้ง น้ำตาล ช็อกโกแลต และน้ำตาล หมากฝรั่ง ลูกกวาด ลูกอม ท๊อฟฟี่ ขนมขบเคี้ยว/ขนมกรุบกรอบ ถั่วอบกรอบ นมสด โยเกิร์ตและนมเปรี้ยว นมข้น นมผง เนย ครีม ไอศกรีม กาแฟ ชา โกโก้ ซอส น้ำปลา ซีอิ๊ว เครื่องปรุงและเครื่องเทศ อาหารสำเร็จรูป อาหารบำรุงสุขภาพ เช่น ผลิตภัณฑ์จากน้ำมันมะพร้าว อาหารแช่แข็ง มักกะโรนี เส้นก๋วยเตี๋ยว ขนมหวาน น้ำแข็ง และอาหารอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47221",
                BusinessName = "ร้านขายปลีกเครื่องดื่มที่มีแอลกอฮอล์",
                InfoTitle = "ร้านขายปลีกเครื่องดื่มที่มีแอลกอฮอล์",
                InfoMessage = "การขายปลีกสุรากลั่น เช่น วิสกี้ วอดก้า รัม บรั่นดี คอนยัค เกาเหลียง เหล้าโรงหรือเหล้าขาว สุราผสม เช่น เชี่ยงชุน ยินลิเคียว สุราผสมพิเศษ เช่น หงษ์ทอง มังกรทอง สุราปรุงพิเศษ เช่น แม่โขง สุราที่มีสรรพคุณเป็นยา ค็อกเทลสำเร็จรูป การขายปลีกไวน์องุ่นและไวน์ผลไม้อื่น ๆ ไวน์สมุนไพร เช่น กระชายดำ ส้มแขก ยอ กระวาน สุราแช่ที่ผลิตจากผลผลิตทางการเกษตรอื่น ๆ เช่น สาเก อุ สาโท กระแช่ น้ำตาลเมา ไวน์น้ำผึ้ง รวมถึงการซื้อไวน์เป็นจำนวนมาก และบรรจุขวดใหม่โดยไม่มีการดัดแปลง ร้านขายปลีกเบียร์ รวมถึงเบียร์ที่มีแอลกอฮอล์ต่ำหรือไม่มีแอลกอฮอล์",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47222",
                BusinessName = "ร้านขายปลีกเครื่องดื่มที่ไม่มีแอลกอฮอล์",
                InfoTitle = "ร้านขายปลีกเครื่องดื่มที่ไม่มีแอลกอฮอล์",
                InfoMessage = "ร้านขายปลีกน้ำแร่ธรรมชาติและน้ำดื่มในภาชนะบรรจุที่ปิดสนิท ร้านขายปลีกน้ำอัดลม รวมถึงโซดา ร้านขายปลีกเครื่องดื่มประเภทกาแฟ ชาและชาชงสมุนไพรพร้อมดื่ม ร้านขายปลีกน้ำผักและผลไม้และน้ำธัญพืช ร้านขายปลีกเครื่องดื่มให้พลังงานหรือเครื่องดื่มเกลือแร่และเครื่องดื่มที่ไม่มีแอลกอฮอล์อื่น ๆ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47230",
                BusinessName = "การขายปลีกผลิตภัณฑ์ยาสูบในร้านค้าเฉพาะ",
                InfoTitle = "การขายปลีกผลิตภัณฑ์ยาสูบในร้านค้าเฉพาะ",
                InfoMessage = "การขายปลีกยาสูบและผลิตภัณฑ์จากยาสูบ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47300",
                BusinessName = "การขายปลีกเชื้อเพลิงยานยนต์ในร้านค้าเฉพาะ สถานี ปั๊ม",
                InfoTitle = "การขายปลีกเชื้อเพลิงยานยนต์ในร้านค้าเฉพาะ สถานี ปั๊ม",
                InfoMessage = "การขายปลีกเชื้อเพลิงและแก๊สสำหรับยานยนต์และจักรยานยนต์ รวมทั้งการขายปลีกผลิตภัณฑ์หล่อลื่น เช่น น้ำมันหล่อลื่น จาระบีและผลิตภัณฑ์ระบายความร้อนสำหรับยานยนต์ และการขายปลีกยางมะตอย",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47411",
                BusinessName = "ร้านขายปลีกคอมพิวเตอร์และอุปกรณ์ต่อพ่วงคอมพิวเตอร์",
                InfoTitle = "ร้านขายปลีกคอมพิวเตอร์และอุปกรณ์ต่อพ่วงคอมพิวเตอร์",
                InfoMessage = "ร้านขายปลีกคอมพิวเตอร์ เช่น คอมพิวเตอร์ชนิดตั้งโต๊ะ คอมพิวเตอร์ชนิดพกพา ฯลฯ ร้านขายปลีกอุปกรณ์ต่อพ่วงคอมพิวเตอร์ เช่น อุปกรณ์เก็บข้อมูล เครื่องพิมพ์ จอภาพ แป้นอักขระ เมาส์ ก้านและลูกบอลควบคุม (Track ball) ฯลฯ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47412",
                BusinessName = "ร้านขายปลีกเครื่องเล่นวีดิโอเกมและซอฟต์แวร์สำเร็จรูป",
                InfoTitle = "ร้านขายปลีกเครื่องเล่นวีดิโอเกมและซอฟต์แวร์สำเร็จรูป",
                InfoMessage = "ร้านขายปลีกซอฟต์แวร์สำเร็จรูป เช่น ซอฟต์แวร์ระบบปฏิบัติการ ซอฟต์แวร์เกมและซอฟต์แวร์เพื่อการใช้งานในเชิงธุรกิจและด้านอื่น ๆ ร้านขายปลีกเครื่องเล่นวีดีโอเกมคอนโซล รวมถึงวีดีโอเกม",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47413",
                BusinessName = "ร้านขายปลีกอุปกรณ์การสื่อสารโทรคมนาคม",
                InfoTitle = "ร้านขายปลีกอุปกรณ์การสื่อสารโทรคมนาคม",
                InfoMessage = "การขายปลีกโทรศัพท์และอุปกรณ์การสื่อสารที่ใช้ส่งสัญญานอิเล็กทรอนิกส์ไปตามสายหรือออกอากาศ เช่น การออกอากาศทางวิทยุและโทรทัศน์ และอุปกรณ์การสื่อสารแบบไร้สาย เช่น ร้านขายปลีกโทรศัพท์ไร้สาย โทรศัพท์เคลื่อนที่ วิทยุติดตามตัว อุปกรณ์สื่อสารเคลื่อนที่ เครื่องโทรสาร เครื่องตอบรับโทรศัพท์ รวมถึงระบบสัญญาณกันขโมยและระบบสัญญาณแจ้งอัคคีภัย ร้านขายปลีกอุปกรณ์สื่อสารข้อมูล ได้แก่ บริดจ์ อุปกรณ์จัดเส้นทาง และเกตเวย์ ร้านขายปลีกอุปกรณ์อินฟราเรด (เช่น รีโมทคอนโทรล) อุปกรณ์สำหรับรับส่งวิทยุ โทรทัศน์และการออกอากาศ จานดาวเทียม อุปกรณ์เคเบิลทีวี และอุปกรณ์สื่อสารอื่น ๆ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47420",
                BusinessName = "การขายปลีกอุปกรณ์ที่เกี่ยวกับภาพและเสียงในร้านเฉพาะ",
                InfoTitle = "การขายปลีกอุปกรณ์ที่เกี่ยวกับภาพและเสียงในร้านเฉพาะ",
                InfoMessage = "การขายปลีกอุปกรณ์วิทยุและโทรทัศน์ สายอากาศ เครื่องขยายเสียง การขายปลีกเครื่องรับวิทยุและโทรทัศน์ การขายปลีกอุปกรณ์เครื่องสเตอริโอ รวมทั้งการขายปลีกเครื่องเล่นซีดีและดีวีดีและเครื่องบันทึกเสียง กล้องดิจิทัล เครื่องเล่นเทป",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47511",
                BusinessName = "การขายปลีกด้ายและผ้า",
                InfoTitle = "การขายปลีกด้ายและผ้า",
                InfoMessage = "การขายปลีกด้ายและเส้นด้ายที่ทำจากเส้นใยธรรมชาติหรือเส้นใยสังเคราะห์การขายปลีกผ้าที่ทำจากเส้นใยธรรมชาติ เช่น ผ้าแพร ผ้าฝ้าย ผ้าไหม ผ้าลินิน ผ้าขนแกะ ผ้าที่ทำจากเส้นใยสังเคราะห์ เช่น ผ้าโพลิเอสเทอร์ ผ้าไนล่อน ผ้าเรยอน ผ้าอะคริลิก ผ้าถักและผ้าถักโครเชต์ ผ้าชนิดพิเศษ เช่น ผ้ากำมะหยี่หรือผ้าทอแบบเชนิลล์ ผ้าขนหนู ผ้าก๊อซ ผ้าทอจากใยแก้ว ผ้าลูกไม้ ผ้าหน้าแคบ ผ้าปัก ผ้าที่ใช้ตกแต่ง สักหลาดและผ้าที่ไม่ได้ทอและสิ่งทออื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47512",
                BusinessName = "ร้านขายปลีกของใช้ในครัวเรือนที่ทำจากสิ่งทอ",
                InfoTitle = "ร้านขายปลีกของใช้ในครัวเรือนที่ทำจากสิ่งทอ",
                InfoMessage = "ร้านขายปลีกของใช้ในครัวเรือนที่ทำจากสิ่งทอ (ยกเว้น เครื่องแต่งกาย) เช่น เครื่องนอน ผ้าที่ใช้บนโต๊ะอาหาร ห้องน้ำและห้องครัว ถุงนอนและของที่เป็นเครื่องนอน ผ้าใบคลุมของ ผ้าใบบังแดด (ยกเว้น ม่านและม่านตาข่าย)และของใช้ในครัวเรือนอื่น ๆ ที่ทำจากสิ่งทอ ร้านขายปลีกเชือก เชือกเส้นใหญ่ ตาข่าย แหและอวน",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47513",
                BusinessName = "ร้านขายปลีกอุปกรณ์ตัดเย็บ",
                InfoTitle = "ร้านขายปลีกอุปกรณ์ตัดเย็บ",
                InfoMessage = "ร้านขายปลีกอุปกรณ์ตัดเย็บ เช่น ด้ายเย็บผ้า ด้ายปัก ไหมพรม เข็มเย็บผ้า เข็มถัก กระดุม ซิป เข็มหมุด ฯลฯ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47521",
                BusinessName = "ร้านขายปลีกเครื่องโลหะ",
                InfoTitle = "ร้านขายปลีกเครื่องโลหะ",
                InfoMessage = "ร้านขายปลีกเครื่องโลหะทั่วไป ซึ่งมิได้จัดประเภทไว้ในที่อื่น เช่น เครื่องมือที่ใช้งานด้วยมือ เครื่องโลหะสำหรับช่างก่อสร้าง เช่น กุญแจประตู ชุดกุญแจ ตะปู ควงและตะปู ฯลฯ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47522",
                BusinessName = "ร้านขายปลีกสีทาน้ำมันชักเงาและแลกเกอร์",
                InfoTitle = "ร้านขายปลีกสีทาน้ำมันชักเงาและแลกเกอร์",
                InfoMessage = "ร้านขายปลีกสีทา สีทาสิ่งปลูกสร้าง เช่น สีน้ำมัน สีพลาสติก สีน้ำและน้ำมันชักเงา น้ำยาเคลือบหรือแลกเกอร์ น้ำมันทาไม้ สารประกอบที่ใช้ยาแนว หรือวัสดุที่คล้ายกับวัสดุที่ใช้ในการอุดร่องหรือการเตรียมทำพื้นผิว สารทำละลายและทินเนอร์ น้ำยาล้างน้ำมันชักเงา",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47523",
                BusinessName = "ร้านขายปลีกอุปกรณ์การวางท่อและเครื่องสุขภัณฑ์",
                InfoTitle = "ร้านขายปลีกอุปกรณ์การวางท่อและเครื่องสุขภัณฑ์",
                InfoMessage = "ร้านขายปลีกอุปกรณ์การวางท่อ เช่น ท่อประปา การขายปลีกอุปกรณ์ติดตั้ง เช่น ท่อ ชิ้นส่วนประกอบ ก๊อกน้ำ ท่อรูปตัวT ข้อต่อ ร้านขายปลีกเครื่องสุขภัณฑ์ เช่น อ่างอาบน้ำ โถส้วม ของใช้ในห้องน้ำ อุปกรณ์ซาวน์น่าและเครื่องสุขภัณฑ์อื่น ๆ รวมถึงกระเบื้องปูพื้นและผนังที่ทำจากเซรามิก",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47524",
                BusinessName = "ร้านขายปลีกวัสดุก่อสร้างอื่นๆ",
                InfoTitle = "ร้านขายปลีกวัสดุก่อสร้างอื่นๆ",
                InfoMessage = "ร้านขายปลีกกระจกแผ่นเรียบ ร้านขายปลีกบล็อก เสา พื้นคอนกรีตสำเร็จ กระเบื้องมุงหลังคา แผ่นฝ้า แผ่นยิปซัม ร้านขายปลีกวัสดุปูพื้นและผนัง (ยกเว้น ที่ทำจากเซรามิก) เช่น บล็อกปูถนน หินประดับผนัง ร้านขายปลีก เครื่องตัดหญ้า ร้านขายปลีกวัสดุก่อสร้างอื่น ๆ เช่น ชิ้นส่วนและหน้าตัดรูปต่าง ๆ ที่ทำจากไม้ เหล็กและเหล็กกล้า ประตู หน้าต่างและเครื่องประกอบอาคารอื่น ๆ บล็อก ทราย กรวด ดินเหนียว ปูนซีเมนต์ ฯลฯ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47525",
                BusinessName = "ร้านขายปลีกวัสดุก่อสร้างหลายชนิดรวมถึงวัสดุอุปกรณ์และเครื่องมือชนิดนำไปใช้ทำงานได้ด้วยตัวเอง",
                InfoTitle = "ร้านขายปลีกวัสดุก่อสร้างหลายชนิดรวมถึงวัสดุอุปกรณ์และเครื่องมือชนิดนำไปใช้ทำงานได้ด้วยตัวเอง",
                InfoMessage = "ร้านขายปลีกอุปกรณ์และวัสดุก่อสร้างสินค้าหลายชนิด โดยไม่เฉพาะเจาะจงว่าเป็นวัสดุประเภทใด เช่น ไม้ โลหะ กระดาษ พลาสติก ผลิตภัณฑ์ยางหรือแก้ว และเคมีภัณฑ์ สีทา เครื่องสุขภัณฑ์ เครื่องโลหะ เช่น ค้อน เลื่อย ไขควง คีม จอบ เสียม พลั่ว ผลิตภัณฑ์คอนกรีต เครื่องจักรและเครื่องมือกล รวมถึงสำหรับนำไปใช้ทำเป็นงานอดิเรกหรืองานซ่อมที่ทำได้ด้วยตนเอง",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47530",
                BusinessName = "การขายปลีกพรมพรมหนาวัสดุปิดฝาผนังและปูพื้นในร้านค้าเฉพาะ",
                InfoTitle = "การขายปลีกพรมพรมหนาวัสดุปิดฝาผนังและปูพื้นในร้านค้าเฉพาะ",
                InfoMessage = "การขายปลีกพรมและพรมหนา การขายปลีกม่านและม่านตาข่ายหรือม่านโปร่ง การขายปลีกวอลเปเปอร์ และวัสดุปูพื้น",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47591",
                BusinessName = "ร้านขายปลีกเฟอร์นิเจอร์ชนิดใช้ในครัวเรือน",
                InfoTitle = "ร้านขายปลีกเฟอร์นิเจอร์ชนิดใช้ในครัวเรือน",
                InfoMessage = "การขายปลีกเฟอร์นิเจอร์ชนิดใช้ในครัวเรือนที่ทำจากวัสดุทุกชนิด เช่น โต๊ะหมู่บูชา กรอบรูป",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47592",
                BusinessName = "ร้านขายปลีกเครื่องดินเผาเครื่องแก้วและเครื่องครัว",
                InfoTitle = "ร้านขายปลีกเครื่องดินเผาเครื่องแก้วและเครื่องครัว",
                InfoMessage = "ร้านขายปลีกเครื่องแก้ว เครื่องเซรามิกและเครื่องใช้บนโต๊ะอาหารหรือในครัว ร้านขายปลีกของมีคมและเครื่องใช้ที่ทำจากโลหะชนิดใช้ในครัวเรือน เช่น มีด ช้อน ส้อม เครื่องใช้บนโต๊ะอาหาร หม้อ กระทะ กะละมัง ฯลฯ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47593",
                BusinessName = "ร้านขายปลีกอุปกรณ์ไฟฟ้าสำหรับให้แสงสว่าง",
                InfoTitle = "ร้านขายปลีกอุปกรณ์ไฟฟ้าสำหรับให้แสงสว่าง",
                InfoMessage = "ร้านขายปลีกหลอดไฟฟ้าและอุปกรณ์ไฟฟ้าสำหรับให้แสงสว่าง เช่น โคมไฟ หลอดไฟฟ้า โคมระย้า โคมไฟล่อแมลง ไฟฉาย ตะเกียง สปอตไลต์ ชุดไฟประดับต้นคริสต์มาส",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47594",
                BusinessName = "ร้านขายปลีกอุปกรณ์เกี่ยวกับเครื่องดนตรี",
                InfoTitle = "ร้านขายปลีกอุปกรณ์เกี่ยวกับเครื่องดนตรี",
                InfoMessage = "ร้านขายปลีกอุปกรณ์ เครื่องดนตรี โน้ตเพลง และอุปกรณ์สำหรับเครื่องดนตรี",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47595",
                BusinessName = "ร้านขายปลีกเครื่องใช้ไฟฟ้าชนิดในครัวเรือน",
                InfoTitle = "ร้านขายปลีกเครื่องใช้ไฟฟ้าชนิดในครัวเรือน",
                InfoMessage = "ร้านขายปลีกเครื่องใช้ไฟฟ้าชนิดใช้ในครัวเรือน ตู้เย็น ตู้แช่แข็ง เครื่องทำความเย็น เครื่องล้างจาน เครื่องซักผ้า เครื่องดูดฝุ่น เครื่องขัดพื้น เครื่องบด เครื่องปั่น/กวนและเครื่องคั้นน้ำผลไม้ เครื่องเปิดกระป๋อง แปรงสีฟันไฟฟ้า เครื่องทำน้ำร้อนด้วยไฟฟ้า ผ้าห่มไฟฟ้า เครื่องเป่าผม เครื่องม้วนผม เตารีดไฟฟ้า เครื่องทำความร้อนในห้อง เตาอบไฟฟ้า เตาอบไมโครเวฟ ฯลฯ เครื่องใช้ทำอาหารและให้ความร้อนที่ไม่ใช้ไฟฟ้า เช่น เตาหุงต้ม เตาไฟที่ไม่ใช้ไฟฟ้า เตาแก๊ส จักรเย็บผ้า",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47599",
                BusinessName = "ร้านขายปลีกของใช้อื่นๆ ในครัวเรือน ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "ร้านขายปลีกของใช้อื่นๆ ในครัวเรือน ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "ร้านขายปลีกถังไม้ ตะกร้าและเครื่องสาน ผลิตภัณฑ์ไม้อื่น ๆ และสิ่งของที่ทำจากไม้ก๊อก ร้านขายปลีกสิ่งของเครื่องใช้ในครัวเรือนที่ทำจากพลาสติก ร้านขายปลีกระบบรักษาความปลอดภัย โดยไม่รวมการให้บริการติดตั้งหรือบำรุงรักษา ร้านขายปลีกสิ่งของและเครื่องใช้อื่น ๆ ชนิดใช้ในครัวเรือน ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47611",
                BusinessName = "ร้านขายปลีกหนังสือหนังสือพิมพ์วารสารและนิตยสาร",
                InfoTitle = "ร้านขายปลีกหนังสือหนังสือพิมพ์วารสารและนิตยสาร",
                InfoMessage = "ร้านขายปลีกหนังสือ นวนิยาย ตำราเรียน แผนที่โลก พจนานุกรม สารานุกรมและหนังสืออื่น ๆ ร้านขายปลีกหนังสือพิมพ์ วารสารและนิตยสาร",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47612",
                BusinessName = "ร้านขายปลีกเครื่องเขียนและเครื่องใช้สำนักงาน",
                InfoTitle = "ร้านขายปลีกเครื่องเขียนและเครื่องใช้สำนักงาน",
                InfoMessage = "ร้านขายปลีกเครื่องเขียนและเครื่องใช้สำนักงาน เช่น กระดาษพิมพ์และเขียนกระดาษพิมพ์ที่ใช้กับคอมพิวเตอร์และกระดาษชนิดต่าง ๆ ปากกา ดินสอ หมึก สมุดทะเบียน สมุดบัญชี แบบฟอร์มทางธุรกิจ การ์ดอวยพร ฯลฯ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47620",
                BusinessName = "การขายปลีกสื่อบันทึกเสียงเพลงและสื่อบันทึกวีดิทัศน์ในร้านค้าเฉพาะ",
                InfoTitle = "การขายปลีกสื่อบันทึกเสียงเพลงและสื่อบันทึกวีดิทัศน์ในร้านค้าเฉพาะ",
                InfoMessage = "การขายปลีกแผ่นเสียง เทปเพลง แผ่นซีดีและคาสเซ็ท การขายปลีกแถบวีดิทัศน์ และดีวีดี นอกจากนี้ ยังรวมถึงการขายปลีกเทปเปล่าและแผ่นดิสก์",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47630",
                BusinessName = "การขายปลีกเครื่องกีฬาในร้านค้าเฉพาะ",
                InfoTitle = "การขายปลีกเครื่องกีฬาในร้านค้าเฉพาะ",
                InfoMessage = "การขายปลีกเครื่องกีฬา เสื้อผ้ากีฬา รองเท้ากีฬา อุปกรณ์ตกปลา อุปกรณ์สำหรับการตั้งค่ายพักแรม เรือเล็กและจักรยาน",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47640",
                BusinessName = "การขายปลีกเกมและของเล่นในร้านค้าเฉพาะ",
                InfoTitle = "การขายปลีกเกมและของเล่นในร้านค้าเฉพาะ",
                InfoMessage = "การขายปลีกเกมและของเล่นซึ่งทำจากวัสดุทุกชนิด",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47691",
                BusinessName = "ร้านขายปลีกผลิตภัณฑ์งานฝีมือคนไทยและของที่ระลึก",
                InfoTitle = "ร้านขายปลีกผลิตภัณฑ์งานฝีมือคนไทยและของที่ระลึก",
                InfoMessage = "ร้านขายปลีกผลิตภัณฑ์งานหัตถกรรมฝีมือคนไทย และของที่ระลึกที่ขายสินค้าหลายชนิด รวมกัน เช่น เครื่องเงิน เครื่องถม เครื่องทองเหลือง งานหัตถกรรม ของที่ระลึก เครื่องใช้ในครัวเรือน และเครื่องตกแต่งที่ทำจากวัสดุสิ่งทอ เช่น ผ้าม่าน ม่านตาข่าย ไหมไทย และของที่ทำจากไม้ ไม้ก๊อกและเครื่องจักสาน และผลิตภัณฑ์ที่เป็นงานฝีมือคนไทยชนิดต่าง ๆ งาช้าง",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47699",
                BusinessName = "ร้านขายปลีกสินค้าทางวัฒนธรรมและนันทนาการอื่นๆซึ่งมิได้ จัดประเภทไว้ในที่อื่น",
                InfoTitle = "ร้านขายปลีกสินค้าทางวัฒนธรรมและนันทนาการอื่นๆซึ่งมิได้ จัดประเภทไว้ในที่อื่น",
                InfoMessage = "การขายปลีกและการจัดแสดงผลงานของห้องแสดงผลงานทางศิลปะเพื่อการพาณิชย์ ร้านขายปลีกแสตมป์และเหรียญกษาปณ์ ร้านขายปลีกสินค้าทางวัฒนธรรมและนันทนาการอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47711",
                BusinessName = "ร้านขายปลีกเสื้อผ้า",
                InfoTitle = "ร้านขายปลีกเสื้อผ้า",
                InfoMessage = "ร้านขายปลีกเสื้อผ้าสำเร็จรูป เครื่องตกแต่งเสื้อผ้า สำหรับบุรุษ สตรี เด็ก และ เด็กอ่อน เช่น เสื้อ กางเกง หมวก เสื้อชุดของสตรี เสื้อคลุม หมวกผู้หญิง ถุงมือ ผ้าเช็ดหน้า เนคไท เข็มขัด ชุดอาบน้ำ ชุดกีฬา รวมถึงเสื้อผ้าและ เครื่องแต่งกายที่ทำจากขนสัตว์ และหนังสัตว์",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47712",
                BusinessName = "ร้านขายปลีกรองเท้า",
                InfoTitle = "ร้านขายปลีกรองเท้า",
                InfoMessage = "ร้านขายปลีกรองเท้าบุรุษ สตรี เด็กและเด็กอ่อนที่ทำจากหนังสัตว์ วัตถุใช้แทน หนัง ยาง พลาสติกหรือวัสดุหลายชนิดประกอบกัน (ยกเว้น รองเท้ากีฬา)",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47713",
                BusinessName = "ร้านขายปลีกเครื่องหนังยกเว้นรองเท้า",
                InfoTitle = "ร้านขายปลีกเครื่องหนังยกเว้นรองเท้า",
                InfoMessage = "การขายปลีกสินค้าที่ทำจากหนังสัตว์ หรือวัสดุใช้แทนหนัง เช่น กระเป๋าถือ กระเป๋าเอกสาร กระเป๋าใส่เงิน และสินค้าที่ใช้สำหรับการเดินทาง เช่น เครื่องอานและเครื่องเทียมลากและเครื่องหนังอื่น ๆ (ยกเว้น รองเท้า)",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47721",
                BusinessName = "ร้านขายปลีกสินค้าทางเภสัชภัณฑ์และเวชภัณฑ์",
                InfoTitle = "ร้านขายปลีกสินค้าทางเภสัชภัณฑ์และเวชภัณฑ์",
                InfoMessage = "การขายปลีกยารักษาโรค ผลิตภัณฑ์ยาอื่น ๆ รวมถึงการขายปลีกสมุนไพรและเครื่องเทศที่ใช้ทำยาไทยแผนโบราณ และอุปกรณ์ทางการแพทย์ และผลิตภัณฑ์เสริมอาหาร",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47722",
                BusinessName = "ร้านขายปลีกเครื่องหอม",
                InfoTitle = "ร้านขายปลีกเครื่องหอม",
                InfoMessage = "ร้านขายปลีกเครื่องหอม เช่น หัวน้ำหอมและน้ำหอม น้ำมันหอมระเหย (เอสเซนเชียลออยล์) ธูปหอม กำยาน เทียนหอม เกลือหอม ฯลฯ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47723",
                BusinessName = "ร้านขายปลีกเครื่องสำอาง",
                InfoTitle = "ร้านขายปลีกเครื่องสำอาง",
                InfoMessage = "ร้านขายปลีกเครื่องสำอาง รวมถึงสิ่งปรุงแต่งสำหรับประทินร่างกายหรือประเทืองโฉม ครีมบำรุงผิว โลชั่น ยาสีฟัน สบู่ ผลิตภัณฑ์สปาที่อยู่ในร้านเครื่องสำอาง",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47731",
                BusinessName = "ร้านขายปลีกนาฬิกาแว่นตาและอุปกรณ์ถ่ายภาพ",
                InfoTitle = "ร้านขายปลีกนาฬิกาแว่นตาและอุปกรณ์ถ่ายภาพ",
                InfoMessage = "ร้านขายปลีกนาฬิกา สายนาฬิกา อุปกรณ์เกี่ยวกับสายตา เครื่องมือตรวจวัดความชัดเจนของสายตา เครื่องมือจักษุแพทย์ ร้านขายปลีกอุปกรณ์ถ่ายภาพ เช่น อุปกรณ์ถ่ายภาพ (ยกเว้น กล้องดิจิทัล) เพลตและฟิล์ม รวมถึงการซ่อมนาฬิกาด้วย หากการซ่อมนั้นเกี่ยวเนื่องกับการค้าปลีกสินค้าดังกล่าว",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47732",
                BusinessName = "ร้านขายปลีกเครื่องประดับ",
                InfoTitle = "ร้านขายปลีกเครื่องประดับ",
                InfoMessage = "ร้านขายปลีกเครื่องประดับ เช่น ทอง ทองคำแท่งและทองรูปพรรณ หินมีค่า นาก เงิน อัญมณีอื่นๆ และเครื่องเพชรพลอย ทั้งแท้และเทียม",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47733",
                BusinessName = "ร้านขายปลีกดอกไม้ต้นไม้และอุปกรณ์ที่เกี่ยวข้อง",
                InfoTitle = "ร้านขายปลีกดอกไม้ต้นไม้และอุปกรณ์ที่เกี่ยวข้อง",
                InfoMessage = "ร้านขายปลีกดอกไม้ ต้นไม้ ไม้ประดับ และเมล็ดพันธุ์ ปุ๋ย ยาฆ่าแมลงและยาปราบศัตรูพืช และยำบำรุงพืช ร้านขายปลีกอุปกรณ์ประดับตกแต่งสวน รวมถึงดินกระถางปลูกต้นไม้",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47734",
                BusinessName = "ร้านขายปลีกสัตว์เลี้ยงและอุปกรณ์ที่เกี่ยวข้อง",
                InfoTitle = "ร้านขายปลีกสัตว์เลี้ยงและอุปกรณ์ที่เกี่ยวข้อง",
                InfoMessage = "ร้านขายปลีกสัตว์เลี้ยง เช่น สุนัข แมว หนู หรืออาหารและอุปกรณ์เครื่องใช้สำหรับสัตว์เลี้ยง เช่น กรง ปลอกคอ กระดิ่ง ของเล่น",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47735",
                BusinessName = "ร้านขายปลีกก๊าซและเชื้อเพลิงอื่นๆสำหรับใช้ในครัวเรือน",
                InfoTitle = "ร้านขายปลีกก๊าซและเชื้อเพลิงอื่นๆสำหรับใช้ในครัวเรือน",
                InfoMessage = "ร้านขายปลีกก๊าซและเชื้อเพลิงชนิดต่าง ๆ สำหรับใช้ในครัวเรือน เช่น น้ำมันเชื้อเพลิง ก๊าซหุงต้ม ถ่านหินและลิกไนต์ ถ่านไม้และไม้ฟืน",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47739",
                BusinessName = "ร้านขายปลีกสินค้าใหม่อื่นๆซึ่งมิได้จัดประเภทไว้ในทื่อื่น",
                InfoTitle = "ร้านขายปลีกสินค้าใหม่อื่นๆซึ่งมิได้จัดประเภทไว้ในทื่อื่น",
                InfoMessage = "ร้านขายปลีกสินค้าที่เกี่ยวข้องกับศาสนา กิจกรรมของร้านค้าภาพเขียนและศิลป วัตถุ ศาลพระภูมิ ให้เช่าพระพุทธรูป อุปกรณ์การขนส่ง การขายปลีกอาวุธและกระสุน วัตถุระเบิด ดินปืน ยุทโธปกรณ์อื่นที่ใช้ในการรบ อุปกรณ์หรือส่วนประกอบของยุทโธปกรณ์ ร้านขายปลีกวัสดุในการทำความสะอาด และขัดเงา ร้านขายปลีกผลิตภัณฑ์ที่ไม่ใช่อาหาร ร้านขายปลีกผลิตภัณฑ์ทำความสะอาด เช่น ผงซักฟอก น้ำยาปรับผ้านุ่ม น้ำยาล้างจาน น้ำยาล้างห้องน้ำ และสินค้าอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47741",
                BusinessName = "ร้านขายปลีกวัตถุโบราณ",
                InfoTitle = "ร้านขายปลีกวัตถุโบราณ",
                InfoMessage = "ร้านขายปลีกวัตถุโบราณ รวมถึงกิจกรรมของห้องประมูล (ขายปลีก)",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47742",
                BusinessName = "ร้านขายปลีกเครื่องแต่งกายรองเท้าและเครื่องหนังที่ใช้แล้ว",
                InfoTitle = "ร้านขายปลีกเครื่องแต่งกายรองเท้าและเครื่องหนังที่ใช้แล้ว",
                InfoMessage = "ร้านขายปลีกเครื่องแต่งกาย ของที่ใช้ประกอบเครื่องแต่งกายและรองเท้าที่ใช้แล้ว ร้านขายปลีกผลิตภัณฑ์ที่ทำจากผ้าที่ใช้แล้ว ร้านขายปลีกเครื่องหนัง และสินค้าที่ใช้สำหรับการเดินทางที่ใช้แล้ว",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47743",
                BusinessName = "ร้านขายปลีกคอมพิวเตอร์และอุปกรณ์สื่อสารโทรคมนาคมที่ใช้แล้ว",
                InfoTitle = "ร้านขายปลีกคอมพิวเตอร์และอุปกรณ์สื่อสารโทรคมนาคมที่ใช้แล้ว",
                InfoMessage = "ร้านขายปลีกคอมพิวเตอร์และอุปกรณ์ต่อพ่วงที่ใช้แล้ว ร้านขายปลีกอุปกรณ์การสื่อสารโทรคมนาคมที่ใช้แล้ว เช่น โทรศัพท์ โทรศัพท์เคลื่อนที่",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47744",
                BusinessName = "ร้านขายปลีกเครื่องใช้ไฟฟ้าและอิเล็กทรอนิกส์ชนิดใช้ในครัวเรือนที่ใช้แล้ว",
                InfoTitle = "ร้านขายปลีกเครื่องใช้ไฟฟ้าและอิเล็กทรอนิกส์ชนิดใช้ในครัวเรือนที่ใช้แล้ว",
                InfoMessage = "ร้านขายปลีกเครื่องใช้ไฟฟ้าที่ใช้แล้ว เช่น ตู้เย็น เครื่องซักผ้า เตาอบไมโครเวฟ เตาหุงต้ม ร้านขายปลีกอุปกรณ์ไฟฟ้าสำหรับให้แสงสว่างที่ใช้แล้ว เช่น โคมระย้า ตะเกียง ร้านขายปลีกเครื่องใช้อิเล็กทรอนิกส์ที่ใช้แล้ว เช่น วิทยุ โทรทัศน์ เครื่องเล่นซีดีและดีวีดี กล้องดิจิทัล",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47745",
                BusinessName = "ร้านขายปลีกหนังสือหนังสือพิมพ์วารสารและนิตยสารที่ใช้แล้ว",
                InfoTitle = "ร้านขายปลีกหนังสือหนังสือพิมพ์วารสารและนิตยสารที่ใช้แล้ว",
                InfoMessage = "ร้านขายปลีกหนังสือ นวนิยาย ตำราเรียน แผนที่โลก พจนานุกรม สารานุกรม วารสารและนิตยสารที่ใช้แล้ว",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47749",
                BusinessName = "ร้านขายปลีกสินค้าใช้แล้วอื่นๆซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "ร้านขายปลีกสินค้าใช้แล้วอื่นๆซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "ร้านขายปลีกเฟอร์นิเจอร์ชนิดใช้ในครัวเรือนที่ใช้แล้ว ร้านขายปลีกของมีคม เครื่องใช้ที่ทำจากโลหะ เครื่องแก้ว เครื่องเซรามิกและของประดับตกแต่งชนิดใช้ในครัวเรือน ที่ใช้แล้ว ร้านขายปลีกสื่อบันทึกเสียงและภาพที่ใช้แล้ว ร้านขายปลีกอุปกรณ์การกีฬา เกมและของเล่น แสตมป์ เหรียญกษาปณ์ที่ใช้แล้ว ร้านขายปลีกสินค้าใช้แล้วอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น เช่น พรม และพรมหนา ม่าน กล้องถ่ายรูป (ยกเว้น กล้องดิจิทัล) นาฬิกา เครื่องเพชร พลอย เครื่องมือช่าง",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47811",
                BusinessName = "การขายปลีกผลิตภัณฑ์อาหารบนแผงลอยและตลาด",
                InfoTitle = "การขายปลีกผลิตภัณฑ์อาหารบนแผงลอยและตลาด",
                InfoMessage = "การขายปลีกอาหารบนแผงลอยและตลาด เช่น เนื้อสัตว์และผลิตภัณฑ์จากเนื้อสัตว์ สัตว์น้ำและผลิตภัณฑ์จากสัตว์น้ำ ผักและผลไม้ นม ไข่ น้ำมัน และไขมันที่ใช้ในการบริโภค น้ำตาล ขนมที่ทำจากน้ำตาลและผลิตภัณฑ์ขนมอบ ข้าวและผลิตภัณฑ์ที่ได้จากการโม่-สีธัญพืช กาแฟ ชา โกโก้ เครื่องปรุงและเครื่องเทศ อาหารสำเร็จรูป มะกะโรนี เส้นก๋วยเตี๋ยวและผลิตภัณฑ์อาหารประเภทแป้งที่คล้ายกัน และอาหารอื่น ๆ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47812",
                BusinessName = "การขายปลีกเครื่องดื่มบนแผงลอยและตลาด",
                InfoTitle = "การขายปลีกเครื่องดื่มบนแผงลอยและตลาด",
                InfoMessage = "การขายปลีกเครื่องดื่มบนแผงลอยและตลาด ทั้งเครื่องดื่มที่มีแอลกอฮอล์ เช่น สุรา ไวน์ เบียร์และเครื่องดื่มที่ไม่มีแอลกอฮอล์ เช่น น้ำแร่และน้ำดื่มบรรจุขวดน้ำอัดลม น้ำผักและผลไม้และน้ำธัญพืช เครื่องดื่มให้พลังงานหรือเครื่องดื่มเกลือแร่",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47813",
                BusinessName = "การขายปลีกผลิตภัณฑ์ยาสูบบนแผงลอยและตลาด",
                InfoTitle = "การขายปลีกผลิตภัณฑ์ยาสูบบนแผงลอยและตลาด",
                InfoMessage = "การขายปลีกผลิตภัณฑ์ยาสูบบนแผงลอยและตลาด เช่น บุหรี่และซิการ์ ยาเส้น ยาสูบใช้เคี้ยว (เช่น ยาแดง ยาจืด ยาฉุน)และยานัตถุ์",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47821",
                BusinessName = "การขายปลีกสิ่งทอบนแผงลอยและตลาด",
                InfoTitle = "การขายปลีกสิ่งทอบนแผงลอยและตลาด",
                InfoMessage = "การขายปลีกสิ่งทอบนแผงลอยและตลาด เช่น ผ้า ผ้าฝ้าย ผ้าไหม ผ้าลินิน ผ้าโพลิเอสเทอร์ ผ้าไนล่อน ผ้ายืน ผ้าโปร่ง ผ้าลูกไม้ ผ้าปัก ผ้าที่ใช้ตกแต่งสักหลาดและผ้าไม่ทอและสิ่งทออื่น ๆ ของใช้ในครัวเรือนที่ จากผ้า (ยกเว้น เครื่องแต่งกาย) เช่น เครื่องนอน ผ้าที่ใช้บนโต๊ะอาหาร ห้องน้ำและห้องครัว ผ้าใบคลุมของ ผ้าใบบังแดด (ยกเว้น ม่านและม่านตาข่าย)และของใช้ในครัวเรือนอื่น ๆ ที่ทำจากผ้า รวมถึงเชือก ตาข่าย แห และอวน",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47822",
                BusinessName = "การขายปลีกเสื้อผ้ารองเท้าและเครื่องหนังบนแผงลอยและตลาด",
                InfoTitle = "การขายปลีกเสื้อผ้ารองเท้าและเครื่องหนังบนแผงลอยและตลาด",
                InfoMessage = "การขายปลีกเสื้อผ้า รองเท้าและเครื่องหนังบนแผงลอยและตลาด เสื้อผ้า หมวก และของที่ใช้ประกอบเครื่องแต่งกาย รองเท้าที่ทำจากวัสดุทุกชนิดสำหรับใช้งานทุกประเภท (ยกเว้น รองเท้ากีฬา) กระเป๋าเดินทาง กระเป๋าถือและสิ่งที่คล้ายกัน เครื่องอานและเครื่องเทียมลากและเครื่องหนังอื่น ๆ (ยกเว้น ของเล่นสำหรับสัตว์เลี้ยงและสายนาฬิกาหนัง)",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47891",
                BusinessName = "การขายปลีกคอมพิวเตอร์และอุปกรณ์สื่อสารโทรคมนาคม บนแผงลอยและตลาด",
                InfoTitle = "การขายปลีกคอมพิวเตอร์และอุปกรณ์สื่อสารโทรคมนาคม บนแผงลอยและตลาด",
                InfoMessage = "การขายปลีกคอมพิวเตอร์และอุปกรณ์สื่อสารโทรคมนาคมบนแผงลอยและตลาด คอมพิวเตอร์ และอุปกรณ์ต่อพ่วง เช่น อุปกรณ์จัดเก็บข้อมูล เครื่องพิมพ์ จอภาพ แป้นอักขระ เม้าส์ ก้านควบคุมและลูกบอลควบคุม ฯลฯ ซอฟต์แวร์สำเร็จรูป เครื่องเล่นวีดีโอเกมคอนโซล และวีดีโอเกม โทรศัพท์ โทรศัพท์เคลื่อนที่ วิทยุติดตามตัว เครื่องโทรสาร เสาอากาศ อุปกรณ์เคเบิลทีวี และอุปกรณ์สื่อสารอื่น ๆ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47892",
                BusinessName = "การขายปลีกเครื่องใช้ไฟฟ้าและอิเล็กทรอนิกส์ชนิดใช้ในครัวเรือนบนแผงลอยและตลาด",
                InfoTitle = "การขายปลีกเครื่องใช้ไฟฟ้าและอิเล็กทรอนิกส์ชนิดใช้ในครัวเรือนบนแผงลอยและตลาด",
                InfoMessage = "การขายปลีกเครื่องใช้ไฟฟ้าและอิเล็กทรอนิกส์ชนิดใช้ในครัวเรือนบนแผงลอยและตลาด อุปกรณ์เสียงและภาพเพื่อความบันเทิงในบ้านหรือยานยนต์ เครื่องขยายเสียง วิทยุและโทรทัศน์ เครื่องเล่นและเครื่องบันทึกซีดีและดีวีดี กล้องวีดิทัศน์ กล้องดิจิทัล ฯลฯ เครื่องใช้ไฟฟ้า เช่น ตู้เย็น เครื่องซักผ้า เตาอบไมโครเวฟ เตาหุงต้ม อุปกรณ์ไฟฟ้าสำหรับให้แสงสว่าง เช่น โคมระย้า ตะเกียง",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47893",
                BusinessName = "การขายปลีกหนังสือหนังสือพิมพ์วารสารและนิตยสาร บนแผงลอยและตลาด",
                InfoTitle = "การขายปลีกหนังสือหนังสือพิมพ์วารสารและนิตยสาร บนแผงลอยและตลาด",
                InfoMessage = "การขายปลีกหนังสือ หนังสือพิมพ์ วารสาร นิตยสาร นวนิยาย ตำราเรียน แผนที่โลก พจนานุกรม สารานุกรมและอื่น ๆ บนแผงลอยและตลาด",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47894",
                BusinessName = "การขายปลีกสื่อบันทึกเสียงและภาพบนแผงลอยและตลาด",
                InfoTitle = "การขายปลีกสื่อบันทึกเสียงและภาพบนแผงลอยและตลาด",
                InfoMessage = "การขายปลีกสื่อบันทึกเสียงและภาพบนแผงลอยและตลาด แผ่นเสียง เทปบันทึกเสียง แถบวีดิทัศน์ แผ่นซีดีและดีวีดีที่บันทึกข้อมูลแล้ว เช่น แผ่นซีดี ดีวีดีที่บันทึกเพลง ภาพยนตร์ ฯลฯ เทปและแผ่นดิสก์ที่ยังไม่ได้บันทึกข้อมูล",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47895",
                BusinessName = "การขายปลีกสินค้าทางเภสัชภัณฑ์และเวชภัณฑ์ เครื่องหอมและเครื่องสำอางบนแผงลอยและตลาด",
                InfoTitle = "การขายปลีกสินค้าทางเภสัชภัณฑ์และเวชภัณฑ์ เครื่องหอมและเครื่องสำอางบนแผงลอยและตลาด",
                InfoMessage = "การขายปลีกสินค้าทางเภสัชภัณฑ์และเวชภัณฑ์ ชุดปฐมพยาบาล เครื่องหอม หัวน้ำหอมและน้ำหอม น้ำมันหอมระเหย ธูปหอม เทียนหอม เกลือหอมและเครื่องสำอางบนแผงลอยและตลาด",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47896",
                BusinessName = "การขายปลีกนาฬิกาแว่นตาเครื่องเพชรพลอยบนแผงลอย และตลาด",
                InfoTitle = "การขายปลีกนาฬิกาแว่นตาเครื่องเพชรพลอยบนแผงลอย และตลาด",
                InfoMessage = "การขายปลีกนาฬิกา สายนาฬิกา แว่นตา เครื่องเพชรพลอยทั้งแท้และเทียมบนแผงลอยและตลาด",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47897",
                BusinessName = "การขายปลีกดอกไม้ต้นไม้สัตว์เลี้ยงและอาหารสำหรับสัตว์เลี้ยงบนแผงลอยและตลาด",
                InfoTitle = "การขายปลีกดอกไม้ต้นไม้สัตว์เลี้ยงและอาหารสำหรับสัตว์เลี้ยงบนแผงลอยและตลาด",
                InfoMessage = "การขายปลีกดอกไม้ ต้นไม้ เมล็ดพันธุ์ ปุ๋ย ยาฆ่าแมลง ยาปราบศัตรูพืช สัตว์เลี้ยง อุปกรณ์สำหรับสัตว์เลี้ยงและอาหารสำหรับสัตว์เลี้ยงบนแผงลอยและตลาด",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47899",
                BusinessName = "การขายปลีกสินค้าอื่นๆซึ่งมิได้จัดประเภทไว้ในที่อื่นบนแผงลอยและตลาด",
                InfoTitle = "การขายปลีกสินค้าอื่นๆซึ่งมิได้จัดประเภทไว้ในที่อื่นบนแผงลอยและตลาด",
                InfoMessage = "การขายปลีกสินค้าอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น บนแผงลอยและตลาด เฟอร์นิเจอร์ชนิดใช้ในครัวเรือน ของมีคม เครื่องแก้ว เครื่องเซรามิกและของประดับตกแต่ง ถังไม้ ตะกร้า เครื่องสานและของใช้ในครัวเรือนอื่น ๆ เครื่องเขียนและเครื่องใช้สำนักงาน เครื่องกีฬา เสื้อผ้าและรองเท้ากีฬาและอุปกรณ์ค่ายพักแรม ตุ๊กตา ของเล่น เกม ของที่ระลึก งานหัตถกรรมและของสำหรับใช้ในทางศาสนา เครื่องโลหะ พรม พรมหนา ม่านและวอลเปเปอร์ สิ่งของและเครื่องใช้อื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47911",
                BusinessName = "การขายปลีกโดยการรับสั่งสินค้าทางไปรษณีย์โทรทัศน์วิทยุ และโทรศัพท์",
                InfoTitle = "การขายปลีกโดยการรับสั่งสินค้าทางไปรษณีย์โทรทัศน์วิทยุ และโทรศัพท์",
                InfoMessage = "การขายปลีกโดยการรับสั่งสินค้าทางไปรษณีย์ โทรทัศน์ วิทยุและโทรศัพท์และผู้ขายจะทำการจัดส่งสินค้ากับให้ลูกค้า โดยผู้ซื้อจะทำการตัดสินใจซื้อโดยพิจารณาจากโฆษณา ใบรายการสินค้า (shopping channel) ได้แก่ การขายสินค้าประเภทอาหาร เครื่องดื่มและผลิตภัณฑ์ยาสูบ สิ่งทอ เสื้อผ้า รองเท้าและเครื่องหนัง สินค้าทางเภสัชภัณฑ์และทางการแพทย์ เครื่องหอมและเครื่องสำอาง คอมพิวเตอร์ อุปกรณ์สื่อสารโทรคมนาคม เครื่องใช้ไฟฟ้าและอิเล็กทรอนิกส์ สินค้าวัฒนธรรมและพักผ่อนหย่อนใจ สินค้าทางเภสัชภัณฑ์และทางการแพทย์ เครื่องหอมและเครื่องสำอาง เป็นต้น",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47912",
                BusinessName = "การขายปลีกทางอินเทอร์เน็ต",
                InfoTitle = "การขายปลีกทางอินเทอร์เน็ต",
                InfoMessage = "การขายปลีกทางอินเทอร์เน็ต โดยผู้ซื้อจะตัดสินใจซื้อโดยพิจารณาจากโฆษณาและข้อมูลบนอินเทอร์เน็ต โดยปกติจะผ่านกระบวนการที่จัดไว้เป็นการเฉพาะในเว็บไซต์และผลิตภัณฑ์ที่สั่งซื้อจะดาวน์โหลดผ่านทางอินเทอร์เน็ตหรืออาจทำการจัดส่งสินค้าให้กับลูกค้าก็ได้ รวมถึงการขายปลีกโดยการประมูลขายปลีกสินค้าทางอินเทอร์เน็ต ได้แก่ การขายสินค้าประเภทอาหาร เครื่องดื่มและผลิตภัณฑ์ยาสูบ สิ่งทอ เสื้อผ้า รองเท้าและเครื่องหนัง สินค้าทางเภสัชภัณฑ์และทางการแพทย์ เครื่องหอมและเครื่องสำอาง คอมพิวเตอร์ อุปกรณ์สื่อสารโทรคมนาคม เครื่องใช้ไฟฟ้าและอิเล็กทรอนิกส์ สินค้าวัฒนธรรมและพักผ่อนหย่อนใจ สินค้าทางเภสัชภัณฑ์และทางการแพทย์ เครื่องหอมและเครื่องสำอาง เป็นต้น ทั้งนี้รวมถึงวิธีการ ขายทอดตลาดสินค้าดังกล่าว",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47991",
                BusinessName = "การขายตรง",
                InfoTitle = "การขายตรง",
                InfoMessage = "การขายปลีกโดยตัวแทนขายที่ได้รับค่าตอบแทน (ไม่มีร้าน) การขายตรงรวมถึงสำนักงานใหญ่ของการขายตรง ได้แก่ การขายสินค้าประเภทอาหาร เครื่องดื่มและผลิตภัณฑ์ยาสูบ สิ่งทอ เสื้อผ้า รองเท้าและเครื่องหนัง สินค้าทางเภสัชภัณฑ์ และทางการแพทย์ เครื่องหอมและเครื่องสำอาง คอมพิวเตอร์ อุปกรณ์สื่อสารโทรคมนาคม เครื่องใช้ไฟฟ้าและ อิเล็กทรอนิกส์ สินค้าวัฒนธรรมและพักผ่อนหย่อนใจ สินค้าทางเภสัชภัณฑ์และทางการแพทย์ เครื่องหอมและเครื่องสำอาง เป็นต้น",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Retail,
                TSIC = "47999",
                BusinessName = "การขายปลีกโดยไม่มีร้านซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "การขายปลีกโดยไม่มีร้านซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "การขายปลีกโดยเร่ขายสินค้าตามถนนหรือตามบ้าน การขายปลีกโดยเครื่องขายสินค้าแบบหยอดเหรียญ การประมูลโดยไม่มีร้านอื่น ๆ (ขายปลีก) ได้แก่ การขายสินค้าประเภทอาหาร เครื่องดื่มและผลิตภัณฑ์ยาสูบ สิ่งทอ เสื้อผ้า รองเท้าและเครื่องหนัง สินค้าทางเภสัชภัณฑ์และทางการแพทย์ เครื่องหอม และเครื่องสำอาง คอมพิวเตอร์ อุปกรณ์สื่อสาร โทรคมนาคม เครื่องใช้ไฟฟ้าและอิเล็กทรอนิกส์ สินค้าวัฒนธรรม และพักผ่อนหย่อนใจ สินค้าทางเภสัชภัณฑ์และทางการแพทย์ เครื่องหอม และเครื่องสำอาง เป็นต้น",
            });

            return model;
        }

        private static List<DBDBusinessModel> AddCoffeeshop()
        {
            List<DBDBusinessModel> model = new List<DBDBusinessModel>();

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.CoffeeShop,
                TSIC = "68102",
                BusinessName = "การซื้อและการขายอสังหาริมทรัพย์ที่เป็นของตนเองที่ไม่ใช่ เพื่อเป็นที่พักอาศัย",
                InfoTitle = "การซื้อและการขายอสังหาริมทรัพย์ที่เป็นของตนเองที่ไม่ใช่ เพื่อเป็นที่พักอาศัย",
                InfoMessage = "การซื้อและการขายอสังหาริมทรัพย์ที่เป็นของตนเองที่ไม่ใช่เพื่อเป็นที่พักอาศัย เช่น โรงงาน อาคาร สำนักงาน ตลาด อาคารเก็บของ และอาคารซึ่งไม่ใช่เป็นที่พักอาศัยอื่น ๆ รวมถึงอาคารจัดงาน ห้างสรรพสินค้า ศูนย์การค้า โรงภาพยนตร์ และสิ่งปลูกสร้างอเนกประสงค์ที่ไม่ใช่เพื่อเป็นที่พักอาศัย การจัดสรรที่ดินโดยไม่มีการพัฒนาที่ดิน (เช่น จัดทำถนนและสาธารณูปโภคเพิ่มเติม)",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.CoffeeShop,
                TSIC = "68104",
                BusinessName = "การเช่าและการดำเนินการเกี่ยวกับอสังหาริมทรัพย์ที่เป็นของ ตนเองหรือเช่าจากผู้อื่นที่ไม่ใช่เพื่อเป็นที่พักอาศัย",
                InfoTitle = "การเช่าและการดำเนินการเกี่ยวกับอสังหาริมทรัพย์ที่เป็นของ ตนเองหรือเช่าจากผู้อื่นที่ไม่ใช่เพื่อเป็นที่พักอาศัย",
                InfoMessage = "การเช่าและการดำเนินการเกี่ยวกับอสังหาริมทรัพย์ที่เป็นของตนเองหรือเช่าจากผู้อื่นที่ไม่ใช่ที่พักอาศัย ซึ่งมักจะเช่าเป็นรายเดือน เช่น โรงงาน อาคารสำนักงาน ตลาดและอาคารเก็บของ อาคารซึ่งไม่ใช่ที่พักอาศัย รวมถึงอาคาร จัดงาน ห้างสรรพสินค้า ศูนย์การค้า โรงภาพยนตร์ และสิ่งปลูกสร้างอเนกประสงค์ที่ไม่ใช่เพื่อเป็นที่พักอาศัย การให้เช่าที่ดิน โครงการพัฒนาอาคารสำหรับให้เช่าที่เจ้าของเป็นผู้ดำเนินการเอง",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.CoffeeShop,
                TSIC = "96309",
                BusinessName = "กิจกรรมการบริการอื่น ๆ ส่วนบุคคลซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "กิจกรรมการบริการอื่น ๆ ส่วนบุคคลซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "กิจกรรมเกี่ยวกับการนัดหมายและสำนักงานจัดหาคู่ กิจกรรมเกี่ยวกับการลำดับ หรือสืบวงศ์ตระกูลหรือเครือญาติ การบริการสักและเจาะตามร่างกาย การบริการขนของ ขัดรองเท้า ให้บริการการจอดรถ การบริการห้องน้ำสาธารณะการบริการตัดกุญแจ สะเดาะกุญแจ การบริการนำรถไปจอด กิจกรรมการบริการส่วนบุคคลอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น เช่น บริการจัดการงานแต่งงาน บริการจดทะเบียนรถยนต์ รถจักรยานยนต์ รับต่อ พรบ. เติมเงินมือถือ รับชำระค่าบริการสาธารณูปโภค รับทำวีซ่า ต่อหนังสือเดินทาง พิสูจน์สัญชาติแรงงานต่างด้าว",
            });

            return model; 
        }

        private static List<DBDBusinessModel> AddHotel() 
        {
            List<DBDBusinessModel> model = new List<DBDBusinessModel>();

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Hotel,
                TSIC = "55200",
                BusinessName = "ลานตั้งค่ายพักแรม ที่จอดรถพ่วงและที่ตั้งที่พักแบบเคลื่อนที่",
                InfoTitle = "ลานตั้งค่ายพักแรม ที่จอดรถพ่วงและที่ตั้งที่พักแบบเคลื่อนที่",
                InfoMessage = "การจัดที่พักแรมในลานตั้งค่าย ที่จอดรถพ่วง ค่ายนันทนาการ ค่ายพักแรมสำหรับตกปลาและล่าสัตว์สำหรับผู้มาพักระยะสั้น การจัดพื้นที่และสิ่งอำนวยความสะดวกสำหรับรถพ่วงเพื่อการนันทนาการ รวมถึงสิ่งอำนวยความสะดวกสำหรับเพิงพัก หรือค่ายพักแรมกลางแจ้งในการตั้งเต็นท์และ/หรือถุงนอน",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Hotel,
                TSIC = "55901",
                BusinessName = "การบริการห้องพักหรือที่พักอาศัยสำหรับนักเรียน/นักศึกษา",
                InfoTitle = "การบริการห้องพักหรือที่พักอาศัยสำหรับนักเรียน/นักศึกษา",
                InfoMessage = "การจัดที่พักแรมในลานตั้งค่าย ที่จอดรถพ่วง ค่ายนันทนาการ ค่ายพักแรมสำหรับตกปลาและล่าสัตว์สำหรับผู้มาพักระยะสั้น การจัดพื้นที่และสิ่งอำนวยความสะดวกสำหรับรถพ่วงเพื่อการนันทนาการ รวมถึงสิ่งอำนวยความสะดวกสำหรับเพิงพัก หรือค่ายพักแรมกลางแจ้งในการตั้งเต็นท์และ/หรือถุงนอน",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Hotel,
                TSIC = "55909",
                BusinessName = "การบริการที่พักแรมประเภทอื่นๆซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "การบริการที่พักแรมประเภทอื่นๆซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "การบริการที่พักอาศัยสำหรับบุคคลย้ายถิ่นฐานชั่วคราว การบริการที่พักอาศัยกึ่งถาวรในบอร์ดดิ้งเฮ้าส์ ห้องเช่าและบ้านเช่า การบริการที่พักอาศัยสำหรับคนงาน เช่น ที่พักสำหรับคนงานหรือค่ายพักคนงานแบบย้ายถิ่นฐานชั่วคราวหรือตามฤดูกาล การบริการตู้นอนที่ดำเนินงานโดยหน่วยอื่นที่แยกจากกิจการรถไฟ บริการที่พักแรมอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Hotel,
                TSIC = "55101",
                BusinessName = "โรงแรม รีสอร์ทและห้องชุด",
                InfoTitle = "โรงแรม รีสอร์ทและห้องชุด",
                InfoMessage = "การจัดที่พักแรมแบบให้เช่าเป็นรายวันหรือรายสัปดาห์สำหรับผู้ที่มาพักแรมระยะสั้น โดยรวมถึงห้องพักแขกและห้องชุดที่มีการตกแต่งพร้อมเข้าพักหรือห้องชุดพร้อมเครื่องครัว โดยมีหรือไม่มีแม่บ้านให้บริการก็ตามและอาจ รวมถึงการให้บริการอื่น ๆ เช่น การให้บริการอาหารและเครื่องดื่ม ที่จอดรถบริการซักรีด สระว่ายน้ำและห้องออกกำลังกาย สิ่งอำนวยนวยความสะดวกด้านนันทนาการและห้องประชุม รวมถึงที่พักที่จัดโดย โรงแรม โรงแรมรีสอร์ท โรงแรมห้องชุด ที่พักและโรงแรมริมทางหลวง",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Hotel,
                TSIC = "55102",
                BusinessName = "เกสต์เฮ้าส์",
                InfoTitle = "เกสต์เฮ้าส์ ",
                InfoMessage = "การบริการที่พักระยะสั้น เช่น เกสต์เฮ้าส์ บังกะโล และที่พักราคาประหยัดอื่น ๆ ซึ่งดัดแปลงหรือสร้างขึ้นและแบ่งห้องเป็นที่พักแรม",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Hotel,
                TSIC = "55103",
                BusinessName = "ที่พักสัมผัสวัฒนธรรมชนบท",
                InfoTitle = "ที่พักสัมผัสวัฒนธรรมชนบท ",
                InfoMessage = "การบริการที่พักระยะสั้นที่มีวัตถุประสงค์เพื่อเรียนรู้วัฒนธรรมและวิถีชีวิตท้องถิ่นที่จัดที่พักพร้อมอาหารให้กับนักท่องเที่ยว รวมถึงบ้านพักในฟาร์ม ที่พักในสวนเกษตร",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Hotel,
                TSIC = "55109",
                BusinessName = "กิจกรรมที่พักแรมระยะสั้นอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "กิจกรรมที่พักแรมระยะสั้นอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น ",
                InfoMessage = "การให้บริการที่พักระยะสั้นอื่น ๆ สำหรับผู้มาพักแรม เช่น บ้านพักเยาวชนที่พักอาศัยบนภูเขา ห้องพักแบบไทม์แชร์ บ้านพักวันหยุด ที่พักแบบชาเลต์ และที่พักแรมอื่น ๆ ที่คล้ายกัน โดยส่วนใหญ่ที่พักเหล่านี้มักจะให้บริการเฉพาะที่พักอาศัย ถึงแม้ว่าอาจมีบางส่วนที่ให้บริการอาหารด้วยก็ตาม",
            });

            return model;
        }

        // แปรรูปสินค้าเกษตรขนาดเล็ก
        private static List<DBDBusinessModel> AddAGP() 
        {
            List<DBDBusinessModel> model = new List<DBDBusinessModel>();

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10111",
                BusinessName = "การฆ่าสัตว์ (ยกเว้นสัตว์ปีก)",
                InfoTitle = "การฆ่าสัตว์ (ยกเว้นสัตว์ปีก)",
                InfoMessage = "การดำเนินการเกี่ยวกับการฆ่าสัตว์เพื่อใช้เป็นอาหารมนุษย์ เช่น วัว สุกร แพะแกะ กระต่าย อูฐ สัตว์ป่า ฯลฯ (ยกเว้น สัตว์ปีก) รวมถึงการฆ่าและการแปรรูปปลาวาฬบนฝั่งหรือบนเรือขนาดใหญ่ การตกแต่งเนื้อสัตว์สด (ยกเว้น สัตว์ปีก)การตัดเป็นส่วน ๆ การผลิตส่วนอื่นของสัตว์ที่บริโภคได้ (ยกเว้น เนื้อสัตว์ปีก)เช่น เครื่องในสัตว์ที่ดำเนินการต่อเนื่องจากการฆ่าสัตว์ รวมถึงผลพลอยได้ที่ได้จากการฆ่าสัตว์ที่ยังไม่ได้ผ่านกระบวนการแปรรูป เช่น ขนแกะ ไขมัน กระดูกเขา หนังดิบ มันหมูไม่มีเนื้อติดและมันสัตว์ยังไม่เคี่ยวหรือสกัดโดยวิธีอื่น (การฆ่าสัตว์อย่างครบวงจร) เป็นต้น",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10112",
                BusinessName = "การบรรจุเนื้อสัตว์สด (ยกเว้นสัตว์ปีก)",
                InfoTitle = "การบรรจุเนื้อสัตว์สด (ยกเว้นสัตว์ปีก)",
                InfoMessage = "การผลิตเนื้อสัตว์สด (ยกเว้น สัตว์ปีก) แช่เย็นหรือแช่แข็ง ที่นำมาตกแต่งหรือตัดเป็นส่วน ๆ ทำความสะอาดและการบรรจุภาชนะ (ยกเว้น การบรรจุกระป๋อง) การผลิตส่วนอื่นของสัตว์ที่บริโภคได้ (ยกเว้น เนื้อสัตว์ปีก) เช่น เครื่องในสัตว์",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10120",
                BusinessName = "การฆ่าและการบรรจุเนื้อสัตว์ปีกสด",
                InfoTitle = "การฆ่าและการบรรจุเนื้อสัตว์ปีกสด",
                InfoMessage = "การฆ่าสัตว์ปีกและการผลิตเนื้อสัตว์ปีกสด แช่เย็นหรือแช่แข็ง การฆ่าสัตว์ปีก เช่น ไก่ เป็ด ห่าน ไก่งวง การผลิตเนื้อสัตว์ปีกสด แช่เย็น หรือแช่แข็ง ที่นำมาตกแต่ง หรือตัดเป็นส่วน ๆ การทำความสะอาดและการบรรจุภาชนะ (ยกเว้นการบรรจุกระป๋อง) การผลิตส่วนอื่นของสัตว์ปีกที่บริโภคได้ เช่น เครื่องในสัตว์ ขนแข็งหรือขนอ่อน ที่ดำเนินการต่อเนื่องจากการฆ่าสัตว์",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10131",
                BusinessName = "การผลิตเนื้อสัตว์และเนื้อสัตว์ปีกด้วยการอบแห้ง การทำเค็มหรือ การรมควัน",
                InfoTitle = "การผลิตเนื้อสัตว์และเนื้อสัตว์ปีกด้วยการอบแห้ง การทำเค็มหรือ การรมควัน",
                InfoMessage = "การถนอมและการปรุงแต่งเนื้อสัตว์และเนื้อสัตว์ปีกที่เป็นการแปรรูปขั้นต้น เพื่อไม่ให้เสียโดยกรรมวิธีการอบแห้ง การรมควัน การทำเค็ม การหมักในน้ำเกลือ ในน้ำมัน เช่น แฮม เบคอน เนื้อเค็มตากแห้ง ฯลฯ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10132",
                BusinessName = "การผลิตไส้กรอกลูกชิ้นและผลิตภัณฑ์อื่นที่คล้ายกันที่ทำจาก เนื้อสัตว์และเนื้อสัตว์ปีก",
                InfoTitle = "การผลิตไส้กรอกลูกชิ้นและผลิตภัณฑ์อื่นที่คล้ายกันที่ทำจาก เนื้อสัตว์และเนื้อสัตว์ปีก",
                InfoMessage = "การผลิตผลิตภัณฑ์จากเนื้อ ไส้กรอก ซาลามี โบโลญญ่า ไส้กรอกที่ทำจากเครื่องในหมูและไส้กรอกชนิดต่าง ๆ กุนเชียง ไส้อั่ว ไส้กรอกพื้นบ้าน แหนม หมูยอ และผลิตภัณฑ์อื่นที่คล้ายกันที่ทำจากเนื้อสัตว์และเนื้อสัตว์ปีก",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10133",
                BusinessName = "การผลิตเนื้อสัตว์และเนื้อสัตว์ปีกบรรจุกระป๋อง",
                InfoTitle = "การผลิตเนื้อสัตว์และเนื้อสัตว์ปีกบรรจุกระป๋อง",
                InfoMessage = "การผลิตเนื้อสัตว์และเนื้อสัตว์ปีกบรรจุกระป๋องหรือภาชนะผนึกแน่นและอากาศเข้าไม่ได้ โดยผ่านกรรมวิธีให้ความร้อน มีเนื้อสัตว์หรือเนื้อสัตว์ปีกเป็นส่วนประกอบหลัก ซึ่งผ่านกระบวนการปรุงสุก บรรจุในน้ำเกลือ ซอส น้ำมัน หรือสิ่งอื่นที่ไม่ใช่เครื่องปรุง เช่น คอร์นบีฟ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10134",
                BusinessName = "การผลิตผลิตภัณฑ์พลอยได้จากสัตว์และสัตว์ปีก",
                InfoTitle = "การผลิตผลิตภัณฑ์พลอยได้จากสัตว์และสัตว์ปีก",
                InfoMessage = "การผลิตเนื้อสัตว์ป่น การเคี่ยวและการกลั่นน้ำมันหมูบริสุทธิ์ (รวมทั้งน้ำมันหมูลาร์ด) โค กระบือ แกะหรือแพะ และไขมันจากสัตว์ปีกและสัตว์อื่น ๆ ที่รับประทานได้ โดยการเคี่ยวและการกลั่นให้บริสุทธิ์ การผลิตน้ำปลาจาก หนังสัตว์หมักเกลือ การนำหนังดิบซึ่งเป็นผลพลอยได้จากโรงฆ่าสัตว์มาผ่านกระบวนการเก็บรักษา เช่น หนังแช่น้ำเกลือ หนังหมักเกลือเปียก หนังตากแห้งหนังอาบน้ำยา และหนังหมักเกลือแห้ง การผลิตรังนกที่นำมาตกแต่งทำความสะอาด และบรรจุภาชนะ เช่น รังนกแห้ง รังนกกึ่งสำเร็จรูป รังนกสดพร้อมปรุง และการผลิตผลิตภัณฑ์พลอยได้จากสัตว์และสัตว์ปีกอื่น ๆ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10139",
                BusinessName = "การผลิตผลิตภัณฑ์อื่น ๆ จากเนื้อสัตว์และเนื้อสัตว์ปีกซึ่งมิได้จัด ประเภทไว้ในที่อื่น",
                InfoTitle = "การผลิตผลิตภัณฑ์อื่น ๆ จากเนื้อสัตว์และเนื้อสัตว์ปีกซึ่งมิได้จัด ประเภทไว้ในที่อื่น",
                InfoMessage = "การผลิตแคบหมู แคบเนื้อ หมูแผ่น หมูหยอง เนื้อสวรรค์ หมูหวาน การผลิตผลิตภัณฑ์อื่น ๆ จากเนื้อสัตว์และเนื้อสัตว์ปีก ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10211",
                BusinessName = "การผลิตปลาและผลิตภัณฑ์จากปลาสดแช่เย็น หรือแช่แข็ง",
                InfoTitle = "การผลิตปลาและผลิตภัณฑ์จากปลาสดแช่เย็น หรือแช่แข็ง",
                InfoMessage = "การผลิตปลาสด แช่เย็นหรือแช่แข็ง ทั้งตัวหรือที่นำมาตกแต่งหรือแล่เป็นชิ้น ๆ ทำความสะอาด ทำให้สุกและบรรจุภาชนะ (ยกเว้น กระป๋อง) เช่น ปลาทั้งตัว เนื้อปลาแบบฟิลเลและเนื้อปลาแบบอื่น ตับ ไข่ปลา ไข่ปลาคาร์เวียและไข่ปลาคาร์เวียเทียม",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10212",
                BusinessName = "การผลิตสัตว์น้ำและผลิตภัณฑ์สัตว์น้ำสด (ยกเว้นปลา) แช่เย็นหรือแช่แข็ง",
                InfoTitle = "การผลิตสัตว์น้ำและผลิตภัณฑ์สัตว์น้ำสด (ยกเว้นปลา) แช่เย็นหรือแช่แข็ง",
                InfoMessage = "การผลิตสัตว์น้ำสด (ยกเว้น ปลา) แช่เย็นหรือแช่แข็งทั้งตัวหรือที่นำมาตกแต่ง หรือแล่เป็นชิ้น ๆ ทำความสะอาด ทำให้สุกและบรรจุภาชนะ (ยกเว้น กระป๋อง) เช่น กุ้งทั้งตัวไม่เด็ดหัวหรือปอกเปลือก กุ้งเด็ดหัวแต่ไม่แกะเปลือก ฯลฯ ปลาหมึกทั้งตัว ปลาหมึกทั้งตัวที่ลอกตา ปากและอวัยวะภายในออก ปลาหมึกทั้งตัวที่เอาถุงหมึกออก ฯลฯ หอยนางรม หอยแครง หอยแมลงภู่ หอยลาย ฯลฯ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10221",
                BusinessName = "การผลิตปลาบรรจุกระป๋อง",
                InfoTitle = "การผลิตปลาบรรจุกระป๋อง",
                InfoMessage = "การผลิตปลาบรรจุกระป๋องหรือภาชนะที่ผนึกแน่นและอากาศเข้าไม่ได้อื่น ๆ โดยมีเนื้อปลาเป็นส่วนประกอบหลัก ซึ่งผ่านกระบวนการปรุงสุก บรรจุในน้ำเกลือ ซอส น้ำมันหรือสิ่งอื่นที่ไม่ใช่เครื่องปรุง เช่น ปลาทูน่าในน้ำเกลือ ปลาทูน่าในน้ำมัน ปลาซาร์ดีนในซอสมะเขือเทศ ฯลฯ โดยผ่านกรรมวิธีให้ความร้อน รวมถึงการบรรจุโดยวิธีสุญญากาศ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10222",
                BusinessName = "การผลิตสัตว์น้ำ (ยกเว้นปลา) บรรจุกระป๋อง",
                InfoTitle = "การผลิตสัตว์น้ำ (ยกเว้นปลา) บรรจุกระป๋อง",
                InfoMessage = "การผลิตสัตว์น้ำ (ยกเว้น ปลา) บรรจุกระป๋องหรือภาชนะที่ผนึกแน่นและอากาศเข้าไม่ได้ โดยมีเนื้อสัตว์น้ำ (ยกเว้น ปลา) เป็นส่วนประกอบหลัก ซึ่งผ่านกระบวนการปรุงสุก บรรจุในน้ำเกลือ ซอส น้ำมันหรือสิ่งอื่นที่ไม่ใช่เครื่องปรุง เช่น กุ้งกระป๋อง ปลาหมึกกระป๋อง หอยลายกระป๋อง ปูกระป๋อง ฯลฯ โดยผ่านกรรมวิธีให้ความร้อนรวมถึงการบรรจุโดยวิธีสุญญากาศ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10291",
                BusinessName = "การผลิตผลิตภัณฑ์สัตว์น้ำด้วยการอบแห้ง การรมควัน การทำเค็ม การหมักในน้ำเกลือ หรือน้ำส้มสายชู",
                InfoTitle = "การผลิตผลิตภัณฑ์สัตว์น้ำด้วยการอบแห้ง การรมควัน การทำเค็ม การหมักในน้ำเกลือ หรือน้ำส้มสายชู",
                InfoMessage = "การถนอมและการแปรรูปเนื้อสัตว์น้ำที่เป็นการแปรรูปในขั้นต้นเพื่อไม่ให้เสียโดยกรรมวิธีการอบแห้ง รมควัน ทำเค็ม การหมักในน้ำเกลือ ในน้ำมัน รวมถึงการล้าง ชำแหละ แกะ ต้ม นึ่ง ทอด สับ บด เช่น ปลาเค็ม ปลาตากแห้ง กุ้งแห้ง ปลารมควัน หอยดอง ฯลฯ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10292",
                BusinessName = "การผลิตไส้กรอกลูกชิ้นและผลิตภัณฑ์อื่นที่คล้ายกันที่ทำจาก สัตว์น้ำ",
                InfoTitle = "การผลิตไส้กรอกลูกชิ้นและผลิตภัณฑ์อื่นที่คล้ายกันที่ทำจาก สัตว์น้ำ",
                InfoMessage = "การผลิตไส้กรอก ลูกชิ้นและผลิตภัณฑ์อื่นที่คล้ายกันที่ทำจากสัตว์น้ำ เช่น ลูกชิ้นปลา ลูกชิ้นกุ้ง ลูกชิ้นปลาเส้น ไส้กรอกปลา ปลาแผ่น เนื้อปลาบด ฯลฯ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10293",
                BusinessName = "การผลิตน้ำปลาและผลิตภัณฑ์สัตว์น้ำที่ได้จากการหมัก",
                InfoTitle = "การผลิตน้ำปลาและผลิตภัณฑ์สัตว์น้ำที่ได้จากการหมัก",
                InfoMessage = "การผลิตผลิตภัณฑ์สัตว์น้ำที่ได้จากการหมักทั้งในรูปของอาหารและเครื่องปรุงรส เช่น น้ำปลา กะปิ บูดู ปลาร้า ปลาส้ม ปลาจ่อม ฯลฯ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10294",
                BusinessName = "การผลิตปลาป่นสำหรับใช้เป็นอาหารสัตว์",
                InfoTitle = "การผลิตปลาป่นสำหรับใช้เป็นอาหารสัตว์",
                InfoMessage = "การผลิตปลาป่น อาหารป่นหรือทำเป็นเพลเลตหรือสิ่งละลายได้ ที่ทำจากสัตว์น้ำและสัตว์น้ำอื่น ๆ สำหรับใช้เป็นอาหารสัตว์",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10295",
                BusinessName = "การแปรรูปสาหร่าย",
                InfoTitle = "การแปรรูปสาหร่าย",
                InfoMessage = "การแปรรูปสาหร่ายทั้งชนิดน้ำจืดและน้ำเค็ม เช่น สาหร่ายอบแห้ง สาหร่ายทอดสาหร่ายปรุงรส รวมถึงการผลิตสาหร่ายเพื่อใช้เป็นส่วนผสมของอาหารสัตว์",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10299",
                BusinessName = "การผลิตผลิตภัณฑ์อื่น ๆ จากสัตว์น้ำซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "การผลิตผลิตภัณฑ์อื่น ๆ จากสัตว์น้ำซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "การผลิตปลาป่นสำหรับบริโภค การผลิตสารสกัดจากสัตว์น้ำจำพวกครัสตาเซีย และโมลลุสก์หรือสัตว์น้ำที่ไม่มีกระดูกสันหลังอื่น ๆ การผลิตปลาเส้นปรุงรสปลาอบปรุงรส ปลาอบกรอบ การผลิตผลิตภัณฑ์อื่น ๆ จากสัตว์น้ำซึ่งมิได้จัดประเภทไว้ในที่อื่น",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10301",
                BusinessName = "การผลิตผลไม้และผักแช่แข็ง",
                InfoTitle = "การผลิตผลไม้และผักแช่แข็ง",
                InfoMessage = "การผลิตผลไม้ ถั่วเปลือกแข็ง และผักดิบหรือทำให้สุกด้วยการลวก ต้มหรือนึ่งที่ผ่านกรรมวิธีต่าง ๆ เช่น ปอกเปลือก ตกแต่ง ลวก ต้มหรือนึ่ง แช่แข็ง และบรรจุในภาชนะ (ยกเว้น กระป๋อง) เช่น ลองกอง ทุเรียน มังคุด หัวหอมใหญ่ แครอท ข้าวโพดผักอ่อน ฯลฯ ที่แช่แข็ง",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10302",
                BusinessName = "การผลิตผลไม้และผักบรรจุกระป๋อง",
                InfoTitle = "การผลิตผลไม้และผักบรรจุกระป๋อง",
                InfoMessage = "การผลิตผลไม้ ถั่วเปลือกแข็ง และผักบรรจุกระป๋องหรือภาชนะผนึกแน่น และอากาศเข้าไม่ได้อื่น ๆ เช่น ขวดแก้วหรือถุงพลาสติกแบบพิเศษ ที่นำมาปอกเปลือก ตกแต่ง ผ่านการทำให้สุกด้วยการลวก ต้มหรือนึ่ง โดยผ่านกรรมวิธีให้ความร้อน รวมถึงการบรรจุโดยวิธีสูญญากาศ ผักและผลไม้ที่นำมาบรรจุกระป๋อง เช่น ถั่ว แครอท ข้าวโพด ข้าวโพดฝักอ่อน มะเขือเทศ สับปะรด เงาะ ลิ้นจี่ ฯลฯ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10303",
                BusinessName = "การผลิตน้ำผลไม้และน้ำผัก",
                InfoTitle = "การผลิตน้ำผลไม้และน้ำผัก",
                InfoMessage = "การผลิตน้ำผลไม้และน้ำผัก เช่น น้ำมะเขือเทศ น้ำแครอท น้ำส้ม น้ำเกรปฟรุ๊ตน้ำสับปะรด น้ำแอปเปิ้ล น้ำองุ่น ฯลฯ การผลิตน้ำผลไม้และน้ำผักชนิดไม่เข้มข้น ที่ไม่ได้หมักและไม่เติมสุรา การผลิตน้ำผักผสมน้ำผลไม้",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10304",
                BusinessName = "การถนอมผลไม้หรือผักโดยการทำเค็มการอบแห้งการแช่ ในน้ำมันหรือในน้ำส้มสายชู",
                InfoTitle = "การถนอมผลไม้หรือผักโดยการทำเค็มการอบแห้งการแช่ ในน้ำมันหรือในน้ำส้มสายชู",
                InfoMessage = "การถนอมผลไม้ หรือผัก โดยการทำเค็ม ตากหรือการอบแห้ง แช่ในน้ำมัน หรือในน้ำส้มสายชู รวมถึงการถนอมที่ทำไว้ไม่ให้เสียชั่วคราวในสภาพที่ไม่เหมาะสำหรับบริโภคทันที เช่น รมด้วยก๊าซซัลเฟอร์ไดออกไซด์ แช่นํ้ากำมะถัน แช่นํ้ายากันเสียอื่น ๆ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10305",
                BusinessName = "การผลิตแยมแยมผิวส้มและเยลลี",
                InfoTitle = "การผลิตแยมแยมผิวส้มและเยลลี",
                InfoMessage = "การผลิตแยม แยมผิวส้ม เยลลี่ และการผลิตผลไม้กวน",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10306",
                BusinessName = "การแปรรูปและการถนอมมันฝรั่ง",
                InfoTitle = "การแปรรูปและการถนอมมันฝรั่ง",
                InfoMessage = "การแปรรูปและการถนอมมันฝรั่ง การผลิตมันฝรั่งสำเร็จรูปแช่แข็ง การผลิตมันฝรั่งบดแห้ง การผลิตอาหารว่างจากมันฝรั่ง การผลิตแผ่นมันฝรั่งกรอบ การผลิตแป้งและแป้งบดหยาบจากมันฝรั่ง การปอกเปลือกมันฝรั่งในโรงงานอุตสาหกรรม",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10307",
                BusinessName = "การผลิตผลิตภัณฑ์จากถั่วเปลือกแข็ง",
                InfoTitle = "การผลิตผลิตภัณฑ์จากถั่วเปลือกแข็ง",
                InfoMessage = "การอบถั่วเปลือกแข็ง การผลิตถั่วเปลือกแข็งกวน การผลิตอาหารที่ทำจากถั่ว และเนยถั่ว การผลิตถั่วเปลือกแข็งที่ปรุงสุกใส่เกลือบรรจุกระป๋อง",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10309",
                BusinessName = "การแปรรูปและการถนอมผลไม้และผักด้วยวิธีอื่นๆซึ่งมิได้ จัดประเภทไว้ในที่อื่น",
                InfoTitle = "การแปรรูปและการถนอมผลไม้และผักด้วยวิธีอื่นๆซึ่งมิได้ จัดประเภทไว้ในที่อื่น",
                InfoMessage = "การผลิตอาหารสำเร็จรูปที่เน่าเสียง่ายที่ทำจากผลไม้สดและผักสด เช่น สลัดผักที่ปอกเปลือกหรือหั่นเป็นชิ้นแล้ว เต้าหู้ สารสกัดเข้มข้นจากผลไม้และผักสด การผลิตเนื้อมะพร้าวแห้ง และการแปรรูปมะพร้าวขั้นต้นอื่น ๆ เพื่อใช้เป็นวัตถุดิบในการผลิตผลิตภัณฑ์อื่น ๆ ต่อไป รวมถึงการผลิตกะทิสำเร็จรูปสำหรับปรุงอาหาร เช่น กะทิผง กะทิสำเร็จรูปไม่ว่าจะผ่านการฆ่าเชื้อโรคด้วยวิธีพาสเจอร์ไรส์ สเตอริไลส์ โฮโมจิไนส์ และ/หรือยูเอชทีหรือไม่ก็ตาม รวมถึงการแปรรูปขั้นต้นอื่น ๆ เพื่อใช้เป็นวัตถุดิบในการผลิตผลิตภัณฑ์อื่น ๆ ต่อไป การแปรรูปและการถนอมผลไม้และผัก ด้วยวิธีอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10411",
                BusinessName = "การผลิตน้ำมันถั่วเหลือง",
                InfoTitle = "การผลิตน้ำมันถั่วเหลือง",
                InfoMessage = "การผลิตน้ำมันถั่วเหลืองดิบ การกลั่นน้ำมันถั่วเหลืองให้บริสุทธิ์ การผลิตกากถั่วเหลืองและผลิตภัณฑ์ที่เหลือจากการผลิตน้ำมัน",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10412",
                BusinessName = "การผลิตน้ำมันรำข้าว",
                InfoTitle = "การผลิตน้ำมันรำข้าว",
                InfoMessage = "การผลิตน้ำมันรำข้าวดิบโดยการกลั่นเย็นหรือกดทับ การกลั่นน้ำมันรำข้าวให้บริสุทธิ์ การผลิตกากที่เหลือจากการแยกน้ำมันและผลิตภัณฑ์ที่เหลือจากการผลิตน้ำมัน",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10413",
                BusinessName = "การผลิตน้ำมันข้าวโพด",
                InfoTitle = "การผลิตน้ำมันข้าวโพด",
                InfoMessage = "การผลิตน้ำมันข้าวโพดดิบ การกลั่นน้ำมันข้าวโพดให้บริสุทธิ์ การผลิตกากและผลิตภัณฑ์ที่เหลือจากการผลิตน้ำมัน",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10414",
                BusinessName = "การผลิตน้ำมันมะพร้าว",
                InfoTitle = "การผลิตน้ำมันมะพร้าว",
                InfoMessage = "การผลิตน้ำมันมะพร้าวดิบ การผลิตเนื้อมะพร้าวแห้ง การผลิตน้ำมันชนิดก้อน และเป็นผงและการแปรรูปขั้นต้นอื่น ๆ ที่ดำเนินการในหน่วยเดียวกันกับการผลิตน้ำมันมะพร้าวดิบ การผลิตน้ำมันมะพร้าวบริสุทธิ์ การผลิตกากมะพร้าว และผลิตภัณฑ์ที่เหลือจากการผลิตน้ำมัน",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10419",
                BusinessName = "การผลิตน้ำมันพืชชนิดอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "การผลิตน้ำมันพืชชนิดอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "การผลิตน้ำมันพืชชนิดอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น เช่น น้ำมันมะกอก น้ำมันเมล็ดทานตะวัน น้ำมันดอกคำฝอย น้ำมันเมล็ดฝ้าย น้ำมันเรพ น้ำมันสบู่ดำ น้ำมันงา น้ำมันโคซ่าหรือน้ำมันมัสตาร์ด น้ำมันเมล็ดนุ่น น้ำมันลินสีด นํ้ามันละหุ่ง นํ้ามันโจโจบา ฯลฯ รวมทั้งน้ำมันดิบและกลั่นบริสุทธิ์ การผลิตไฟเบอร์จากฝ้าย กากที่เหลือจากการแยกน้ำมัน และผลิตภัณฑ์ที่เหลือของพืชชนิดดังกล่าวที่ได้จากการผลิตน้ำมัน รวมถึงการผลิตอาหารสัตว์ จากกากพืชที่สกัดน้ำมันแล้ว",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10420",
                BusinessName = "การผลิตน้ำมันปาล์ม",
                InfoTitle = "การผลิตน้ำมันปาล์ม",
                InfoMessage = "การผลิตน้ำมันปาล์มดิบ รวมถึงน้ำมันเมล็ดในปาล์มดิบ การกลั่นน้ำมันปาล์ม และน้ำมันเมล็ดในปาล์มให้บริสุทธิ์ การผลิตกากปาล์มน้ำมันและผลิตภัณฑ์ที่เหลืออยู่อื่น ๆ ที่ได้จากการผลิตน้ำมัน",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10491",
                BusinessName = "การผลิตน้ำมันและไขมันจากสัตว์",
                InfoTitle = "การผลิตน้ำมันและไขมันจากสัตว์",
                InfoMessage = "การผลิตน้ำมันและไขมันจากสัตว์ที่รับประทานไม่ได้ เช่น ขี้ผึ้ง ไขที่ได้จากแมลงอื่น ๆ และไขปลาวาฬ การผลิตและการสกัดน้ำมันจากปลา ตับปลาและสัตว์ทะเลอื่น ๆ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10499",
                BusinessName = "การผลิตผลิตภัณฑ์อื่น ๆ ที่ได้จากน้ำมันพืชซึ่งมิได้จัด ประเภทไว้ในที่อื่น",
                InfoTitle = "การผลิตผลิตภัณฑ์อื่น ๆ ที่ได้จากน้ำมันพืชซึ่งมิได้จัด ประเภทไว้ในที่อื่น",
                InfoMessage = "การผลิตมาร์การีนหรือเนยเทียม การผลิตของผสมและผลิตภัณฑ์ใช้แผ่ และผลิตภัณฑ์ที่คล้ายกัน การผลิตไขมันผสมสำหรับปรุงอาหาร การผลิตเนยขาว (shortening) การผลิตแป้งที่ได้จากการแยกไขมันออกหรือกากจากการบีบน้ำมันเมล็ดนุ่น น้ำมันถั่วหรือน้ำมันจากเนื้อพืช การผลิตผลิตภัณฑ์อื่น ๆที่ได้จากการผลิตน้ำมันพืช ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10501",
                BusinessName = "การผลิตน้ำนมสด (ยกเว้นน้ำนมดิบ)",
                InfoTitle = "การผลิตน้ำนมสด (ยกเว้นน้ำนมดิบ)",
                InfoMessage = "การผลิตน้ำนมสดที่ผ่านการฆ่าเชื้อโรคด้วยกรรมวิธีพาสเจอไรส์ สเตอริไลส์ เพบโทไนส์ ยูเอชที โดยผ่านหรือไม่ผ่านโฮโมจีไนส์ก็ได้ และการบรรจุนมสดลงขวดหรือกล่อง",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10502",
                BusinessName = "การผลิตผลิตภัณฑ์นมข้นหรือนมผง",
                InfoTitle = "การผลิตผลิตภัณฑ์นมข้นหรือนมผง",
                InfoMessage = "การแปรรูปน้ำนมโดยการทำให้เป็นนมข้น ทั้งชนิดนมข้นหวานและนมข้นจืดนมผง ทั้งชนิดนมผงธรรมดา นมผงพร่องมันเนยและนมผงขาดมันเนย",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10503",
                BusinessName = "การผลิตไอศกรีมและไอศกรีมหวานเย็น",
                InfoTitle = "การผลิตไอศกรีมและไอศกรีมหวานเย็น",
                InfoMessage = "การผลิตไอศกรีม เช่น ไอศกรีมนม ไอศกรีมดัดแปลง ฯลฯ การผลิตไอศกรีม หวานเย็น เช่น น้ำแข็งผสมน้ำผลไม้หรือเชอร์เบต หรือมิลค์เชค ผลิตขนมหวานแช่แข็ง เช่น คัสตาร์ด พุดดิง เจลาติน ฯลฯ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10504",
                BusinessName = "การผลิตโยเกิร์ตและนมเปรี้ยว",
                InfoTitle = "การผลิตโยเกิร์ตและนมเปรี้ยว",
                InfoMessage = "การผลิตโยเกิร์ต การผลิตนมเปรี้ยว รวมถึงนมเปรี้ยวที่ผ่านการฆ่าเชื้อโรคด้วยวิธีพาสเจอไรส์ สเตอริไลส์ ยูเอชที และ/หรือการฆ่าเชื้อด้วยความร้อนสูงโดยผ่านหรือไม่ผ่านโฮโมจีไนส์ การผลิตนมเปรี้ยวเคเฟอร์ นมเปรี้ยวคูมิสรวมถึงนมและครีมที่หมักหรือทำให้เปรี้ยวอย่างอื่น",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10505",
                BusinessName = "การผลิตเนย",
                InfoTitle = "การผลิตเนย",
                InfoMessage = "การผลิตเนย การผลิตเนยแข็งและเนยก้อน เช่น ครีมชีส โฮลมิลค์ชีส สกิมมิลค์ชีส โพรเซสชีส เนมชีส การผลิตเนยใสหรือกี การผลิตน้ำมันเนย",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10509",
                BusinessName = "การผลิตผลิตภัณฑ์นมอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "การผลิตผลิตภัณฑ์นมอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "การผลิตครีมจากน้ำนมสดด้วยวิธีธรรมชาติและตามกรรมวิธี ทั้งชนิดครีมแท้ ครีมเทียมและครีมผสม เช่น ครีมพร่องมันเนย ครีมธรรมดา วิปปิ้งครีม ดับเบิ้ลครีม ครีมเปรี้ยว การผลิตหางนม การผลิตโปรตีนจากนม หรือน้ำตาลนม การผลิตนมอัดเม็ด การผลิตผลิตภัณฑ์นมอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10611",
                BusinessName = "การสีข้าว",
                InfoTitle = "การสีข้าว",
                InfoMessage = "การดำเนินการเกี่ยวกับการสีข้าว การฝัด การขัดข้าว การผลิตข้าวนึ่ง หรือการปรับปรุงข้าวให้เก็บไว้ได้นานก็จัดไว้ในที่นี้ด้วย เช่น ข้าวเจ้าและข้าวเหนียว การผลิตข้าวกล้อง ข้าวตาก ปลายข้าว การผลิตเยิร์ม รำ เศษหัก หรือเศษอื่น ๆ ของข้าว",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10612",
                BusinessName = "การผลิตแป้งจากข้าว",
                InfoTitle = "การผลิตแป้งจากข้าว",
                InfoMessage = "การผลิตแป้งข้าวเจ้าและแป้งข้าวเหนียว",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10613",
                BusinessName = "การผลิตแป้งสาลี",
                InfoTitle = "การผลิตแป้งสาลี",
                InfoMessage = "การโม่-สีข้าวสาลี การผลิตแป้ง แป้งบดหยาบหรือเพลเลตจากข้าวสาลี การผลิต โดยวิธีอื่น ๆ เช่น กะเทาะเปลือกออก ทำให้แบน ทำเป็นเกล็ด ทำเป็นเม็ดกลม ฝาน หรือบดแตก การผลิตเยิร์ม เศษหักหรือเศษอื่น ๆ ของข้าวสาลี",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10614",
                BusinessName = "การผลิตแป้งข้าวโพด",
                InfoTitle = "การผลิตแป้งข้าวโพด",
                InfoMessage = "การโม่-สีข้าวโพด การผลิตแป้ง แป้งบดหยาบหรือเพลเลตจากข้าวโพด การผลิต โดยวิธีอื่น ๆ เช่น กะเทาะเปลือกออก ทำให้แบน ทำเป็นเกล็ด ทำเป็นเม็ดกลม ฝานหรือบดแตก การผลิตเยิร์ม เศษหักหรือเศษอื่น ๆ ของข้าวโพด การผลิตข้าวโพดแห้งด้วยการอบ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10615",
                BusinessName = "การผลิตแป้งจากเมล็ดธัญพืชอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "การผลิตแป้งจากเมล็ดธัญพืชอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "การโม่-สีธัญพืชอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น เช่น ข้าวไรย์ ข้าวโอ๊ต และธัญพืชอื่น ๆ รวมถึงพืชผักตระกูลถั่วตากแห้ง จากรากหรือหัว หรือจากถั่วเปลือกแข็งที่บริโภคได้ การผลิตแป้ง แป้งบดหยาบหรือเพลเลตจากธัญพืช และพืชผักดังกล่าว การผลิตเมล็ดธัญพืชที่จัดทำโดยวิธีอื่น ๆ เช่น เอาเปลือกออก ทำให้แบน ทำเป็นเกล็ด ทำเป็นเม็ดกลม ฝานหรือบดแตก การผลิตเยิร์มเศษหัก หรือเศษอื่น ๆ จากธัญพืชและพืชผักดังกล่าว การผลิตแป้งมันสำปะหลังที่ไม่ได้สกัดโปรตีนออกที่เรียกว่า “tapioca flour”",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10616",
                BusinessName = "การผลิตแป้งผสมหรือแป้งสำเร็จรูปสำหรับใช้ทำขนมปังและ ประกอบอาหารอื่น ๆ",
                InfoTitle = "การผลิตแป้งผสมหรือแป้งสำเร็จรูปสำหรับใช้ทำขนมปังและ ประกอบอาหารอื่น ๆ",
                InfoMessage = "การผลิตแป้งผสมหรือแป้งสำเร็จรูปสำหรับใช้ทำขนมปัง เค้ก ขนมปังกรอบ แพนเค้ก โดนัทหรือขนมอบอื่น ๆ การผลิตแป้งผสมหรือแป้งสำเร็จรูปสำหรับชุบทอดกรอบสำหรับใช้ทำขนมไทย สำหรับประกอบอาหารอื่น ๆ เช่น ทำปาท่องโก๋ และขนมจีน ฯลฯ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10617",
                BusinessName = "การผลิตน้ำธัญพืช",
                InfoTitle = "การผลิตน้ำธัญพืช",
                InfoMessage = "การผลิตน้ำจากธัญพืช เช่น น้ำนมถั่วเหลือง น้ำนมข้าวโพด น้ำลูกเดือย น้ำนมข้าวยาคู ฯลฯ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10619",
                BusinessName = "การผลิตผลิตภัณฑ์อื่น ๆ จากเมล็ดธัญพืชซึ่งมิได้จัด ประเภทไว้ในที่อื่น",
                InfoTitle = "การผลิตผลิตภัณฑ์อื่น ๆ จากเมล็ดธัญพืชซึ่งมิได้จัด ประเภทไว้ในที่อื่น",
                InfoMessage = "การผลิตอาหารเช้าจากธัญพืชที่ทำให้พองฟู คั่ว อบหรือปิ้งหรือโดยการทำให้แบน การทำเป็นเม็ดกลม การทำเป็นเกร็ดหรือการขัดเมล็ดธัญพืช เช่น คอนเฟล็ก ข้าวโอ๊ตบดหยาบ ฯลฯ การผลิตอาหารเสริมที่ทำจากธัญพืช รวมถึงซุปข้าวโพด การผลิตโจ๊กกึ่งสำเร็จรูป การผลิตข้าวเติมวิตามิน โปรตีนเกษตร การผลิตผลิตภัณฑ์อื่น ๆ จากธัญพืชซึ่งมิได้จัดประเภทไว้ในที่อื่น",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10621",
                BusinessName = "การผลิตมันเส้นและมันอัดเม็ด",
                InfoTitle = "การผลิตมันเส้นและมันอัดเม็ด",
                InfoMessage = "การผลิตมันเส้น ชิ้น แผ่น ก้อน แท่ง เม็ดหรือในลักษณะอื่นใด (ที่ไม่พร้อมจะรับประทาน) รวมถึงกิจกรรมของลานตากมัน",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10622",
                BusinessName = "การผลิตสตาร์ชมันสำปะหลัง",
                InfoTitle = "การผลิตสตาร์ชมันสำปะหลัง",
                InfoMessage = "การผลิตสตาร์ชมันสำปะหลังหรือแป้งมันสำปะหลังที่ได้ทำการสกัดโปรตีนออกซึ่งโดยทั่วไปมักเรียกว่า “แป้งมันสำปะหลัง”",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10623",
                BusinessName = "การผลิตสตาร์ชจากข้าวโพดธัญพืชและพืชผักอื่น ๆ (ยกเว้นมันสำปะหลัง)",
                InfoTitle = "การผลิตสตาร์ชจากข้าวโพดธัญพืชและพืชผักอื่น ๆ (ยกเว้นมันสำปะหลัง)",
                InfoMessage = "การผลิตสตาร์ชจากข้าวโพด ข้าว มันฝรั่ง ฯลฯ การโม่แป้งข้าวโพดแบบเปียก การผลิตสตาร์ชจากธัญพืชและพืชผักอื่น ๆ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10629",
                BusinessName = "การผลิตผลิตภัณฑ์จากสตาร์ชอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "การผลิตผลิตภัณฑ์จากสตาร์ชอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "การผลิตกลูโคส น้ำเชื่อมกลูโคส มอลโตส ฟรุคโตสและน้ำเชื่อมฟรุคโตส การผลิตอินูลิน การผลิตกลูเทน การผลิตโปรตีนจากข้าวสาลี การผลิตผลิตภัณฑ์มันสำปะหลังและผลิตภัณฑ์ที่ใช้แทนมันสำปะหลังที่ทำจากสตาร์ช เช่น สาคู การผลิตเดกซ์ทรินและเดกซ์โทรส การผลิตผลิตภัณฑ์จากสตาร์ชอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10711",
                BusinessName = "การผลิตขนมปังเค้กและเพสตรี",
                InfoTitle = "การผลิตขนมปังเค้กและเพสตรี",
                InfoMessage = "การผลิตขนมปังปอนด์และโรล การผลิตเพสตรีสด เค้ก พาย ทาร์ต ชิฟฟอน การผลิตขนมปังร่วน ฯลฯ ชนิดสด การถนอมเพสตรีและเค้ก การผลิตตอร์ติยาส์ การผลิตโดนัท การผลิตผลิตภัณฑ์เบเกอรี่แช่เยือกแข็ง เช่น แพนเค้ก วาฟเฟิล โรล ขนมเปี๊ยะ ขนมไหว้พระจันทร์ ฯลฯ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10712",
                BusinessName = "การผลิตขนมปังกรอบและผลิตภัณฑ์ขนมอบกรอบอื่น ๆ",
                InfoTitle = "การผลิตขนมปังกรอบและผลิตภัณฑ์ขนมอบกรอบอื่น ๆ",
                InfoMessage = "การผลิตขนมปังกรอบ บิสกิตและผลิตภัณฑ์ขนมอบกรอบอื่น ๆ การผลิตอาหารว่าง (คุกกี้ ขนมปังกรอบ ขนมปังเค็ม ฯลฯ) ไม่ว่าชนิดหวานหรือชนิดเค็ม การผลิตโคนไอศกรีมและเวเฟอร์",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10713",
                BusinessName = "การผลิตขนมไทยประเภทอบ",
                InfoTitle = "การผลิตขนมไทยประเภทอบ",
                InfoMessage = "การผลิตขนมไทยประเภทอบ/ผิง เช่น ขนมหม้อแกง ขนมบ้าบิ่น ขนมผิง ขนมไข่ ขนมกุฎีจีน ขนมโสมนัส ขนมกลีบลำดวน ขนมหน้านวล ขนมทองม้วน ขนมทองพับ ขนมสาลี่กรอบ ฯลฯ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10721",
                BusinessName = "การผลิตน้ำตาลดิบจากอ้อย",
                InfoTitle = "การผลิตน้ำตาลดิบจากอ้อย",
                InfoMessage = "การผลิตน้ำตาลดิบจากอ้อย การผลิตน้ำตาลดิบจากอ้อยที่ไม่เติมสารปรุงกลิ่นรสหรือสารแต่งสี การผลิตน้ำตาลทรายแดงจากอ้อยและกากน้ำตาล",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10722",
                BusinessName = "การผลิตน้ำตาลบริสุทธิ์",
                InfoTitle = "การผลิตน้ำตาลบริสุทธิ์",
                InfoMessage = "การผลิตน้ำตาลทรายโดยการนำน้ำตาลดิบมาผ่านกระบวนการทำความสะอาด ฟอกสี เคี่ยว ปั่นแยกผลึกน้ำตาลและอบ การผลิตน้ำตาลเทียมจากอ้อย การผลิตน้ำเชื่อมจากอ้อย การผลิตน้ำตาลอินเวิร์ต การผลิตน้ำตาลกรวด การผลิตน้ำตาลที่มีการเติมแต่งสีและกลิ่น เช่น น้ำตาลผสมคาราเมล น้ำตาลสี ฯลฯ การผลิตกากน้ำตาล (molasses) ในกรณีที่สถานประกอบการดำเนินการ ทั้งการผลิตน้ำตาลทรายดิบจากอ้อย และการทำน้ำตาลทรายให้บริสุทธิ์ในสถานที่เดียวกันให้จัดประเภทไว้ในกิจกรรมนี้ด้วย (โรงงานน้ำตาล)",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10723",
                BusinessName = "การผลิตน้ำตาลจากพืช (ยกเว้นอ้อย)",
                InfoTitle = "การผลิตน้ำตาลจากพืช (ยกเว้นอ้อย)",
                InfoMessage = "การผลิตน้ำตาลจากพืชหวานชนิดต่าง ๆ (ยกเว้น อ้อย) เช่น มะพร้าว หัวผักกาดแดง ตาลโตนด การผลิตน้ำเชื่อมจากหัวผักกาดแดง เมเปิล ปาล์มและพืชที่ให้ความหวานอื่น ๆ (ยกเว้น อ้อย) การผลิตน้ำตาลเทียมจากหัวผักกาดแดง เมเปิล ปาล์ม หญ้าหวานและพืชที่ให้ความหวานอื่น ๆ (ยกเว้น อ้อย)",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10731",
                BusinessName = "การผลิตโกโก้และผลิตภัณฑ์จากโกโก้",
                InfoTitle = "การผลิตโกโก้และผลิตภัณฑ์จากโกโก้",
                InfoMessage = "การกะเทาะเปลือก การอบ การบดเมล็ดโกโก้และการผลิตผลิตภัณฑ์โกโก้ เนยโกโก้ ไขมันและน้ำมันโกโก้ การผลิตโกโก้ผงที่ไม่เติมนํ้าตาลหรือสารทำให้หวานอื่น ๆ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10732",
                BusinessName = "การผลิตผลิตภัณฑ์ช็อกโกแลตและขนมหวานจากช็อกโกแลต",
                InfoTitle = "การผลิตผลิตภัณฑ์ช็อกโกแลตและขนมหวานจากช็อกโกแลต",
                InfoMessage = "การผลิตช็อกโกแลตและขนมหวานจากช็อกโกแลต ช็อกโกแลตที่ใช้ในการเคลือบ การผลิตลูกอม ลูกกวาด การผลิตโกโก้ผงที่เติมนํ้าตาลหรือสารทำให้หวานอื่น ๆ การผลิตช็อกโกแลตขาว",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10733",
                BusinessName = "การผลิตหมากฝรั่ง",
                InfoTitle = "การผลิตหมากฝรั่ง",
                InfoMessage = "การผลิตหมากฝรั่ง",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10734",
                BusinessName = "การถนอมผลไม้ถั่วเปลือกแข็งเปลือกผลไม้และส่วนอื่นๆของพืชโดยใช้น้ำตาล",
                InfoTitle = "การถนอมผลไม้ถั่วเปลือกแข็งเปลือกผลไม้และส่วนอื่นๆของพืชโดยใช้น้ำตาล",
                InfoMessage = "การถนอมผลไม้ ถั่วเปลือกแข็ง เปลือกผลไม้และส่วนอื่น ๆ ของพืชโดยใช้น้ำตาล ได้แก่ การเชื่อม การฉาบ การแช่อิ่ม",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10739",
                BusinessName = "การผลิตลูกกวาดและขนมอื่น ๆ ที่ทำจากน้ำตาลซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "การผลิตลูกกวาดและขนมอื่น ๆ ที่ทำจากน้ำตาลซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "การผลิตลูกกวาด ลูกอม ท๊อฟฟี่ การผลิตขนมที่ทำจากน้ำตาลที่ไม่มีโกโก้ผสม การผลิตขนมอื่น ๆ ที่ทำจากน้ำตาล ซึ่งมิได้จัดประเภทไว้ในที่อื่น เช่น คาราเมล มาชเมลโล ตังเม นูกาท์ ฟองดองท์ ฯลฯ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10741",
                BusinessName = "การผลิตพาสต้า",
                InfoTitle = "การผลิตพาสต้า",
                InfoMessage = "การผลิตพาสต้า โดยไม่คำนึงว่าจะผลิตเป็นรูปแบบใด ทำการปรุงให้สุกหรือมีไส้หรือไม่ก็ตาม สปาเก็ตตี้ มักกะโรนี ลิงกวินี ฟูซิลี เพนเน ริกาโทนี ราวิโอลี (แป้งพาสต้าแบบแผ่นห่อไส้ผักหรือเนื้อสัตว์)",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10742",
                BusinessName = "การผลิตเส้นก๋วยเตี๋ยว บะหมี่ วุ้นเส้น",
                InfoTitle = "การผลิตเส้นก๋วยเตี๋ยว บะหมี่ วุ้นเส้น",
                InfoMessage = "การผลิตเส้นก๋วยเตี๋ยว เส้นก๋วยจั๊บ เส้นหมี่ เส้นเกี้ยมอี๋ การผลิตบะหมี่และแผ่นเกี๊ยว การผลิตวุ้นเส้นและผลิตภัณฑ์เส้นก๋วยเตี๋ยวที่ทำจากถั่ว เช่น เส้นก๋วยเตี๋ยวเซี่ยงไฮ้",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10743",
                BusinessName = "การผลิตผลิตภัณฑ์อาหารจำพวกแป้งชนิดสำเร็จรูปและ กึ่งสำเร็จรูป",
                InfoTitle = "การผลิตผลิตภัณฑ์อาหารจำพวกแป้งชนิดสำเร็จรูปและ กึ่งสำเร็จรูป",
                InfoMessage = "การผลิตบะหมี่กึ่งสำเร็จรูป การผลิตวุ้นเส้นกึ่งสำเร็จรูป รวมถึงผลิตภัณฑ์จำพวกแป้งบรรจุกระป๋อง เช่น ผลิตภัณฑ์พาสต้าที่ปรุงสุกและสปาเกตตี้กระป๋อง",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10749",
                BusinessName = "การผลิตผลิตภัณฑ์อาหารจำพวกแป้งอื่น ๆ ที่คล้ายกันซึ่งมิได้ จัดประเภทไว้ในที่อื่น",
                InfoTitle = "การผลิตผลิตภัณฑ์อาหารจำพวกแป้งอื่น ๆ ที่คล้ายกันซึ่งมิได้ จัดประเภทไว้ในที่อื่น",
                InfoMessage = "การผลิตขนมจีน การผลิตใบเมี่ยง การผลิตคูสคูส การผลิตผลิตภัณฑ์อาหารจำพวกแป้งที่คล้ายกันอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10751",
                BusinessName = "การผลิตอาหารปรุงสำเร็จแช่แข็ง",
                InfoTitle = "การผลิตอาหารปรุงสำเร็จแช่แข็ง",
                InfoMessage = "การผลิตอาหารปรุงสำเร็จแช่แข็ง (ทีวีดินเนอร์) การผลิตอาหารทะเลปรุงสำเร็จ แช่แข็ง การผลิตอาหารว่างปรุงสำเร็จแช่แข็ง การผลิตเบเกอรี่ ขนมหวาน และอาหารปรุงสำเร็จแช่แข็งอื่น ๆ การผลิตอาหารฟาสฟู๊ดปรุงสำเร็จแช่แข็ง เช่น พิซซ่า สปาเก็ตตี้ ลาซันย่า ฯลฯ นอกจากนี้ยังรวมถึง การผลิตเนื้อสัตว์ และเนื้อสัตว์ปีกปรุงสำเร็จแช่แข็ง",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10752",
                BusinessName = "การผลิตอาหารปรุงสำเร็จบรรจุในภาชนะปิดสนิทโดยวิธีสุญญากาศ",
                InfoTitle = "การผลิตอาหารปรุงสำเร็จบรรจุในภาชนะปิดสนิทโดยวิธีสุญญากาศ",
                InfoMessage = "การผลิตอาหารปรุงสำเร็จบรรจุกระป๋อง ขวดแก้วหรือในภาชนะปิดสนิทโดยวิธีสุญญากาศ (เช่น พลาสติกสุญญากาศ) โดยผ่านกรรมวิธีให้ความร้อน",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10761",
                BusinessName = "การผลิตกาแฟ",
                InfoTitle = "การผลิตกาแฟ",
                InfoMessage = "การสกัดคาเฟอีนออกจากกาแฟ และการคั่วกาแฟ การผลิตผลิตภัณฑ์กาแฟ เช่น กาแฟบด กาแฟสำเร็จรูป กาแฟผสมสมุนไพร เช่น การแฟผสมเห็ดหลินจือ การผลิตสารสกัดจากกาแฟ หรือการใช้ชิโครี่อบและบดผสมกาแฟหรือใช้แทนกาแฟ หรือสิ่งปรุงแต่งอื่น ๆ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10762",
                BusinessName = "การผลิตชา",
                InfoTitle = "การผลิตชา",
                InfoMessage = "การผลิตชา ชามาเต้ การผลิตสารสกัดจากชา การผลิตชาเขียว ชาดำและชาที่ผ่านการหมักบ้างแล้ว",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10769",
                BusinessName = "การผลิตสมุนไพรผงสำหรับชงเป็นเครื่องดื่ม",
                InfoTitle = "การผลิตสมุนไพรผงสำหรับชงเป็นเครื่องดื่ม",
                InfoMessage = "การผลิตสมุนไพรชง สารสกัดและสิ่งปรุงแต่งจากชาสมุนไพร ไม่ว่าเติมนํ้าตาลหรือสารทำให้หวานอื่น ๆหรือไม่ก็ตาม",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10771",
                BusinessName = "การผลิตเครื่องเทศและเครื่องแกงสำเร็จรูป",
                InfoTitle = "การผลิตเครื่องเทศและเครื่องแกงสำเร็จรูป",
                InfoMessage = "การผลิตเครื่องเทศ เครื่องปรุงกลิ่น รส สีของอาหารที่ทำจากธรรมชาติ เช่น พริกแห้ง พริกป่น พริกไทย วานิลา อบเชยและดอกอบเชย กานพลู (ผล ดอก และก้านดอก) ลูกจันทน์เทศ ดอกจันทน์เทศและกระวาน เมล็ดยี่หร่า เมล็ด โป๊ยกั๊ก เมล็ดผักชี เมล็ดเทียนขาวหรือเมล็ดคาราเวย์ เมล็ดเทียน ข้าวเปลือกและจูนิเปอร์เบอร์รี่ ขิง หญ้าฝรั่น ขมิ้น ใบไทม์ ใบเบย์ หอมแขกและเครื่องเทศอื่น ๆ การผลิตเครื่องแกงสำเร็จรูปทั้งชนิดสด ชนิดแห้งหรือทำเป็นผง",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10772",
                BusinessName = "การผลิตซอสและเครื่องปรุงอาหารประจำโต๊ะ",
                InfoTitle = "การผลิตซอสและเครื่องปรุงอาหารประจำโต๊ะ",
                InfoMessage = "การผลิตซอสพริก ซอสมะเขือเทศ ซอสบาร์บิคิว ซอสเย็นตาโฟและซอสอื่น ๆที่ใช้เป็นเครื่องปรุงประจำโต๊ะอาหาร การผลิตน้ำส้มสายชู นำส้มสายชูเทียม การผลิตน้ำจิ้ม การผลิตมายองเนส สลัดครีม น้ำสลัด การผลิตแซนวิชสเปรด การผลิตมัสตาร์ด การผลิตมัสตาร์ดที่ปรุงรสแล้ว",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10773",
                BusinessName = "การผลิตซีอิ๊ว",
                InfoTitle = "การผลิตซีอิ๊ว",
                InfoMessage = "การผลิตซีอิ๊วและซอสปรุงรส ซึ่งเป็นผลิตภัณฑ์ที่เป็นของเหลวได้จากการย่อยโปรตีนของถั่วเหลืองด้วยการหมักหรือกรรมวิธีอื่นที่เหมาะสมและจะแต่งรสหรือสีหรือไม่ก็ตาม การผลิตซอสหอยนางรม",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10774",
                BusinessName = "การผลิตผงชูรส",
                InfoTitle = "การผลิตผงชูรส",
                InfoMessage = "การผลิตผงชูรส เครื่องปรุงรสสำเร็จรูปทั้งชนิดผงและชนิดก้อน",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10775",
                BusinessName = "การผลิตเกลือบริโภค",
                InfoTitle = "การผลิตเกลือบริโภค",
                InfoMessage = "การผลิตเกลือบริโภค/เกลือแกงที่ใช้ปรุงหรือแต่งรสอาหาร เช่น เกลือแกงที่เติมสารประกอบของไอโอดีน",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10779",
                BusinessName = "การผลิตเครื่องปรุงอาหารประจำโต๊ะและเครื่องประกอบอาหาร อื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "การผลิตเครื่องปรุงอาหารประจำโต๊ะและเครื่องประกอบอาหาร อื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "การผลิตกะทิสำเร็จรูปสำหรับปรุงอาหาร การผลิตยีสต์ ผงฟู/เบคกิ้งโซดา การผลิตน้ำตาลไอซิ่ง การผลิตเจลาติน/ผงวุ้น การผลิตสีผสมอาหารจากธรรมชาติ การผลิตผงหมักเชื้อ การผลิตน้ำผึ้งแท้ที่ผ่านกระบวนการแปรรูป (เช่น ผ่านการฆ่าเชื้อ) รวมถึงน้ำผึ้งเทียมและคาราเมล การผลิตเครื่องปรุงรสอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10791",
                BusinessName = "การผลิตขนมขบเคี้ยว/ขนมกรุบกรอบ",
                InfoTitle = "การผลิตขนมขบเคี้ยว/ขนมกรุบกรอบ",
                InfoMessage = "การผลิตขนมขบเคี้ยว/ขนมกรุบกรอบ ข้าวเกรียบ ข้าวอบกรอบ ข้าวโพดอบกรอบ แป้งทอด",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10792",
                BusinessName = "การผลิตขนมไทยและขนมพื้นเมือง (ยกเว้นขนมอบ)",
                InfoTitle = "การผลิตขนมไทยและขนมพื้นเมือง (ยกเว้นขนมอบ)",
                InfoMessage = "การผลิตขนมกวน (ยกเว้น ผลไม้กวน) เช่น ลูกชุบ เปียกปูน ลืมกลืน กะละแม ตะโก้ ข้าวเหนียวแก้ว การผลิตขนมเชื่อมสด (ยกเว้น ผักและผลไม้เชื่อม) เช่น ทองหยิบ ทองหยอด ฝอยทอง เม็ดขนุน การผลิตขนมทอด เช่น ดอกจอก ฝักบัว มันรังนก กล้วยแขก ขนมกง ทองพลุ การผลิตขนมต้ม เช่น ต้มแดง ต้มขาว ข้าวต้มน้ำวุ้น การผลิตขนมนึ่ง เช่น ขนมชั้น ปุยฝ้าย ถ้วยฟู ใส่ไส้ ขนมตาล ขนมกล้วย ขนมถ้วย การผลิตขนมอื่น ๆ เช่น จ่ามงกุฎ ทองเอก วุ้นกะทิ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10793",
                BusinessName = "การผลิตซุปน้ำซุปและอาหารพิเศษ",
                InfoTitle = "การผลิตซุปน้ำซุปและอาหารพิเศษ",
                InfoMessage = "การผลิตซุปและน้ำซุปที่ได้จากการสกัดและแปรรูปเนื้อสัตว์ให้มีลักษณะเหลว ก้อนแข็งหรือการแช่แข็ง การทำซุปที่มีส่วนผสมของเนื้อสัตว์ กุ้ง ปู ปลา หอย เช่น ซุปไก่สกัด ฯลฯ รวมถึงการผลิตซุปบรรจุกระป๋อง การผลิตอาหารพิเศษ เช่น อาหารสูตรสำหรับทารก นมและอาหารสูตรต่อเนื่อง อาหารสำหรับเด็กอ่อน อาหารซึ่งมีส่วนผสมที่รวมเป็นเนื้อเดียวกัน เช่น เนื้อสัตว์และส่วนอื่นที่บริโภคได้ของสัตว์ที่ผสมรวมเป็นเนื้อเดียวกัน พืชผักที่ผสมเข้าเป็นเนื้อเดียวกัน ผลไม้ ถั่วเปลือกแข็งและส่วนอื่นที่บริโภคได้ของพืชที่ผสมเข้าเป็นเนื้อเดียวกัน อาหารพิเศษสำหรับผู้ควบคุมอาหาร เช่น อาหารสำหรับผู้ป่วยเป็นเบาหวาน",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10794",
                BusinessName = "การผลิตอาหารพร้อมปรุงและอาหารที่เน่าเสียง่าย",
                InfoTitle = "การผลิตอาหารพร้อมปรุงและอาหารที่เน่าเสียง่าย",
                InfoMessage = "การผลิตอาหารพร้อมปรุง การผลิตอาหารที่เน่าเสียง่าย เช่น กับข้าวสำเร็จรูป แซนด์วิช พิซซ่าสด (ที่ยังไม่ได้อบ)",
            });

            //model.Add(new DBDBusinessModel
            //{
            //    BusinessType = BusinessType.AGP,
            //    TSIC = "10795",
            //    BusinessName = "การผลิตน้ำแข็งเพื่อการบริโภค",
            //    InfoTitle = "การผลิตน้ำแข็งเพื่อการบริโภค",
            //    InfoMessage = "การผลิตน้ำแข็งเพื่อการบริโภค เช่น น้ำแข็งเกร็ด น้ำแข็งหลอด",
            //});

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10796",
                BusinessName = "การผลิตผลิตภัณฑ์จากไข่",
                InfoTitle = "การผลิตผลิตภัณฑ์จากไข่",
                InfoMessage = "การผลิตผลิตภัณฑ์จากไข่โดยการถนอมและการแปรรูปไข่ด้วยกรรมวิธีต่าง ๆ เช่น การทำไข่ผง ไข่ตากแห้ง ไข่เหลวแช่แข็ง ไข่เค็ม ไข่เยี่ยวม้า ไข่กระป๋อง ฯลฯ การผลิตแอลบูมินจากไข่ รวมถึงการผลิตอาหารที่ใช้ไข่เป็นส่วนประกอบหลักสำคัญด้วย",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10799",
                BusinessName = "การผลิตผลิตภัณฑ์อาหารอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "การผลิตผลิตภัณฑ์อาหารอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "การผลิตน้ำพริกสำเร็จรูปชนิดต่าง ๆ เช่น น้ำพริกนรก น้ำพริกตาแดง ฯลฯ การผลิตเครื่องแต่งหน้าเค้ก การผลิตสารสกัดจากเนื้อสัตว์ เนื้อสัตว์ปีก สัตว์น้ำ สัตว์น้ำจำพวกครัสตาเซียหรือโมลลุสก์ การผลิตนมที่ไม่ได้ทำจากสัตว์และของที่ใช้แทนชีส การผลิตหัวเชื้อสังเคราะห์ การผลิตเครื่องดื่มรังนกสำเร็จรูป การผลิตผลิตภัณฑ์อาหารอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10801",
                BusinessName = "การผลิตอาหารสำเร็จรูปสำหรับสัตว์เลี้ยง",
                InfoTitle = "การผลิตอาหารสำเร็จรูปสำหรับสัตว์เลี้ยง",
                InfoMessage = "การผลิตอาหารสำเร็จรูปสำหรับสัตว์เลี้ยง เช่น สุนัข แมว นก ปลา ฯลฯ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "10802",
                BusinessName = "การผลิตอาหารสำเร็จรูปสำหรับเลี้ยงปศุสัตว์ในฟาร์ม",
                InfoTitle = "การผลิตอาหารสำเร็จรูปสำหรับเลี้ยงปศุสัตว์ในฟาร์ม",
                InfoMessage = "การผลิตอาหารสำเร็จรูปสำหรับเลี้ยงปศุสัตว์ในฟาร์ม อาหารผสมสำเร็จรูป และอาหารเสริมสำหรับสัตว์ การผลิตหัวอาหารหรืออาหารเข้มข้น อาหารเสริมพวกวิตามินและเกลือแร่ต่าง ๆ การผลิตอาหารที่ยังไม่ผสมสำหรับปศุสัตว์ในฟาร์ม นอกจากนี้ยังรวมถึง กรรมวิธีจัดการกับของเหลือหรือผลพลอยได้จากการฆ่าสัตว์เพื่อนำมาผลิตเป็นอาหารสัตว์",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "11011",
                BusinessName = "การผลิตสุรากลั่น",
                InfoTitle = "การผลิตสุรากลั่น",
                InfoMessage = "การผลิตสุรากลั่น เช่น วิสกี้ วอดก้า รัม บรั่นดี สุรา เตกิลา คอนยัค เกาเหลียง เหล้าโรงหรือเหล้าขาว รวมถึงการผลิตนิวทรัลสปิริตหรือแอลกอฮอล์บริสุทธิ์ ร้อยละ 95 ขึ้นไป",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "11012",
                BusinessName = "การผลิตสุราผสม",
                InfoTitle = "การผลิตสุราผสม",
                InfoMessage = "การผลิตสุราผสม เช่น เชี่ยงชุน ยิน ลิเคียว การผลิตสุราผสมพิเศษ เช่น หงษ์ทอง มังกรทอง การผลิตสุราปรุงพิเศษ เช่น แม่โขง การผลิตสุราที่มีสรรพคุณเป็นยา การผลิตค็อกเทลสำเร็จรูปหรือสุราแรงแอลกอฮอล์ต่ำ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "11021",
                BusinessName = "การผลิตไวน์องุ่น",
                InfoTitle = "การผลิตไวน์องุ่น",
                InfoMessage = "การผลิตไวน์องุ่น รวมถึงการผลิตไวน์จากองุ่นที่ปลูกเอง การผลิตไวน์อัดลม เช่น แชมเปญ ไวน์คูลเลอร์ การผลิตไวน์แรง เช่น เชอร์รี่ การผลิตไวน์ที่ปรุงกลิ่นรส เช่น เวอร์มุธ การผลิตไวน์จากเกรปมัสต์เข้มข้น",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "11022",
                BusinessName = "การผลิตไวน์ผลไม้ (ยกเว้นองุ่น)",
                InfoTitle = "การผลิตไวน์ผลไม้ (ยกเว้นองุ่น)",
                InfoMessage = "การผลิตไวน์ผลไม้ ที่ทำจากผลไม้อื่น นอกจากองุ่น เช่น สับปะรด เสาวรส มะขาม มะนาว ลิ้นจี่ สตอร์เบอร์รี่ ฯลฯ รวมถึงไวน์ผลไม้ที่ผสมกับไวน์องุ่นด้วย",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "11029",
                BusinessName = "การผลิตสุราผลไม้ (ไวน์) ซึ่งมิได้จัดประเภทไว้ที่อื่น",
                InfoTitle = "การผลิตสุราผลไม้ (ไวน์) ซึ่งมิได้จัดประเภทไว้ที่อื่น",
                InfoMessage = "การผลิตไวน์ที่ผลิตจากสมุนไพร เช่น กระชายดำ ส้มแขก ยอ กระวาน การผลิตไวน์/สุราแช่ที่ผลิตจากผลผลิตทางการเกษตรอื่น ๆ เช่น ข้าว น้ำผึ้ง แป้ง น้ำตาล เพื่อผลิตเป็นสุราแช่ เช่น สาเก อุ สาโท กระแช่ น้ำตาลเมา ไวน์น้ำผึ้ง การผลิตสุรากลั่นชุมชน การผลิตไวน์ที่มีแอลกอฮอล์ต่ำหรือไม่มีแอลกอฮอล์",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "11030",
                BusinessName = "การผลิตมอลต์และสุราที่ทำจากข้าวมอลต์",
                InfoTitle = "การผลิตมอลต์และสุราที่ทำจากข้าวมอลต์",
                InfoMessage = "การผลิตสุราจากข้าวมอลต์ เช่น เบียร์ เหล้าเอล เบียร์ดำ การผลิตมอลต์ นอกจากนี้ยังรวมถึงการผลิตเบียร์ที่มีแอลกอฮอล์ต่ำหรือไม่มีแอลกอฮอล์",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "11041",
                BusinessName = "การผลิตน้ำดื่มบริสุทธิ์และน้ำแร่บรรจุขวด",
                InfoTitle = "การผลิตน้ำดื่มบริสุทธิ์และน้ำแร่บรรจุขวด",
                InfoMessage = "การผลิตน้ำแร่ธรรมชาติและน้ำแร่อัดลมบรรจุขวดหรือภาชนะปิดสนิทอื่น ๆ การผลิตน้ำดื่มบรรจุขวดหรือภาชนะปิดสนิทอื่น ๆ",
            });

            //model.Add(new DBDBusinessModel
            //{
            //    BusinessType = BusinessType.AGP,
            //    TSIC = "11042",
            //    BusinessName = "การผลิตน้ำอัดลมและโซดา",
            //    InfoTitle = "การผลิตน้ำอัดลมและโซดา",
            //    InfoMessage = "การผลิตน้ำอัดลม การผลิตน้ำผลไม้ชนิดอัดลม น้ำหวานชนิดอัดลม การผลิตโซดา",
            //});

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "11043",
                BusinessName = "การผลิตเครื่องดื่มกาแฟ ชาและชาชงสมุนไพรพร้อมดื่ม",
                InfoTitle = "การผลิตเครื่องดื่มกาแฟ ชาและชาชงสมุนไพรพร้อมดื่ม",
                InfoMessage = "การผลิตเครื่องดื่มที่มีกาแฟ ชาและชาชงสมุนไพรเป็นส่วนประกอบหลัก ไม่ว่าจะบรรจุในกระป๋อง ขวดหรือภาชนะบรรจุที่ปิดสนิทอื่น ๆ เช่น กาแฟกระป๋องพร้อมดื่ม เครื่องดื่มชาเขียวยูเอชทีหรือบรรจุขวด เครื่องดื่มชาชงสมุนไพรบรรจุขวด",
            });

            //model.Add(new DBDBusinessModel
            //{
            //    BusinessType = BusinessType.AGP,
            //    TSIC = "11044",
            //    BusinessName = "การผลิตเครื่องดื่มให้พลังงานรวมถึงเครื่องดื่มเกลือแร่",
            //    InfoTitle = "การผลิตเครื่องดื่มให้พลังงานรวมถึงเครื่องดื่มเกลือแร่",
            //    InfoMessage = "การผลิตเครื่องดื่มให้พลังงาน การผลิตเครื่องดื่มชูกำลัง การผลิตเครื่องดื่มเกลือแร่",
            //});

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "11049",
                BusinessName = "การผลิตเครื่องดื่มที่ไม่มีแอลกอฮอล์อื่นๆซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "การผลิตเครื่องดื่มที่ไม่มีแอลกอฮอล์อื่นๆซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "การผลิตเครื่องดื่มที่ปรุงกลิ่นและ/หรือมีรสหวานที่ไม่มีแอลกอฮอล์ น้ำมะนาว น้ำส้ม น้ำผลไม้ น้ำโทนิค ฯลฯ การผลิตเครื่องดื่มที่ปรุงกลิ่นรสด้วยน้ำผลไม้ น้ำเชื่อม หรือ วัตถุอื่นๆ การผลิตเครื่องดื่มที่ไม่มี แอลกอฮอล์อี่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "12001",
                BusinessName = "การบ่มและการอบใบยาสูบ",
                InfoTitle = "การบ่มและการอบใบยาสูบ",
                InfoMessage = "การบ่มใบยาสูบ ไม่ว่าจะบ่มด้วยกรรมวิธีบ่มไอร้อน บ่มอากาศหรือบ่มแดดและการอบใบยาสูบ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "12002",
                BusinessName = "การผลิตบุหรี่และซิการ์",
                InfoTitle = "การผลิตบุหรี่และซิการ์",
                InfoMessage = "การผลิตบุหรี่ทั้งชนิดที่มีก้นกรองและไม่มีก้นกรอง การผลิตซิการ์",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "12009",
                BusinessName = "การผลิตผลิตภัณฑ์จากยาสูบและผลิตภัณฑ์ที่ใช้แทนยาสูบอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น (ยกเว้นบุหรี่และซิการ์)",
                InfoTitle = "การผลิตผลิตภัณฑ์จากยาสูบและผลิตภัณฑ์ที่ใช้แทนยาสูบอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น (ยกเว้นบุหรี่และซิการ์)",
                InfoMessage = "การผลิตผลิตภัณฑ์ยาสูบและผลิตภัณฑ์ที่ใช้แทนยาสูบ (ยกเว้น บุหรี่และซิการ์) เช่น ยาเส้น ยาเส้นที่ใช้เคี้ยว (เช่น ยาแดง ยาจืด ยาฉุน)และยานัตถุ์ การผลิตยาสูบชนิด “โฮโมจีไนส์”หรือชนิด “รีคอนสติติวเตด”",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "13111",
                BusinessName = "การเตรียมเส้นใย",
                InfoTitle = "การเตรียมเส้นใย",
                InfoMessage = "การเตรียมเส้นใยสิ่งทอ การสาว การล้างไหม การลอกกาวไหม การกำจัดไขมันและสิ่งสกปรกออกจากขนสัตว์ การสาง การหวีขนสัตว์ เส้นใยจากพืช เช่น ปอกระเจา ป่านศรนารายณ์ แฟลกส์หรือป่านรามี ป่านมะนิลา ใยมะพร้าวหรือเส้นใยจากพืชหรือสัตว์อื่น ๆ และเส้นใยสังเคราะห์ทุกชนิด รวมถึงการผลิตผลิตภัณฑ์จากเศษวัสดุจากการสางเส้นใย",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "13112",
                BusinessName = "การปั่นด้ายจากเส้นใยธรรมชาติ",
                InfoTitle = "การปั่นด้ายจากเส้นใยธรรมชาติ",
                InfoMessage = "การผลิตด้ายหรือเส้นด้ายจากเส้นใยธรรมชาติ เช่น ฝ้าย ไหม ขนแกะ ฯลฯ สำหรับการทอหรือการเย็บ การนำไปผ่านกระบวนการอื่น ด้ายหรือเส้นด้ายอาจเป็นส่วนประกอบของเส้นใยธรรมชาติรวมกับเส้นใยอื่น ๆ นอกจากนี้ยังรวมถึงการผลิตเส้นด้ายที่ทำจากเซลลูโลสด้วย",
            });

            //model.Add(new DBDBusinessModel
            //{
            //    BusinessType = BusinessType.AGP,
            //    TSIC = "13113",
            //    BusinessName = "การปั่นด้ายจากเส้นใยสังเคราะห์",
            //    InfoTitle = "การปั่นด้ายจากเส้นใยสังเคราะห์",
            //    InfoMessage = "การผลิตด้ายหรือเส้นด้ายจากเส้นใยสังเคราะห์ เช่น เส้นใยพอลิเอสเตอร์เส้นใยไนลอน เส้นใยเรยอน เส้นใยอะครีลิค สำหรับการทอหรือการเย็บ การนำไปผ่านกระบวนการอื่น การผลิตเส้นด้ายยืดหรือด้ายย่น การตีเกลียว การควบ การควั่นเกลียวและการจุ่มเส้นด้ายสังเคราะห์หรือเส้นด้ายเทียม",
            //});

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "13121",
                BusinessName = "การทอผ้าจากเส้นใยธรรมชาติ",
                InfoTitle = "การทอผ้าจากเส้นใยธรรมชาติ",
                InfoMessage = "การผลิตผ้าทอจากเส้นใยธรรมชาติ เช่น ผ้าฝ้าย ผ้าไหมหรือเศษไหม ผ้าขนสัตว์ ผ้าป่าน ผ้าลินิน และผ้าที่ทอจากเส้นใยธรรมชาติอื่น ๆ รวมถึงผ้าทอจาก เส้นใยเซลลูโลส",
            });

            //model.Add(new DBDBusinessModel
            //{
            //    BusinessType = BusinessType.AGP,
            //    TSIC = "13122",
            //    BusinessName = "การทอผ้าจากเส้นใยสังเคราะห์",
            //    InfoTitle = "การทอผ้าจากเส้นใยสังเคราะห์",
            //    InfoMessage = "การผลิตผ้าทอจากเส้นใยสังเคราะห์ เช่น ผ้าไนลอน ผ้าโพลีเอสเตอร์ ผ้าเรยอน ผ้าที่ทอจากเส้นใยอะครีลิค ฯลฯ",
            //});

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AGP,
                TSIC = "13129",
                BusinessName = "การทอผ้าจากเส้นใยอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "การทอผ้าจากเส้นใยอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "การผลิตผ้าชนิดพิเศษ เช่น ผ้ากำมะหยี่หรือผ้าทอแบบเชนิลล์ ผ้าขนหนู ผ้าก๊อซ (ทอผ้าบางเพื่อทำผ้าพันแผล) ฯลฯ การผลิตสิ่งทอจากใยแก้ว การผลิตเส้นใยใบคาร์บอน และการผลิตเส้นด้ายอารมิด การผลิตผ้าหนังขนสัตว์เทียม และการผลิตสิ่งทออื่น ๆ เช่น ผ้ายืด ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
            });

            //model.Add(new DBDBusinessModel
            //{
            //    BusinessType = BusinessType.AGP,
            //    TSIC = "13131",
            //    BusinessName = "การขจัดไขมันและสิ่งสกปรกการฟอกขาวและการย้อมสี",
            //    InfoTitle = "การขจัดไขมันและสิ่งสกปรกการฟอกขาวและการย้อมสี",
            //    InfoMessage = "การขจัดไขมัน และสิ่งสกปรก การฟอกขาว และการย้อมสีเส้นใย เส้นด้าย ผ้าและวัสดุสิ่งทอ รวมทั้งผ้าสำหรับตัดเครื่องแต่งกาย การฟอกยีน",
            //});

            //model.Add(new DBDBusinessModel
            //{
            //    BusinessType = BusinessType.AGP,
            //    TSIC = "13132",
            //    BusinessName = "การพิมพ์ผ้า",
            //    InfoTitle = "การพิมพ์ผ้า",
            //    InfoMessage = "การพิมพ์ผ้า เช่น การพิมพ์ซิลค์สกรีนบนสิ่งทอ และเครื่องแต่งกาย การเขียนลายผ้า เช่น การทำผ้าบาติก",
            //});

            //model.Add(new DBDBusinessModel
            //{
            //    BusinessType = BusinessType.AGP,
            //    TSIC = "13139",
            //    BusinessName = "การตกแต่งสำเร็จสิ่งทอด้วยวิธีอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
            //    InfoTitle = "การตกแต่งสำเร็จสิ่งทอด้วยวิธีอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
            //    InfoMessage = "การตกแต่ง การอบแห้ง การอบไอน้ำ การทำผ้าให้หดตัวได้ขนาดก่อนเข้าสู่กระบวนการตกแต่งสำเร็จ การควบคุมการยืดหดของผ้าและการชุบมัน สิ่งทอ วัสดุสิ่งทอและ ผ้าสำหรับตัดเครื่องแต่งกาย การอัดพลีตและการจับจีบ การกันน้ำ การเคลือบหรือการฉาบผิวด้วยยาง รวมทั้งการตกแต่งสำเร็จเสื้อผ้าสำเร็จรูป",
            //});

            //model.Add(new DBDBusinessModel
            //{
            //    BusinessType = BusinessType.AGP,
            //    TSIC = "13910",
            //    BusinessName = "การผลิตผ้าถักและผ้าถักโครเชต์",
            //    InfoTitle = "การผลิตผ้าถักและผ้าถักโครเชต์",
            //    InfoMessage = "การผลิตและการแปรรูปของผ้าถัก และผ้าถักโครเชต์ ผ้าไหมพรม ผ้าขนและผ้าขนหนู ผ้าตาข่ายและผ้าตกแต่งหน้าต่างที่ถักบนเครื่องจักรราเชล หรือเครื่องจักรที่คล้ายกัน ผ้าถัก และผ้าถักโครเชต์ นอกจากนี้ยังรวมถึงการผลิตผ้าหนังขนสัตว์เทียมด้วยการถัก",
            //});

            //model.Add(new DBDBusinessModel
            //{
            //    BusinessType = BusinessType.AGP,
            //    TSIC = "13921",
            //    BusinessName = "การผลิตเครื่องนอนผ้าที่ใช้บนโต๊ะอาหารห้องน้ำและห้องครัว",
            //    InfoTitle = "การผลิตเครื่องนอนผ้าที่ใช้บนโต๊ะอาหารห้องน้ำและห้องครัว",
            //    InfoMessage = "การผลิตผ้าห่มและผ้าปูพื้นที่ใช้ในการเดินทาง การผลิตผ้าที่ใช้ในห้องนอน ผ้าปูเตียง ปลอกหมอนและผ้าคลุมเตียง การผลิตถุงนอนและของที่เป็นเครื่องเตียง รวมถึงของตกแต่งที่คล้ายกัน เช่น ผ้านวม ผ้านวมขนเป็ด เบาะรองนั่ง หมอนอิง หมอน และมุ้ง การผลิตผ้าที่ใช้บนโต๊ะอาหาร ผ้าปูโต๊ะ ผ้าเช็ดปากและผ้ารองจาน การผลิตผ้าใช้ในห้องน้ำและห้องครัว ผ้าเช็ดถ้วยชาม ผ้าขนหนูขนาดต่าง ๆ การผลิตส่วนของสิ่งทอสำหรับผ้าห่มไฟฟ้า",
            //});

            //model.Add(new DBDBusinessModel
            //{
            //    BusinessType = BusinessType.AGP,
            //    TSIC = "13922",
            //    BusinessName = "การผลิตผลิตภัณฑ์จากผ้าใบและผ้าอื่น ๆ ที่คล้ายกัน",
            //    InfoTitle = "การผลิตผลิตภัณฑ์จากผ้าใบและผ้าอื่น ๆ ที่คล้ายกัน",
            //    InfoMessage = "การผลิตผลิตภัณฑ์จากผ้าใบและผ้าอื่น ๆ ที่คล้ายกัน เช่น ผ้าใบคลุมของ ผ้าใบบังแดด ใบเรือสำหรับเรือ ใบเรือสำหรับเซลบอร์ดหรือใบเรือสำหรับเรือบก เต็นท์และเครื่องแคมปิ้ง ร่มชูชีพ ธง ป้ายผ้า ธงเรือ ฯลฯ ผ้าคลุมรถ ผ้าคลุมล้อรถ ผ้าคลุมเครื่องจักร เป็นต้น",
            //});

            //model.Add(new DBDBusinessModel
            //{
            //    BusinessType = BusinessType.AGP,
            //    TSIC = "13929",
            //    BusinessName = "การผลิตวัสดุสิ่งทอสำเร็จรูปอื่น ๆ ยกเว้นเครื่องแต่งกายซึ่งมิได้ จัดประเภทไว้ในที่อื่น",
            //    InfoTitle = "การผลิตวัสดุสิ่งทอสำเร็จรูปอื่น ๆ ยกเว้นเครื่องแต่งกายซึ่งมิได้ จัดประเภทไว้ในที่อื่น",
            //    InfoMessage = "การผลิตม่าน (รวมถึงม่านชนิดจับจีบ)และม่านบังตา กะบังม่านหรือกะบังเตียงที่ทำจากสิ่งทอทุกชนิด รวมถึงผ้าถักและผ้าถักโครเชต์ การผลิตกระสอบหรือถุงที่ใช้ในการบรรจุของทำจากปอกระเจาหรือเส้นใยจากพืชอื่น ๆ ฝ้าย วัตถุทอประดิษฐ์ และวัตถุทออื่น ๆ การผลิตผ้าคลุมเฟอร์นิเจอร์หรือคลุมเครื่องจักร ผ้าเช็ดพื้น ผ้าปัดฝุ่น เสื้อชูชีพและร่มชูชีพ ฯลฯ การผลิตผ้าทอมือที่ใช้ประดับข้างฝาที่ปักลวดลาย",
            //});

            //model.Add(new DBDBusinessModel
            //{
            //    BusinessType = BusinessType.AGP,
            //    TSIC = "13930",
            //    BusinessName = "การผลิตพรมและพรมหนา",
            //    InfoTitle = "การผลิตพรมและพรมหนา",
            //    InfoMessage = "การผลิตสิ่งทอที่ใช้ปูพื้น พรม พรมหนา และพรมเช็ดเท้า ฉนวนกันความร้อนบนหลังคา นอกจากนี้ ยังรวมถึงการผลิตผ้าสักหลาดปูพื้นด้วยเครื่องถักด้วยเข็ม",
            //});

            //model.Add(new DBDBusinessModel
            //{
            //    BusinessType = BusinessType.AGP,
            //    TSIC = "13940",
            //    BusinessName = "การผลิตเชือกเชือกเส้นใหญ่ตาข่ายแหและอวน",
            //    InfoTitle = "การผลิตเชือกเชือกเส้นใหญ่ตาข่ายแหและอวน",
            //    InfoMessage = "การผลิตเชือก เชือกเส้นใหญ่ สายเคเบิลหรือสิ่งที่มีลักษณะเป็นเชือก จุ่ม เคลือบ ฉาบหรือหุ้มด้วยยางหรือพลาสติก การผลิตแหหรืออวนที่ถักด้วยเชือก การผลิตผลิตภัณฑ์ที่ทำจากเชือกหรือตาข่าย แห อวน เชือกจูงเรือ เชือกสลิงหรือสายเคเบิลที่ติดกับห่วงโลหะ",
            //});

            //model.Add(new DBDBusinessModel
            //{
            //    BusinessType = BusinessType.AGP,
            //    TSIC = "13991",
            //    BusinessName = "การผลิตผ้าที่ไม่ได้ทอ",
            //    InfoTitle = "การผลิตผ้าที่ไม่ได้ทอ",
            //    InfoMessage = "การผลิตผ้าที่มีแต่ด้ายยืน โดยไม่มีด้ายพุ่งโดยขึ้นรูปด้วยวิธีติดกาว",
            //});

            //model.Add(new DBDBusinessModel
            //{
            //    BusinessType = BusinessType.AGP,
            //    TSIC = "13992",
            //    BusinessName = "การผลิตสิ่งทอชนิดใช้ในทางอุตสาหกรรม",
            //    InfoTitle = "การผลิตสิ่งทอชนิดใช้ในทางอุตสาหกรรม",
            //    InfoMessage = "การผลิตผ้าทอหน้าแคบ การผลิตผ้าที่จุ่ม เคลือบ ฉาบผิว ชุบหรือหุ้มด้วยพลาสติก การผลิตเส้นด้ายที่มีส่วนผสมของโลหะ เส้นด้ายและเส้นเชือกที่ทำจากยางหุ้มด้วยวัสดุสิ่งทอ เส้นด้ายหรือสิ่งทอที่จุ่ม เคลือบ ฉาบหรือหุ้มด้วยยาง หรือพลาสติก การผลิตผ้าใบยางล้อ (ผ้าไทร์คอร์ด) ที่ทำจากเส้นใยประดิษฐ์ที่ทนแรงดันสูง การผลิตท่ออ่อน สายพานลำเลียงและสายพานอื่น ๆ (ไม่ว่าจะเสริมด้วยโลหะหรือด้วยวัสดุอื่น ๆ) ผ้าร่อน ผ้ากรอง เช่น ถุงกรองสี ถุงกรองฝุ่น การผลิตผ้าที่ใช้ตกแต่งยานยนต์",
            //});

            //model.Add(new DBDBusinessModel
            //{
            //    BusinessType = BusinessType.AGP,
            //    TSIC = "13999",
            //    BusinessName = "การผลิตสิ่งทออื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
            //    InfoTitle = "การผลิตสิ่งทออื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
            //    InfoMessage = "การผลิตป้าย ผ้าแถบเครื่องหมาย ฯลฯ การผลิตเครื่องประดับตกแต่ง เช่น แถบถักแบบเปีย พู่ห้อย พู่ประดับ สายรวบม่าน ตาข่าย เช่น ผ้ามุ้ง (ยกเว้น มุ้ง) ฯลฯ การผลิตผ้าสักหลาด รวมถึงผ้าสักหลาด ที่จุ่ม เคลือบ ฉาบผิวหรือผ้าสักหลาดที่อัดเป็นชั้น การผลิตผ้าโปร่งชนิดทูลล์ และผ้าตาข่ายอื่น ๆ การผลิตผ้าลูกไม้ที่เป็นผืนเป็นแถบหรือเป็นลวดลายสำหรับใช้ประดับ การผลิตผ้าเคลือบชนิดอื่น ๆ เช่น ผ้าลอกลาย ผ้าใบสำหรับช่างเขียนผ้าแข็งซับในและผ้าแข็งที่คล้ายกัน ผ้าที่เคลือบด้วยยางไม้ หรือสารอะมิเลเซียส การผลิตผ้าปักที่เป็นผืน เป็นเส้น หรือเป็นชิ้น การผลิตผ้าเทปชนิดอ่อนไหวต่อแรงดัน การผลิตผ้าใบสำหรับศิลปินและผ้าลอกลาย การผลิตเชือกผูกรองเท้าที่ทำจากสิ่งทอ การผลิตวัสดุอื่น ๆ จากสิ่งทอ เช่น ไส้ตะเกียงก๊าซ ไส้ตะเกียง จากการทอหรือถัก การผลิตพัฟสำหรับผัดหน้าและถุงมือ หน้ากากกันฝุ่น (ผ้าปิดจมูก) รวมถึงการตกแต่งเย็บปัก ประดับลวดลายลงบนสิ่งทอ (ปักลายบนเสื้อ)",
            //});

            return model;
        }

        // ขนส่ง Logistics
        private static List<DBDBusinessModel> AddLogistics()
        {
            List<DBDBusinessModel> model = new List<DBDBusinessModel>();

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "49110",
                BusinessName = "การขนส่งผู้โดยสารทางรถไฟระหว่างเมือง",
                InfoTitle = "การขนส่งผู้โดยสารทางรถไฟระหว่างเมือง",
                InfoMessage = "การขนส่งผู้โดยสารทางรถไฟระหว่างเมือง รวมทั้งการดำเนินงานเกี่ยวกับรถตู้นอนและรถตู้เสบียงซึ่งเป็นการดำเนินการที่ผสมผสานกับบริษัทรถไฟ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "49120",
                BusinessName = "การขนส่งสินค้าทางรถไฟ",
                InfoTitle = "การขนส่งสินค้าทางรถไฟ",
                InfoMessage = "การขนส่งสินค้าทางรถไฟ รถรางต่าง ๆ ทั้งที่เป็นระบบเครือข่าย รวมถึงการขนส่งที่เป็นระยะทางสั้น ๆ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "49201",
                BusinessName = "การขนส่งผู้โดยสารด้วยรถโดยสารประจำทางในกรุงเทพฯ และปริมณฑล",
                InfoTitle = "การขนส่งผู้โดยสารด้วยรถโดยสารประจำทางในกรุงเทพฯ และปริมณฑล",
                InfoMessage = "การขนส่งผู้โดยสารทางรถโดยสารประจำทางในเขตเมืองและปริมณฑลตามเส้นทาง ตารางเวลาและมีจุดรับ-ส่งที่แน่นอน เช่น การบริการรถโดยสารประจำทาง ขสมก. รถร่วมบริการ รถไมโครบัส รถตู้โดยสาร ฯลฯ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "49202",
                BusinessName = "การขนส่งผู้โดยสารทางรถโดยสารประจำทางระหว่างกรุงเทพฯ กับจังหวัดอื่น",
                InfoTitle = "การขนส่งผู้โดยสารทางรถโดยสารประจำทางระหว่างกรุงเทพฯ กับจังหวัดอื่น",
                InfoMessage = "การขนส่งผู้โดยสารทางรถโดยสารประจำทางระหว่างกรุงเทพฯ กับจังหวัดอื่น ๆ ซึ่งให้บริการตามเส้นทางและมีตารางเวลาเดินรถที่ได้กำหนดไว้แล้ว เช่น การบริการรถโดยสารประจำทาง บขส. ระหว่างกรุงเทพฯ - เชียงใหม่ รถตู้โดยสารประจำทางระหว่างกรุงเทพฯ – ชลบุรี ฯลฯ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "49203",
                BusinessName = "การขนส่งผู้โดยสารทางรถโดยสารประจำทางระหว่างจังหวัด",
                InfoTitle = "การขนส่งผู้โดยสารทางรถโดยสารประจำทางระหว่างจังหวัด",
                InfoMessage = "การขนส่งผู้โดยสารทางรถโดยสารประจำทางระหว่างจังหวัด ตามเส้นทางตารางเวลาที่แน่นอน เช่น การบริการรถโดยสารประจำทาง บขส. ระหว่างจังหวัด อุบลราชธานี - เชียงใหม่ รถตู้โดยสารประจำทางระหว่างจังหวัดภูเก็ต - นครศรีธรรมราช ฯลฯ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "49204",
                BusinessName = "การขนส่งผู้โดยสารทางรถโดยสารประจำทางในชนบท",
                InfoTitle = "การขนส่งผู้โดยสารทางรถโดยสารประจำทางในชนบท",
                InfoMessage = "การขนส่งผู้โดยสารทางรถโดยสารประจำทางภายในเขตจังหวัด ซึ่งให้บริการตามเส้นทางและตารางเวลาเดินรถที่แน่นอน เช่น รถโดยสารประจำทางระหว่างอำเภอเมือง - อำเภออื่น ๆ ในจังหวัดเดียวกัน รถตู้โดยสารประจำทางภายในจังหวัด ฯลฯ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "49209",
                BusinessName = "การขนส่งผู้โดยสารทางรถโดยสารประจำทางอื่นๆซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "การขนส่งผู้โดยสารทางรถโดยสารประจำทางอื่นๆซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "การขนส่งผู้โดยสารทางรถโดยสารประจำทางอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่นตามเส้นทางและตารางเวลาเดินรถที่แน่นอน ทั้งระยะใกล้และระยะไกล เช่น รถโดยสารประจำทางเพื่อท่องเที่ยวและทัศนศึกษา ซึ่งมีกำหนดตารางเวลา รถรับ-ส่งนักเรียน รถรับ-ส่งพนักงาน ฯลฯ การขนส่งผู้โดยสารโดยรถลีมูซีน สนามบิน",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "49310",
                BusinessName = "การขนส่งผู้โดยสารในเขตเมืองและปริมณฑลยกเว้นทางรถโดยสารประจำทาง",
                InfoTitle = "การขนส่งผู้โดยสารในเขตเมืองและปริมณฑลยกเว้นทางรถโดยสารประจำทาง",
                InfoMessage = "การขนส่งผู้โดยสารทางรถใต้ดินและลอยฟ้าในเขตเมืองและปริมณฑล โดยจะมีการกำหนดเส้นทาง เวลา และสถานีรับ-ส่งที่แน่นอน เช่น รถไฟฟ้าบีทีเอส รถไฟฟ้าใต้ดิน รถไฟยกระดับ (ฟันนิคูล่าร์ เรลเวย์) กระเช้าลอยฟ้า ฯลฯ ที่เป็นส่วนหนึ่งของระบบขนส่งในเขตเมืองและปริมณฑล การขนส่งผู้โดยสารโดยรถราง โทรลเลย์บัส",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "49321",
                BusinessName = "การขนส่งผู้โดยสารโดยรถยนต์รับจ้าง/แท็กซี่",
                InfoTitle = "การขนส่งผู้โดยสารโดยรถยนต์รับจ้าง/แท็กซี่",
                InfoMessage = "การขนส่งผู้โดยสารโดยรถยนต์รับจ้าง/แท็กซี่ ที่ให้บริการทั้งในเขตเมือง ปริมณฑลและระหว่างเมือง ซึ่งจะมีการกำหนดเส้นทาง ระยะเวลาและจุดหมายปลายทางได้ รวมทั้งบริการจองรถโดยสารรับจ้างทางโทรศัพท์",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "49322",
                BusinessName = "การขนส่งผู้โดยสารโดยรถสามล้อเครื่องและจักรยานยนต์รับจ้าง",
                InfoTitle = "การขนส่งผู้โดยสารโดยรถสามล้อเครื่องและจักรยานยนต์รับจ้าง",
                InfoMessage = "การบริการรถสามล้อเครื่องและจักรยานยนต์รับจ้าง ที่ให้บริการทั้งในเขตเมืองปริมณฑลและระหว่างเมือง ซึ่งจะมีการกำหนดเส้นทาง ระยะเวลาและจุดหมายปลายทางได้",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "49323",
                BusinessName = "การขนส่งและขนถ่ายสินค้า รวมถึงคนโดยสาร",
                InfoTitle = "การขนส่งและขนถ่ายสินค้า รวมถึงคนโดยสาร",
                InfoMessage = "การดำเนินการเกี่ยวกับการขนส่งและขนถ่ายสินค้า หรือตัวแทนการขนส่งและขนถ่ายสินค้า รวมถึงคนโดยสารที่ไม่ระบุเส้นทาง",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "49329",
                BusinessName = "การขนส่งผู้โดยสารทางบกอื่นๆซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "การขนส่งผู้โดยสารทางบกอื่นๆซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "การบริการให้เช่าเหมารถโดยสาร เพื่อท่องเที่ยวและรถยนต์ส่วนบุคคลอื่น ๆพร้อมคนขับ (ยกเว้น การบริการรถโดยสารรับจ้าง) การบริการรถท่องเที่ยว หรือทัศนาจรเป็นครั้งคราว รวมทั้งการท่องเที่ยวชมเมือง การบริการที่เกี่ยวข้อง (มัคคุเทศก์ การจัดเตรียมอาหาร ฯลฯ) ซึ่งไม่ได้คิดราคาแยกต่างหาก การบริการขนส่ง ผู้โดยสารโดยยานพาหนะที่ใช้แรงงานคนหรือสัตว์ การขนส่งผู้โดยสารทางบกที่ไม่มีตารางเวลาอื่น ๆ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "49331",
                BusinessName = "การขนส่งสินค้าแช่เย็นหรือแช่แข็งทางถนน",
                InfoTitle = "การขนส่งสินค้าแช่เย็นหรือแช่แข็งทางถนน",
                InfoMessage = "การขนส่งสินค้าแช่เย็นหรือแช่แข็งทางถนนโดยรถบรรทุกหรือรถยนต์ที่ติดเครื่องทำความเย็นโดยเฉพาะ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "49332",
                BusinessName = "การขนส่งผลิตภัณฑ์ปิโตรเลียมทางถนน",
                InfoTitle = "การขนส่งผลิตภัณฑ์ปิโตรเลียมทางถนน",
                InfoMessage = "การขนส่งผลิตภัณฑ์ปิโตรเลียม เช่น น้ำมันดิบ ก๊าซธรรมชาติและผลิตภัณฑ์ปิโตรเลียมที่ได้จากการกลั่น ทางถนนโดยรถบรรทุกที่มีถังบรรจุโดยเฉพาะ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "49333",
                BusinessName = "การขนส่งของเหลวหรือก๊าซ (ยกเว้นก๊าซธรรมชาติ) ทางถนน",
                InfoTitle = "การขนส่งของเหลวหรือก๊าซ (ยกเว้นก๊าซธรรมชาติ) ทางถนน",
                InfoMessage = "การขนส่งของเหลวหรือก๊าซอื่น ๆ เช่น สารเคมี ไนโตรเจนเหลว ก๊าซฮีเลียม ฯลฯ ในปริมาณมากทางถนน ในรถบรรทุกที่มีถังบรรจุโดยเฉพาะ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "49334",
                BusinessName = "การขนส่งสินค้าที่บรรจุในตู้คอนเทนเนอร์ทางถนน",
                InfoTitle = "การขนส่งสินค้าที่บรรจุในตู้คอนเทนเนอร์ทางถนน",
                InfoMessage = "การขนส่งสิ่งของและหีบห่อที่นำมาจัดรวมกันและบรรจุลงในตู้คอนเทนเนอร์ที่ออกแบบมาให้สะดวกต่อการขนย้ายในการขนส่งทางถนน",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "49339",
                BusinessName = "การขนส่งสินค้าอื่นๆทางถนนซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "การขนส่งสินค้าอื่นๆทางถนนซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "การขนส่งสินค้าอื่น ๆ ทางถนน การขนส่งเฟอร์นิเจอร์ รวมถึงการขนย้ายเฟอร์นิเจอร์ การขนส่งสินค้าแห้งในปริมาณมาก เช่น ธัญพืช แป้ง ปูนซีเมนต์ ทราย ถ่านหิน การขนส่งสัตว์ที่เลี้ยงในฟาร์ม การขนส่งของเสียและวัสดุ โดยไม่รวมถึงการจัดเก็บและทำลาย การขนส่งคอนกรีต และแมกคาดัมคลุกน้ำมันดิน การขนส่งรถยนต์ การขนส่งพัสดุและไปรษณีย์ การขนส่งสินค้าโดยยานพาหนะที่ใช้แรงงานคนหรือสัตว์ การขนส่งสินค้าอื่น ๆ ทางถนน ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "49400",
                BusinessName = "การขนส่งทางระบบท่อลำเลียง",
                InfoTitle = "การขนส่งทางระบบท่อลำเลียง",
                InfoMessage = "การขนส่งก๊าซ ของเหลว น้ำ ส่วนผสมที่เป็นของเหลว (เช่น ซีเมนต์) และสินค้าอื่น ๆ ทางระบบท่อลำเลียง รวมทั้งการดำเนินงานของสถานีที่ใช้เครื่องสูบ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "50111",
                BusinessName = "การขนส่งผู้โดยสารทางทะเลและตามแนวชายฝั่งทะเลโดยเรือโดยสารข้ามฟาก",
                InfoTitle = "การขนส่งผู้โดยสารทางทะเลและตามแนวชายฝั่งทะเลโดยเรือโดยสารข้ามฟาก",
                InfoMessage = "การขนส่งผู้โดยสารทางทะเลและตามแนวชายฝั่งทะเล โดยเรือโดยสารข้ามฟาก เรือข้ามฟากขนาดใหญ่หรือเรือเฟอรี่ จะมีการกำหนดตารางเวลาการเดินทางที่แน่นอนหรือไม่ก็ตาม",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "50112",
                BusinessName = "การขนส่งผู้โดยสารทางทะเลและตามแนวชายฝั่งทะเลโดยเรือท่องเที่ยวหรือเรือโดยสารทัศนาจรขนาดใหญ่",
                InfoTitle = "การขนส่งผู้โดยสารทางทะเลและตามแนวชายฝั่งทะเลโดยเรือท่องเที่ยวหรือเรือโดยสารทัศนาจรขนาดใหญ่",
                InfoMessage = "การขนส่งผู้โดยสารทางทะเลและตามแนวชายฝั่งทะเล การดำเนินงานเกี่ยวกับเรือท่องเที่ยว เรือโดยสารทัศนาจรขนาดใหญ่หรือเรือนำชมสถานที่ต่าง ๆ ทางทะเล (การบริการขนส่ง การบริการที่พัก การบริการจัดหาอาหารและการบริการที่เกี่ยวข้องที่ดำเนินงานโดยหน่วยเดียวกัน) การบริการให้เช่าเรือทัศนาจรหรือเรือสำราญกีฬา หรือมีคนประจำเรือสำหรับการเดินทางในทะเลและตามแนวชายฝั่งทะเล เช่น เรือเช่าสำหรับตกปลาในทะเล",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "50119",
                BusinessName = "การขนส่งผู้โดยสารทางทะเลและตามแนวชายฝั่งทะเลโดยเรืออื่นๆซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "การขนส่งผู้โดยสารทางทะเลและตามแนวชายฝั่งทะเลโดยเรืออื่นๆซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "การขนส่งผู้โดยสารทางทะเลและตามแนวชายฝั่งทะเลโดยเรืออื่น ๆ (ยกเว้น เรือโดยสารข้ามฟาก และเรือสำราญกีฬา) เรือโดยสารรับจ้าง (เรือแท็กซี่) หรือเรืออื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น จะมีการกำหนดตารางเวลาการเดินทางที่แน่นอนหรือไม่ก็ตาม",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "50121",
                BusinessName = "การขนส่งสินค้าทางทะเลและตามแนวชายฝั่งทะเล",
                InfoTitle = "การขนส่งสินค้าทางทะเลและตามแนวชายฝั่งทะเล",
                InfoMessage = "การขนส่งสินค้าทางทะเลและตามแนวชายฝั่งทะเล สินค้าแช่เย็นหรือแช่แข็ง การขนส่งน้ำมันดิบทางน้ำภายในประเทศ ของเหลวหรือก๊าซ (เช่น สารเคมี ก๊าซธรรมชาติ มีเทน ผลิตภัณฑ์ปิโตรเลียมที่ได้จากการกลั่น) สิ่งของที่นำมาบรรจุในตู้คอนเทนเนอร์ที่ออกแบบมาให้สะดวกต่อการขนย้าย สินค้าแห้งในปริมาณมาก (เช่น ธัญพืช แป้ง ปูนซีเมนต์ ทราย ถ่านหินและอื่น ๆ) และสินค้าอื่น ๆ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "50122",
                BusinessName = "การบริการลากจูงและดัน เรือลำเลียง/สิ่งก่อสร้างลอยน้ำ ที่ดำเนินการทางทะเลและตามแนวชายฝั่งทะเล",
                InfoTitle = "การบริการลากจูงและดัน เรือลำเลียง/สิ่งก่อสร้างลอยน้ำ ที่ดำเนินการทางทะเลและตามแนวชายฝั่งทะเล",
                InfoMessage = "การขนส่งสินค้าโดยการลากจูงและการดัน เรือลำเลียง/สิ่งก่อสร้างลอยน้ำที่ดำเนินการบริเวณน่านน้ำสากลและตามแนวชายฝั่งทะเล การบริการลากอุปกรณ์ขุดเจาะน้ำมัน ปั้นจั่นบนทุ่นลอย เรือขุด ทุ่น ตัวเรือและเรือที่ยังไม่เสร็จสมบูรณ์ทางทะเลและตามแนวชายฝั่งทะเล",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "50211",
                BusinessName = "การขนส่งผู้โดยสารทางน้ำภายในประเทศโดยเรือโดยสารข้ามฟาก",
                InfoTitle = "การขนส่งผู้โดยสารทางน้ำภายในประเทศโดยเรือโดยสารข้ามฟาก",
                InfoMessage = "การขนส่งผู้โดยสารทางแม่น้ำ ลำคลองและทางน้ำอื่น ๆ ภายในประเทศ โดยเรือข้ามฟาก รวมถึงแพ ซึ่งจะมีการกำหนดตารางเวลาการเดินเรือหรือไม่ก็ตาม",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "50212",
                BusinessName = "การขนส่งผู้โดยสารทางน้ำภายในประเทศโดยเรือทัศนาจรหรือเรือสำราญกีฬา",
                InfoTitle = "การขนส่งผู้โดยสารทางน้ำภายในประเทศโดยเรือทัศนาจรหรือเรือสำราญกีฬา",
                InfoMessage = "การดำเนินงานของเรือท่องเที่ยว เรือโดยสารทัศนาจรขนาดใหญ่หรือเรือนำชมสถานที่ต่าง ๆ ทางน้ำภายในประเทศ การล่องเรือสำราญทางน้ำภายในประเทศ รวมถึงการบริการขนส่ง การบริการที่พัก การบริการจัดหาอาหารและการบริการที่เกี่ยวข้องที่ดำเนินงานโดยหน่วยเดียวกัน การบริการให้เช่าเรือท่องเที่ยวหรือเรือสำราญกีฬาพร้อมคนประจำเรือ สำหรับการเดินทางทางน้ำภายในประเทศ เช่น เรือเช่าสำหรับตกปลา",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "50219",
                BusinessName = "การขนส่งผู้โดยสารทางน้ำภายในประเทศโดยเรืออื่นๆซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "การขนส่งผู้โดยสารทางน้ำภายในประเทศโดยเรืออื่นๆซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "การดำเนินงานของเรือโดยสารรับจ้างทางน้ำภายในประเทศ เช่น เรือด่วนเจ้าพระยา เรือคลองแสนแสบ การขนส่งผู้โดยสารทางน้ำภายในประเทศโดยเรืออื่น ๆ (ยกเว้นเรือโดยสารข้ามฟากและเรือท่องเที่ยวหรือเรือโดยสารทัศนาจรขนาดใหญ่) จะมีการกำหนดตารางเวลาการเดินทางที่แน่นอนหรือไม่ก็ตาม",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "50221",
                BusinessName = "การขนส่งทางน้ำภายในประเทศ",
                InfoTitle = "การขนส่งทางน้ำภายในประเทศ",
                InfoMessage = "การขนส่งสินค้าทางน้ำภายในประเทศ สินค้าแช่เย็นหรือแช่แข็ง น้ำมันดิบทางน้ำภายในประเทศ ของเหลวหรือก๊าซ (เช่น สารเคมี ก๊าซธรรมชาติ มีเทน ผลิตภัณฑ์ปิโตรเลียมที่ได้จากการกลั่น) สิ่งของที่นำมาบรรจุในตู้คอนเทนเนอร์ เพื่อสะดวกต่อการขนย้าย สินค้าแห้งในปริมาณมาก (เช่น ธัญพืช แป้ง ปูนซีเมนต์ ทราย ถ่านหินและอื่น ๆ ) และสินค้าอื่น ๆ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "50222",
                BusinessName = "การบริการลากจูงหรือการดัน เรือลำเลียง และสิ่งก่อสร้างลอยน้ำที่ดำเนินการทางน้ำภายในประเทศ",
                InfoTitle = "การบริการลากจูงหรือการดัน เรือลำเลียง และสิ่งก่อสร้างลอยน้ำที่ดำเนินการทางน้ำภายในประเทศ",
                InfoMessage = "การขนส่งสินค้าโดยการลากจูงหรือการดันเรือลำเลียง และสิ่งก่อสร้างลอยน้ำที่ดำเนินการบริเวณทางน้ำภายในประเทศ และคู คลอง การบริการลากปั้นจั่นบนทุ่นลอย เรือขุด ทุ่น ตัวเรือและเรือที่ยังไม่เสร็จสมบูรณ์",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "51101",
                BusinessName = "การขนส่งผู้โดยสารทางอากาศที่มีตารางเวลา",
                InfoTitle = "การขนส่งผู้โดยสารทางอากาศที่มีตารางเวลา",
                InfoMessage = "การขนส่งผู้โดยสารทางอากาศ ตามเส้นทางประจำและตารางเวลาที่กำหนดไว้เป็นประจำ ที่ให้บริการโดยอากาศยานแบบใดก็ได้ (รวมถึงเฮลิคอปเตอร์) ทั้งภายในประเทศและระหว่างประเทศ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "51102",
                BusinessName = "การขนส่งผู้โดยสารทางอากาศที่ไม่มีตารางเวลา",
                InfoTitle = "การขนส่งผู้โดยสารทางอากาศที่ไม่มีตารางเวลา",
                InfoMessage = "การขนส่งผู้โดยสารทางอากาศที่ไม่มีตารางเวลา ที่ให้บริการโดยอากาศยานแบบใดก็ได้ (รวมถึงเฮลิคอปเตอร์) ทั้งภายในประเทศและระหว่างประเทศ การจ้างเช่าเหมาลำขนส่งผู้โดยสาร การบินเพื่อชมทิวทัศน์และสถานที่ต่าง ๆ และยังรวมถึงการให้เช่าอุปกรณ์เกี่ยวกับการขนส่งทางอากาศพร้อมผู้ควบคุมวัตถุประสงค์ในการขนส่งผู้โดยสารทางอากาศ และกิจกรรมการบินทั่วไป เช่น การบินของสโมสรการบินเพื่อการฝึกบิน หรือการบินเพื่อพักผ่อนหย่อนใจ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "51201",
                BusinessName = "การขนส่งสินค้าทางอากาศที่มีตารางเวลา",
                InfoTitle = "การขนส่งสินค้าทางอากาศที่มีตารางเวลา",
                InfoMessage = "การขนส่งสินค้าทางอากาศตามเส้นทางและตารางเวลาที่กำหนดไว้เป็นประจำทั้งภายในประเทศและระหว่างประเทศ การขนส่งไปรษณีย์ทางอากาศ การขนส่งสินค้าที่บรรจุในตู้คอนเทนเนอร์ การบริการขนส่งสินค้าอื่น ๆ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "51202",
                BusinessName = "การขนส่งสินค้าทางอากาศที่ไม่มีตารางเวลา",
                InfoTitle = "การขนส่งสินค้าทางอากาศที่ไม่มีตารางเวลา",
                InfoMessage = "การขนส่งสินค้าทางอากาศที่ไม่มีตารางเวลาทั้งภายในประเทศและระหว่างประเทศ การบริการให้เช่าอุปกรณ์ขนส่งทางอากาศพร้อมผู้ควบคุม เพื่อขนส่งสินค้าทั้งภายในประเทศและระหว่างประเทศ การส่งดาวเทียม และยานอวกาศและการขนส่งทางอวกาศ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "52101",
                BusinessName = "กิจกรรมที่เกี่ยวกับคลังสินค้าและการจัดเก็บสินค้าแช่เย็นหรือแช่แข็ง",
                InfoTitle = "กิจกรรมที่เกี่ยวกับคลังสินค้าและการจัดเก็บสินค้าแช่เย็นหรือแช่แข็ง",
                InfoMessage = "การบริการจัดเก็บสินค้าและสถานที่เก็บสินค้าแช่เย็นหรือแช่แข็ง รวมทั้งผลิตภัณฑ์ที่เน่าเสียได้ง่าย",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "52102",
                BusinessName = "กิจกรรมที่เกี่ยวกับคลังสินค้าและการจัดเก็บสินค้าธัญพืช",
                InfoTitle = "กิจกรรมที่เกี่ยวกับคลังสินค้าและการจัดเก็บสินค้าธัญพืช",
                InfoMessage = "การบริการเก็บธัญพืช การดำเนินงานของฉางจัดเก็บธัญพืช",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "52109",
                BusinessName = "กิจกรรมที่เกี่ยวกับคลังสินค้าและการจัดเก็บสินค้าอื่นๆซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "กิจกรรมที่เกี่ยวกับคลังสินค้าและการจัดเก็บสินค้าอื่นๆซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "การบริการจัดเก็บสินค้าและสถานที่เก็บสินค้าที่เป็นของเหลวและก๊าซ รวมทั้งน้ำมันและผลิตภัณฑ์น้ำมัน เหล้าองุ่นและสิ่งที่คล้ายกัน รวมถึงกิจกรรมที่พักสินค้าจากต่างประเทศ กิจกรรมเขตปลอดภาษีและฟรีโซน และคลังสินค้าทัณฑ์บน การบริการจัดเก็บสินค้าและสถานที่เก็บสินค้าประเภทอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "52211",
                BusinessName = "กิจกรรมการบริการสำหรับการขนส่งทางรถไฟ",
                InfoTitle = "กิจกรรมการบริการสำหรับการขนส่งทางรถไฟ",
                InfoMessage = "การบริการดันและลากรถไฟ เช่น การเคลื่อนย้ายตู้รถไฟในบริเวณสถานที่เก็บรถไฟ การสับรางและการตัดหรือต่อขบวนรถไฟ การดำเนินงานเกี่ยวกับสิ่งอำนวยความสะดวกของสถานีรถไฟ เช่น การขายบัตรโดยสาร การสำรองที่นั่ง การบริการดูแลสัมภาระและกระเป๋าเดินทาง การบริการรับฝากสัมภาระและ กระเป๋าเดินทาง สถานีขนถ่ายสินค้า การดำเนินงานเกี่ยวกับโครงสร้างพื้นฐาน ทางรถไฟ กิจกรรมการบริการอื่น ๆ ที่เกี่ยวข้องกับการขนส่งทางรถไฟ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "52212",
                BusinessName = "กิจกรรมการบริการสถานีรถโดยสาร",
                InfoTitle = "กิจกรรมการบริการสถานีรถโดยสาร",
                InfoMessage = "การดำเนินงานเกี่ยวกับสิ่งอำนวยความสะดวกของสถานีรถโดยสาร เช่น การขายบัตรโดยสาร การสำรองที่นั่ง การบริการดูแลสัมภาระและกระเป๋าเดินทาง การบริการรับฝากสัมภาระและกระเป๋าเดินทาง สถานีขนถ่ายสินค้า",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "52213",
                BusinessName = "กิจกรรมการบริการสถานที่จอดยานพาหนะ",
                InfoTitle = "กิจกรรมการบริการสถานที่จอดยานพาหนะ",
                InfoMessage = "การบริการสถานที่จอดยานพาหนะ (ยานยนต์ จักรยานยนต์และจักรยาน) ที่ดำเนินงานโดยลานจอดรถและโรงรถ ไม่ว่าจะมีหลังคาหรือไม่ก็ตาม สถานที่จอดยานพาหนะบนถนนและสถานที่สาธารณะที่ต้องจ่ายค่าบริการ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "52214",
                BusinessName = "กิจกรรมการบริการรถยก",
                InfoTitle = "กิจกรรมการบริการรถยก",
                InfoMessage = "การบริการรถยก รวมถึงการบริการลากรถออกจากถนน",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "52219",
                BusinessName = "กิจกรรมการบริการอื่นๆที่สนับสนุนการขนส่งทางบก ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "กิจกรรมการบริการอื่นๆที่สนับสนุนการขนส่งทางบก ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "การดำเนินงานเกี่ยวกับถนน ทางยกระดับ สะพานและอุโมงค์ การเปลี่ยนก๊าซธรรมชาติให้เป็นของเหลวและจากของเหลวให้กลับเป็นก๊าซ เพื่อวัตถุประสงค์ในการขนส่ง ที่ไม่ได้กระทำในสถานที่ผลิต",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "52221",
                BusinessName = "กิจกรรมการดำเนินงานเกี่ยวกับสิ่งอำนวยความสะดวกของท่าเรือ (ยกเว้นการขนถ่ายสินค้า)",
                InfoTitle = "กิจกรรมการดำเนินงานเกี่ยวกับสิ่งอำนวยความสะดวกของท่าเรือ (ยกเว้นการขนถ่ายสินค้า)",
                InfoMessage = "การดำเนินงานเกี่ยวกับสิ่งอำนวยความสะดวกของท่าเรือ เช่น ท่าเทียบเรือ และเขตท่าเรือ อู่เรือ สะพานเทียบเรือ และการบริการอื่น ๆ ที่เกี่ยวข้องกับสิ่งอำนวยความสะดวกของท่าเรือ การดำเนินงานเกี่ยวกับประภาคาร ทุ่น และทุ่นไฟ การดำเนินงานและการบำรุงรักษาคูคลอง แม่น้ำและทางน้ำอื่น ๆ การบริการของประตูกั้นน้ำ เขื่อนกั้นนํ้า ประตูระบายน้ำ การบริการลากเรือในคลองด้วยเครื่องมืออื่นนอกจากเรือลาก เช่น โดยแทรกเตอร์ หรือหัวรถจักรที่ลากเรือไปตามเส้นทาง",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "52229",
                BusinessName = "กิจกรรมการบริการต่าง ๆ สำหรับการขนส่งทางน้ำ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "กิจกรรมการบริการต่าง ๆ สำหรับการขนส่งทางน้ำ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "การบริการนำร่อง รวมถึงการบริการเรือนำร่อง การบริการเรือลาก การช่วยเหลือ กู้ภัยเรือ การบริการลากเรือที่ประสบภัยพิบัติและที่จมอยู่ใต้น้ำ รวมทั้ง การทำให้เรือที่อยู่ในสภาพที่เสียหายสามารถกลับมาใช้งานได้กิจกรรมการบริการที่สนับสนุนการขนส่งทางน้ำ ที่เกี่ยวข้องโดยตรงกับการดำเนินการของเรือหรือไม่ก็ตาม ซึ่งมิได้จัดประเภทไว้ในที่อื่น เช่น บริการทำให้น้ำแข็งแตก บริการจอดเรือชั่วคราวและจัดเก็บเรือ ฯลฯ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "52231",
                BusinessName = "กิจกรรมการดำเนินงานของสนามบิน (ยกเว้นการขนถ่ายสินค้า)",
                InfoTitle = "กิจกรรมการดำเนินงานของสนามบิน (ยกเว้นการขนถ่ายสินค้า)",
                InfoMessage = "กิจกรรมต่าง ๆ ที่เกี่ยวเนื่องกับการขนส่งผู้โดยสาร สัตว์ หรือสินค้าทางอากาศ การดำเนินงานเกี่ยวกับสิ่งอำนวยความสะดวกของอาคารผู้โดยสารและอาคาร สินค้าสนามบิน (อาคารภายในสนามบิน) การดำเนินงานของสนามบิน บริการภาคพื้น",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "52239",
                BusinessName = "กิจกรรมการบริการอื่นๆที่สนับสนุนการขนส่งทางอากาศซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "กิจกรรมการบริการอื่นๆที่สนับสนุนการขนส่งทางอากาศซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "การดำเนินงานของหอควบคุมการบิน การควบคุมการจราจรทางอากาศ การบริการที่ดำเนินงานโดยสถานีเรดาร์ที่ทำการระบุที่ตั้งของสนามบิน การบริการดับเพลิงและการป้องกันเพลิงที่สนามบิน การบริการโรงเก็บเครื่องบิน และการบำรุงรักษาทั่วไป (ยกเว้น การซ่อมแซม) การบริการลากเครื่องบิน กิจกรรม การบริการอื่น ๆ ที่สนับสนุนการขนส่งทางอวกาศ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "52241",
                BusinessName = "การขนถ่ายสินค้า",
                InfoTitle = "การขนถ่ายสินค้า",
                InfoMessage = "การลำเลียงสินค้าทั้งขึ้นและลงยานพาหนะขนส่งโดยไม่คำนึงถึงรูปแบบการขนส่ง การขนถ่ายสินค้าที่บรรจุในตู้คอนเทนเนอร์ และไม่ได้บรรจุในตู้คอนเทนเนอร์ และการขนถ่ายสินค้าออกจากเรือ โดยที่กิจกรรมดังกล่าวดำเนินงานที่ท่าเรือ สถานีรถไฟ ท่าอากาศยาน",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "52242",
                BusinessName = "การขนถ่ายสัมภาระ",
                InfoTitle = "การขนถ่ายสัมภาระ",
                InfoMessage = "การลำเลียงสัมภาระของผู้โดยสารทั้งขึ้นและลงยานพาหนะขนส่งโดยไม่คำนึงถึงรูปแบบการขนส่ง การขนถ่ายกระเป๋าเดินทางที่ท่าอากาศยาน สถานีรถโดยสาร สถานีรถไฟหรือสถานีปลายทางบนทางหลวง",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "52291",
                BusinessName = "กิจกรรมการบริหารจัดการด้านการขนส่งและสถานที่เก็บสินค้า",
                InfoTitle = "กิจกรรมการบริหารจัดการด้านการขนส่งและสถานที่เก็บสินค้า",
                InfoMessage = "กิจกรรมโลจิสติกส์ ได้แก่ การวางแผน การออกแบบและการจัดการสนับสนุนอื่น ๆ ด้านการขนส่ง การจัดเก็บสินค้าและการกระจายสินค้า การออกเอกสาร และการจัดหาเอกสารเกี่ยวกับการขนส่งและเอกสารเกี่ยวกับรายการสินค้าที่ขนส่ง รวมทั้งการขนถ่ายสินค้า เช่น การบรรจุสินค้าลงกล่องชั่วคราวเพื่อป้องกันสินค้าเสียหายระหว่างการขนส่ง",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "52292",
                BusinessName = "กิจกรรมของตัวแทนผู้รับจัดการขนส่งสินค้าและตัวแทนออกของ (ตัวแทนดำเนินพิธีการศุลกากร)",
                InfoTitle = "กิจกรรมของตัวแทนผู้รับจัดการขนส่งสินค้าและตัวแทนออกของ (ตัวแทนดำเนินพิธีการศุลกากร)",
                InfoMessage = "กิจกรรมตัวแทนผู้รับจัดการขนส่งสินค้า ทั้งทางน้ำและทางอากาศ ซึ่งอาจทำหน้าที่หลายอย่าง เช่น เป็นตัวแทนในการจัดหาและจัดการขนส่งสินค้าของผู้ส่งออกไปยังเมืองท่าปลายทาง เป็นตัวกลางระหว่างผู้ส่งสินค้า เป็นผู้ขนส่งสินค้าโดยตรงและบริการรวบรวมสินค้า ซึ่งอาจเป็นผู้ประกอบการขนส่งสินค้าหลายรูปแบบ กิจกรรมของตัวแทนออกของ/ตัวแทนดำเนินพิธีการศุลกากร โดยทำหน้าที่เป็นตัวแทนของผู้นำเข้าและผู้ส่งออกในการดำเนินพิธีการศุลกากร จัดทำใบขนสินค้า ยื่นใบขนสินค้าต่อเจ้าพนักงานศุลกากร ณ ด่านศุลกากรและส่งมอบสินค้าที่นำเข้าจากต่างประเทศให้แก่ผู้นำเข้า หรือส่งสินค้าออกนอกราชอาณาจักร เพื่อส่งไปต่างประเทศให้แก่ผู้ส่งออก",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "52293",
                BusinessName = "กิจกรรมบริการบรรจุหีบห่อเพื่อการขนส่ง",
                InfoTitle = "กิจกรรมบริการบรรจุหีบห่อเพื่อการขนส่ง",
                InfoMessage = "การบริการบรรจุหีบห่อและบรรจุสินค้าลงกล่องชั่วคราว ที่มีวัตถุประสงค์เพื่อการป้องกันสินค้าเสียหายระหว่างการขนส่ง",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "52299",
                BusinessName = "กิจกรรมอื่น ๆ ที่สนับสนุนการขนส่งซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "กิจกรรมอื่น ๆ ที่สนับสนุนการขนส่งซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "การบริการตรวจสอบสินค้า การชั่งน้ำหนักสินค้าและการสุ่มตัวอย่างสินค้า การบริการวิทยุบอกตำแหน่ง เช่น บริการ GPS",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "53100",
                BusinessName = "กิจกรรมไปรษณีย์",
                InfoTitle = "กิจกรรมไปรษณีย์",
                InfoMessage = "กิจกรรมการให้บริการไปรษณีย์ ที่ดำเนินงานในลักษณะการให้บริการไปรษณีย์พื้นฐานอย่างทั่วถึง ซึ่งประกอบด้วยการใช้โครงสร้างพื้นฐานสำหรับการให้บริการไปรษณีย์พื้นฐานอย่างทั่วถึง ได้แก่ ที่ทำการไปรษณีย์ ศูนย์คัดแยกและปฏิบัติการและสายการขนส่งเพื่อการรับฝากและนำจ่ายสิ่งของส่งทางไปรษณีย์ ประเภทของสิ่งที่นำจ่ายประกอบด้วยไปรษณียภัณฑ์ ได้แก่ จดหมาย ไปรษณียบัตร ของตีพิมพ์ (หนังสือพิมพ์ วารสาร แผ่นโฆษณาต่าง ๆ ฯลฯ) พัสดุย่อย สินค้าหรือเอกสารและรวมถึงบริการอื่น ๆ ที่จำเป็น เพื่อสนับสนุนการให้บริการไปรษณีย์พื้นฐานอย่างทั่วถึง รวมถึงการรับฝาก การคัดแยก การขนส่งและการนำจ่ายไปรษณียภัณฑ์ พัสดุไปรษณีย์ และพัสดุภัณฑ์ ทั้งภายในและระหว่างประเทศโดยการไปรษณีย์ ซึ่งเป็นผู้รับภาระผูกพันในการให้บริการไปรษณีย์พื้นฐานอย่างทั่วถึง ทั้งนี้ การเก็บรวบรวมไปรษณียภัณฑ์ และพัสดุไปรษณีย์จากตู้ไปรษณีย์ หรือจากที่ทำการไปรษณีย์ รวมทั้งการส่งต่อ และนำจ่ายไปรษณียภัณฑ์และพัสดุไปรษณีย์ อาจใช้รูปแบบการขนส่งหนึ่งรูปแบบหรือมากกว่า และอาจดำเนินการโดยใช้เครือข่ายขนส่งของตนเอง (เอกชน) หรือบริการขนส่งสาธารณะ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Logistics,
                TSIC = "53200",
                BusinessName = "กิจกรรมการรับส่งเอกสาร/สิ่งของ",
                InfoTitle = "กิจกรรมการรับส่งเอกสาร/สิ่งของ",
                InfoMessage = "กิจกรรมการรับส่งเอกสาร/สิ่งของ ที่ดำเนินการอยู่นอกเหนือพันธะการให้บริการไปรษณีย์พื้นฐานอย่างทั่วถึง รวมถึงการรับฝาก การคัดแยก การขนส่งและการนำจ่ายไปรษณียภัณฑ์ พัสดุไปรษณีย์ และพัสดุภัณฑ์ (ทั้งภายในและระหว่างประเทศ) โดยผู้ให้บริการ ซึ่งไม่มีภาระผูกพันในการให้บริการไปรษณีย์พื้นฐานอย่างทั่วถึง การส่งต่อ และนำจ่ายไปรษณียภัณฑ์และพัสดุภัณฑ์อาจใช้รูปแบบการขนส่งหนึ่งรูปแบบ หรือมากกว่าและอาจดำเนินการโดยใช้เครือข่ายขนส่งของตนเอง (เอกชน) หรือบริการขนส่งสาธารณะ รวมถึงบริการนำจ่ายเอกสาร/สิ่งของตามบ้าน",
            });

            return model;
        }

        private static List<DBDBusinessModel> AddMedicTool() 
        {
            List<DBDBusinessModel> model = new List<DBDBusinessModel>();

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.MedicTool,
                TSIC = "47731",
                BusinessName = "ร้านขายปลีกนาฬิกาแว่นตาและอุปกรณ์ถ่ายภาพ",
                InfoTitle = "ร้านขายปลีกนาฬิกาแว่นตาและอุปกรณ์ถ่ายภาพ",
                InfoMessage = "ร้านขายปลีกนาฬิกา สายนาฬิกา อุปกรณ์เกี่ยวกับสายตา เครื่องมือตรวจวัดความชัดเจนของสายตา เครื่องมือจักษุแพทย์ ร้านขายปลีกอุปกรณ์ถ่ายภาพ เช่น อุปกรณ์ถ่ายภาพ (ยกเว้น กล้องดิจิทัล) เพลตและฟิล์ม รวมถึงการซ่อมนาฬิกาด้วย หากการซ่อมนั้นเกี่ยวเนื่องกับการค้าปลีกสินค้าดังกล่าว",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.MedicTool,
                TSIC = "46441",
                BusinessName = "การขายส่งสินค้าทางเภสัชภัณฑ์และทางการแพทย์",
                InfoTitle = "การขายส่งสินค้าทางเภสัชภัณฑ์และทางการแพทย์",
                InfoMessage = "การขายส่งสินค้าทางเภสัชภัณฑ์ทั้งชนิดเคมีภัณฑ์ ยา และสมุนไพร เครื่องเทศที่ใช้ทำยาไทยแผนโบราณ และทางการแพทย์ เช่น ของที่ใช้แต่งแผลที่มีสารยึดติด ชุดปฐมพยาบาล ผลิตภัณฑ์เคมีที่ใช้ภายนอกสำหรับคุมกำเนิด ฯลฯ การขายส่งอุปกรณ์และเครื่องมือเครื่องใช้ทางการแพทย์",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.MedicTool,
                TSIC = "47721",
                BusinessName = "ร้านขายปลีกสินค้าทางเภสัชภัณฑ์และเวชภัณฑ์",
                InfoTitle = "ร้านขายปลีกสินค้าทางเภสัชภัณฑ์และเวชภัณฑ์",
                InfoMessage = "การขายปลีกยารักษาโรค ผลิตภัณฑ์ยาอื่น ๆ รวมถึงการขายปลีกสมุนไพรและเครื่องเทศที่ใช้ทำยาไทยแผนโบราณ และอุปกรณ์ทางการแพทย์ และผลิตภัณฑ์เสริมอาหาร",
            });

            return model;
        }

        private static List<DBDBusinessModel> AddPatientService()
        {
            List<DBDBusinessModel> model = new List<DBDBusinessModel>();
      
            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.PatientService,
                TSIC = "86101",
                BusinessName = "กิจกรรมโรงพยาบาล",
                InfoTitle = "กิจกรรมโรงพยาบาล",
                InfoMessage = "กิจกรรมการดูแลสุขภาพระยะสั้นหรือระยะยาวในโรงพยาบาล ประกอบด้วย กิจกรรมด้านการแพทย์ การวินิจฉัยและการรักษาโรคทั่วไป เช่น โรงพยาบาล ชุมชน โรงพยาบาลทั่วไป โรงพยาบาลศูนย์ โรงพยาบาลหรือศูนย์บริการสุขภาพที่ไม่หวังผลกำไร โรงพยาบาลที่เป็นโรงเรียนแพทย์ โรงพยาบาลกองทัพ โรงพยาบาลในเรือนจำ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.PatientService,
                TSIC = "86102",
                BusinessName = "กิจกรรมโรงพยาบาลเฉพาะทาง",
                InfoTitle = "กิจกรรมโรงพยาบาลเฉพาะทาง",
                InfoMessage = "กิจกรรมการดูแลสุขภาพระยะสั้นหรือระยะยาวในโรงพยาบาล ประกอบด้วย กิจกรรมด้านการแพทย์ การวินิจฉัยและการรักษาโรคเฉพาะทาง เช่น โรงพยาบาลจิตเวช โรงพยาบาลเพื่อผู้ป่วยที่ใช้สารเสพติด โรงพยาบาลโรคติดต่อโรงพยาบาลแม่และเด็ก สถานบำบัดผู้ป่วยเรื้อรังเฉพาะทาง",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.PatientService,
                TSIC = "86201",
                BusinessName = "กิจกรรมคลินิกโรคทั่วไป",
                InfoTitle = "กิจกรรมคลินิกโรคทั่วไป",
                InfoMessage = "การให้คำปรึกษาและการรักษาโรคทั่วไปทางการแพทย์ โดยแพทย์เวชปฏิบัติที่มีบริการทางการแพทย์ที่ไม่ได้จัดให้มีที่นอนพักรักษา กิจกรรมเหล่านี้สามารถดำเนินการได้โดยภาคเอกชน กลุ่มองค์กรดำเนินการต่าง ๆ คลินิกผู้ป่วยนอก และในโรงพยาบาล หรือคลินิกในสถานที่ทำงาน ในโรงเรียน บ้านพักผู้สูงอายุ องค์กรด้านแรงงาน มูลนิธิต่าง ๆ ตลอดจนบ้านของผู้ป่วยเอง และบริการให้คำปรึกษาส่วนบุคคลสำหรับผู้ป่วยใน",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.PatientService,
                TSIC = "86202",
                BusinessName = "กิจกรรมคลินิกโรคเฉพาะทาง",
                InfoTitle = "กิจกรรมคลินิกโรคเฉพาะทาง",
                InfoMessage = "การให้คำปรึกษาและการรักษาโรคเฉพาะทาง โดยแพทย์เฉพาะทาง รวมทั้ง ศูนย์วางแผนครอบครัวที่มีบริการทางการแพทย์ที่ไม่ได้จัดที่พักรักษา เช่น การทำหมันและการยุติการตั้งครรภ์ กิจกรรมเหล่านี้สามารถดำเนินการได้โดยภาคเอกชน กลุ่มองค์กรดำเนินการต่าง ๆ คลินิกผู้ป่วยนอกและในโรงพยาบาล หรือคลินิกในสถานที่ทำงาน ในโรงเรียน บ้านพักผู้สูงอายุ องค์กรด้านแรงงาน มูลนิธิต่าง ๆ ตลอดจนบ้านของผู้ป่วยเองและบริการให้คำปรึกษาส่วนบุคคลสำหรับผู้ป่วยใน",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.PatientService,
                TSIC = "86203",
                BusinessName = "กิจกรรมทางทันตกรรม",
                InfoTitle = "กิจกรรมทางทันตกรรม",
                InfoMessage = "กิจกรรมต่าง ๆ ทางทันตกรรมของทันตแพทย์พื้นฐานและทันตแพทย์เฉพาะทาง เช่น อุดฟัน ถอนฟัน รักษารากฟัน ทันตกรรมในเด็ก โรคในช่องปาก การจัดฟัน ฯลฯ กิจกรรมเหล่านี้สามารถดำเนินการได้โดยภาคเอกชน กลุ่มองค์กรดำเนินการต่าง ๆ คลินิกผู้ป่วยนอกและในโรงพยาบาล หรือคลินิกในสถานที่ทำงานในโรงเรียน บ้านพักผู้ชรา รวมทั้งกิจกรรมด้านทันตกรรมในห้องผ่าตัด",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.PatientService,
                TSIC = "86901",
                BusinessName = "กิจกรรมด้านการพยาบาลและผดุงครรภ์",
                InfoTitle = "กิจกรรมด้านการพยาบาลและผดุงครรภ์",
                InfoMessage = "กิจกรรมด้านสุขภาพอนามัยที่ปฏิบัติโดยบุคลากรที่ไม่ใช่แพทย์ในโรงพยาบาล ได้แก่ พยาบาล นางผดุงครรภ์ กิจกรรมเหล่านี้สามารถดำเนินการได้ในคลินิกสุขภาพที่มีอยู่ในสถานที่ทำงาน ในโรงเรียน บ้านพักผู้สูงอายุ องค์กรด้านแรงงานและมูลนิธิต่าง ๆ และในสถานบริการสุขภาพอื่น ๆ ในชุมชนที่ไม่ใช่โรงพยาบาล ตลอดจนในสถานที่ให้คำปรึกษาส่วนบุคคล บ้านของผู้ป่วยหรือที่อื่น ๆ กิจกรรมเหล่านี้ไม่เกี่ยวข้องกับการรักษาทางการแพทย์",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.PatientService,
                TSIC = "86902",
                BusinessName = "กิจกรรมด้านกายภาพบำบัด",
                InfoTitle = "กิจกรรมด้านกายภาพบำบัด",
                InfoMessage = "กิจกรรมด้านสุขภาพที่ปฏิบัติโดยนักกายภาพบำบัด การบำบัดแบบเออร์โกเธอราพีการบำบัดแบบไคโรแพรคติค ฯลฯ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.PatientService,
                TSIC = "86909",
                BusinessName = "กิจกรรมอื่น ๆ ด้านสุขภาพของมนุษย์ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "กิจกรรมอื่น ๆ ด้านสุขภาพของมนุษย์ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "กิจกรรมด้านสุขอนามัยที่ดำเนินงานโดยบุคลากรที่ไม่ใช่แพทย์และทันตแพทย์ในโรงพยาบาล ได้แก่ บุคลากรทางการแพทย์อื่น ๆ ที่นอกเหนือจากพยาบาล นางผดุงครรภ์และนักกายภาพบำบัด ในด้านตรวจวัดสายตา ธาราบำบัด การนวดทางการแพทย์ อาชีวบำบัด อรรถบำบัด การดูแลมือและเท้า การรักษาทางยาสามัญ การบำบัดอาการปวดหลังและการฝังเข็ม ฯลฯ กิจกรรมเหล่านี้สามารถดำเนินการได้ในคลีนิกสุขภาพที่มีอยู่ในสถานที่ทำงาน ในโรงเรียน บ้านพักผู้สูงอายุ องค์กรด้านแรงงานและมูลนิธิต่าง ๆ และในสถานบริการสุขภาพอื่น ๆ ในชุมชนที่ไม่ใช่โรงพยาบาล ตลอดจนในสถานที่ให้คำปรึกษาส่วนบุคคล บ้านของผู้ป่วยหรือที่อื่น ๆ กิจกรรมเหล่านี้ไม่เกี่ยวข้องกับการรักษาทางการแพทย์ กิจกรรมของบุคลากรด้านทันตกรรมอื่น ๆ เช่น นักทันตกรรมบำบัด พยาบาลทันตอนามัยประจำโรงเรียน ผู้ดูแลสุขภาพช่องปากที่ทำงานห่างไกลตัวเมือง แต่ต้องได้รับการควบคุมโดยทันตแพทย์เป็นระยะ ๆ การเคลื่อนย้ายผู้ป่วยด้วยรถพยาบาล รวมทั้งทางเครื่องบินในรายฉุกเฉิน กิจกรรมของธนาคารเลือด ธนาคารอสุจิ ธนาคารเก็บอวัยวะบริจาค รวมถึง การนวดเพื่อการบำบัดโรค",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.PatientService,
                TSIC = "87100",
                BusinessName = "หน่วยบริการทางการพยาบาลที่จัดที่พักให้",
                InfoTitle = "หน่วยบริการทางการพยาบาลที่จัดที่พักให้",
                InfoMessage = "สถานที่พักสำหรับผู้สูงอายุพร้อมให้บริการการพยาบาล สถานที่พักฟื้นผู้ป่วยเรื้อรัง บ้านพักผ่อนพร้อมให้บริการการพยาบาล หน่วยบริการการพยาบาลต่าง ๆ และบ้านพักรักษาผู้ป่วย",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.PatientService,
                TSIC = "87201",
                BusinessName = "กิจกรรมการดูแลรักษาในสถานที่ที่มีที่พักและมีคนดูแลประจำ สำหรับผู้พิการทางสมอง",
                InfoTitle = "กิจกรรมการดูแลรักษาในสถานที่ที่มีที่พักและมีคนดูแลประจำ สำหรับผู้พิการทางสมอง",
                InfoMessage = "กิจกรรมการดูแลรักษาในสถานที่ที่มีที่พักและมีคนดูแลประจำ (ที่ไม่ใช่การดูแลในโรงพยาบาล) สำหรับประชาชนที่พิการทางสมอง บริการที่จัดให้ ได้แก่ การจัดห้องพัก บ้านพักประจำ การดูแลเฝ้าระวัง ให้คำปรึกษาและดูแลสุขภาพบางส่วนร่วมด้วย กิจกรรมของผู้มีปัญหาพิการทางสมอง",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.PatientService,
                TSIC = "87202",
                BusinessName = "กิจกรรมการดูแลรักษาในสถานที่ที่มีที่พักและมีคนดูแลประจำ สำหรับผู้มีปัญหาสุขภาพจิต",
                InfoTitle = "กิจกรรมการดูแลรักษาในสถานที่ที่มีที่พักและมีคนดูแลประจำ สำหรับผู้มีปัญหาสุขภาพจิต",
                InfoMessage = "กิจกรรมการดูแลรักษาในสถานที่ที่มีที่พักและมีคนดูแลประจำ (ที่ไม่ใช่การดูแลในโรงพยาบาล) สำหรับประชาชนที่มีอาการป่วยทางจิตหรือมีปัญหาทางอารมณ์บริการที่จัดให้ ได้แก่ การจัดห้องพัก บ้านพักประจำ การดูแลเฝ้าระวังให้คำปรึกษาและดูแลสุขภาพบางส่วนร่วมด้วย กิจกรรมผู้มีปัญหาทางจิต และอารมณ์และกิจกรรมบ้านพักกึ่งวิถีของผู้มีปัญหาสุขภาพจิต เช่น บ้านพักฟื้นสำหรับผู้มีปัญหาด้านสุขภาพจิต บ้านพักฟื้นสำหรับผู้มีปัญหาทางอารมณ์สถานสงเคราะห์บ้านกึ่งวิถีที่ดูแลด้านสุขภาพจิต",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.PatientService,
                TSIC = "87203",
                BusinessName = "กิจกรรมการดูแลรักษาในสถานที่ที่มีที่พักและมีคนดูแลประจำ สำหรับผู้ใช้สารเสพติด",
                InfoTitle = "กิจกรรมการดูแลรักษาในสถานที่ที่มีที่พักและมีคนดูแลประจำ สำหรับผู้ใช้สารเสพติด",
                InfoMessage = "กิจกรรมการดูแลรักษาในสถานที่ที่มีที่พักและมีคนดูแลประจำ (ที่ไม่ใช่การดูแลในโรงพยาบาล) สำหรับประชาชนผู้ใช้สารเสพติด บริการที่จัดให้ ได้แก่ การจัดห้องพัก บ้านพักประจำ การดูแลเฝ้าระวัง ให้คำปรึกษาและดูแลสุขภาพบางส่วนร่วมด้วย กิจกรรมการรักษาผู้ป่วยที่มีปัญหาติดเหล้าและยาเสพติด",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.PatientService,
                TSIC = "87301",
                BusinessName = "กิจกรรมการดูแลรักษาในสถานที่ที่มีที่พักและมีคนดูแลประจำ สำหรับผู้สูงอายุ",
                InfoTitle = "กิจกรรมการดูแลรักษาในสถานที่ที่มีที่พักและมีคนดูแลประจำ สำหรับผู้สูงอายุ",
                InfoMessage = "กิจกรรมการดูแลรักษาในสถานที่ที่มีที่พักและมีคนดูแลประจำสำหรับผู้สูงอายุ รวมถึงกิจกรรมการดูแลอย่างต่อเนื่องแก่ชุมชนผู้เกษียณอายุและบ้านพักสำหรับผู้สูงอายุที่ต้องให้บริการพยาบาลเล็กน้อย บ้านพักที่ไม่มีการให้บริการการพยาบาลใด ๆ การดูแลรวมถึงการจัดห้องพัก บ้านพักประจำ การดูแลเฝ้าระวังและการช่วยเหลือกิจวัตรประจำวัน เช่น งานบ้าน ในบางกรณีหน่วยบริการนี้ยังจัดบริการการพยาบาลจากพยาบาลที่เชี่ยวชาญสำหรับผู้พักอาศัยที่ต้องการบริเวณที่พัก กิจกรรมต่าง ๆ เหล่านี้ได้แก่ การให้ความช่วยเหลือในเรื่องกิจวัตรประจำวัน",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.PatientService,
                TSIC = "87302",
                BusinessName = "กิจกรรมการดูแลรักษาในสถานที่ที่มีที่พักและมีคนดูแลประจำ สำหรับเด็กและเยาวชนพิการ",
                InfoTitle = "กิจกรรมการดูแลรักษาในสถานที่ที่มีที่พักและมีคนดูแลประจำ สำหรับเด็กและเยาวชนพิการ",
                InfoMessage = "กิจกรรมการดูแลรักษาในสถานที่ที่มีที่พักและมีคนดูแลประจำสำหรับเด็กและเยาวชนพิการ เช่น คนตาบอด คนหูหนวกและคนใบ้ ฯลฯ การดูแลรวมถึงการจัดห้องพัก บ้านพักประจำ การดูแลเฝ้าระวังและการช่วยเหลือกิจวัตรประจำวัน เช่น งานบ้าน ในบางกรณีหน่วยบริการนี้ยังจัดบริการการพยาบาลจากพยาบาลที่เชี่ยวชาญสำหรับผู้พักอาศัยที่ต้องการบริเวณที่พัก กิจกรรมต่าง ๆ เหล่านี้ได้แก่ การให้ความช่วยเหลือในเรื่องกิจวัตรประจำวัน",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.PatientService,
                TSIC = "87303",
                BusinessName = "กิจกรรมการดูแลรักษาในสถานที่ที่มีที่พักและมีคนดูแลประจำสำหรับผู้พิการ",
                InfoTitle = "กิจกรรมการดูแลรักษาในสถานที่ที่มีที่พักและมีคนดูแลประจำสำหรับผู้พิการ",
                InfoMessage = "กิจกรรมการดูแลรักษาในสถานที่ที่มีที่พักและมีคนดูแลประจำ เช่น คนตาบอด คนหูหนวกและคนใบ้ ฯลฯ การดูแลรวมถึงการจัดห้องพัก บ้านพักประจำ การดูแลเฝ้าระวังและการช่วยเหลือกิจวัตรประจำวัน เช่น งานบ้านในบางกรณีหน่วยบริการนี้ยังจัดบริการพยาบาลจากพยาบาลที่เชี่ยวชาญสำหรับผู้พักอาศัยที่ต้องการบริเวณที่พัก กิจกรรมต่างๆ เหล่านี้ ได้แก่ การให้ความช่วยเหลือในชีวิตประจำวัน",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.PatientService,
                TSIC = "87901",
                BusinessName = "กิจกรรมการดูแลรักษาในสถานที่ที่มีที่พักและมีคนดูแลประจำ สำหรับเด็กและเยาวชน (ยกเว้น ผู้พิการซึ่งไม่สามารถช่วยเหลือตนเองได้ทั้งหมด หรือผู้ที่ไม่สามารถอยู่ตามลำพังได้และผู้ใช้สารเสพติด)",
                InfoTitle = "กิจกรรมการดูแลรักษาในสถานที่ที่มีที่พักและมีคนดูแลประจำ สำหรับเด็กและเยาวชน (ยกเว้น ผู้พิการซึ่งไม่สามารถช่วยเหลือตนเองได้ทั้งหมด หรือผู้ที่ไม่สามารถอยู่ตามลำพังได้และผู้ใช้สารเสพติด)",
                InfoMessage = "กิจกรรมการดูแลรักษาในสถานที่มีคนดูแลประจำสำหรับเด็กและเยาวชน โดยการจัดหาที่พักอาศัยและบริการส่วนบุคคล กิจกรรมต่าง ๆ เหล่านี้ได้แก่ กิจกรรมซึ่งจัดให้มีการดูแลสงเคราะห์เด็กตลอด 24 ชั่วโมง และกลุ่มเด็กที่มีความสามารถจำกัดในการดูแลตนเอง โดยเด็กกลุ่มดังกล่าวไม่เน้นการรักษาทางการแพทย์หรือการให้การศึกษา ได้แก่ บ้านเด็กกำพร้า หอพักเด็กและบ้านพักชั่วคราว",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.PatientService,
                TSIC = "87902",
                BusinessName = "กิจกรรมการดูแลรักษาในสถานที่ที่มีที่พักและมีคนดูแลประจำสำหรับหญิงที่ประสบปัญหาทางสังคม",
                InfoTitle = "กิจกรรมการดูแลรักษาในสถานที่ที่มีที่พักและมีคนดูแลประจำสำหรับหญิงที่ประสบปัญหาทางสังคม",
                InfoMessage = "กิจกรรมการดูแลรักษาในสถานที่ที่มีที่พักและมีคนดูแลประจำสำหรับหญิงที่ประสบปัญหาครอบครัว ถูกล่วงละเมิดทางเพศ ถูกทำร้ายร่างกายและจิตใจและประสบปัญหาทางสังคมอื่นๆ โดยการจัดที่พักอาศัยและบริการดูแลส่วนบุคคล เช่น สถานที่พักพิงสำหรับหญิงที่ถูกทารุณกรรม สถานดูแลมารดาที่ไม่ได้สมรสและบุตรที่เกิดมา ฯลฯ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.PatientService,
                TSIC = "87909",
                BusinessName = "กิจกรรมการดูแลรักษาในสถานที่ที่มีที่พักและมีคนดูแลประจำ สำหรับบุคคลอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "กิจกรรมการดูแลรักษาในสถานที่ที่มีที่พักและมีคนดูแลประจำ สำหรับบุคคลอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "กิจกรรมการดูแลรักษาในสถานที่ที่มีคนดูแลประจำสำหรับบุคคลอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น โดยการจัดที่พักอาศัยและบริการส่วนบุคคล กิจกรรมให้การดูแลและความช่วยเหลือแก่ผู้กระทำผิดกฎหมายและกระทำล่วงละเมิดทางเพศ การให้ที่พักพิงสำหรับผู้กระทำผิดวินัย",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.PatientService,
                TSIC = "88101",
                BusinessName = "กิจกรรมสังคมสงเคราะห์โดยไม่มีที่พักอาศัยสำหรับผู้สูงอายุ",
                InfoTitle = "กิจกรรมสังคมสงเคราะห์โดยไม่มีที่พักอาศัยสำหรับผู้สูงอายุ",
                InfoMessage = "กิจกรรมสังคมสงเคราะห์โดยไม่มีที่พักอาศัยสำหรับผู้สูงอายุในเวลากลางวันงานสังคม การให้คำปรึกษา งานสวัสดิการ การบริการส่งต่อหรือบริการที่คล้ายกัน สำหรับผู้สูงอายุในบ้านและที่อื่น ๆ ซึ่งดำเนินการโดยรัฐบาลหรือองค์กรเอกชน องค์กรแห่งชาติหรือกลุ่มในท้องถิ่นที่ช่วยกันเองและการจัดให้มีผู้เชี่ยวชาญให้คำปรึกษาไว้บริการ ได้แก่ การออกเยี่ยมผู้สูงอายุ กิจกรรมดูแลในเวลากลางวันสำหรับผู้สูงอายุ กิจกรรมฝึกอาชีพ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.PatientService,
                TSIC = "88102",
                BusinessName = "กิจกรรมสังคมสงเคราะห์โดยไม่มีที่พักอาศัยสำหรับผู้พิการ",
                InfoTitle = "กิจกรรมสังคมสงเคราะห์โดยไม่มีที่พักอาศัยสำหรับผู้พิการ",
                InfoMessage = "กิจกรรมสังคมสงเคราะห์โดยไม่มีที่พักอาศัยสำหรับผู้พิการในเวลากลางวันงานสังคม การให้คำปรึกษา งานสวัสดิการ การบริการส่งต่อหรือบริการที่คล้ายกัน สำหรับผู้พิการในบ้านและที่อื่น ๆ ซึ่งดำเนินการโดยรัฐบาลหรือองค์กรเอกชน องค์กรแห่งชาติหรือกลุ่มในท้องถิ่นที่ช่วยกันเองและการจัดให้มีผู้เชี่ยวชาญให้คำปรึกษาไว้บริการ ได้แก่ การออกเยี่ยมผู้พิการ กิจกรรมบำบัดและกิจกรรมฝึกอาชีพแก่ผู้พิการที่มีข้อจำกัดทางการศึกษา",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.PatientService,
                TSIC = "88901",
                BusinessName = "กิจกรรมการรับเลี้ยงเด็กกลางวัน",
                InfoTitle = "กิจกรรมการรับเลี้ยงเด็กกลางวัน",
                InfoMessage = "การรับเลี้ยงเด็กปกติและเด็กที่มีภาวะทุพพลภาพในเวลากลางวัน เช่น สถานเลี้ยงเด็กเล็กและศูนย์ดูแลเด็กเล็ก",
            });
            
            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.PatientService,
                TSIC = "88909",
                BusinessName = "กิจกรรมงานสังคมสงเคราะห์อื่นๆโดยไม่มีที่พักอาศัยซึ่งมิได้ จัดประเภทไว้ในที่อื่น",
                InfoTitle = "กิจกรรมงานสังคมสงเคราะห์อื่นๆโดยไม่มีที่พักอาศัยซึ่งมิได้ จัดประเภทไว้ในที่อื่น",
                InfoMessage = "งานสังคม การให้คำปรึกษา งานสวัสดิการ ผู้อพยพ งานส่งต่อหรือบริการอื่น ๆ ที่คล้ายกัน ซึ่งจัดให้บุคคลและครอบครัวที่บ้าน ซึ่งดำเนินการโดยรัฐบาลหรือองค์กรเอกชน องค์การบรรเทาทุกข์สาธารณภัยและองค์กรระดับชาติ หรือองค์กรในท้องถิ่นที่ช่วยตนเองได้และโดยการจัดหาผู้เชี่ยวชาญให้บริการให้คำปรึกษา ได้แก่ งานสวัสดิการและกิจกรรมให้คำแนะนำแก่เด็กและวัยรุ่น กิจกรรมของการอุปถัมภ์และการป้องกันการกระทำทารุณต่อเด็กและผู้อื่น การให้คำปรึกษาเรื่องงบประมาณใช้จ่าย การให้คำปรึกษาในการสมรสและการให้คำปรึกษาเรื่องครอบครัว การให้คำปรึกษาด้านสินเชื่อและหนี้สินผู้บริโภค กิจกรรมของชุมชนต่าง ๆ กิจกรรมของเหยื่อภัยพิบัติต่าง ๆ ผู้อพยพ ผู้ลี้ภัย บุคคลไร้สถานะ ตลอดจนที่พักชั่วคราวสำหรับเขาเหล่านั้น กิจกรรมการบำบัดฟื้นฟูฝึกอาชีพสำหรับผู้ไม่มีงานทำแต่มีการศึกษาจำกัด การคัดเลือก การช่วยเหลือทางสวัสดิการตามความเหมาะสมในเรื่องค่าเช่าที่พัก คูปองอาหาร การให้บริการในช่วงเวลากลางวันแก่ผู้ไร้ที่อยู่อาศัยและผู้ที่อ่อนแอ กิจกรรม การกุศลที่รับเงินบริจาค หรือกิจกรรมที่ช่วยเหลืองานสังคมสงเคราะห์",
            });

            return model;
        }

        private static List<DBDBusinessModel> AddCosmeticShortTerm() 
        {
            List<DBDBusinessModel> model = new List<DBDBusinessModel>();

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.CosmeticShortTerm,
                TSIC = "86202",
                BusinessName = "กิจกรรมคลินิกโรคเฉพาะทาง",
                InfoTitle = "กิจกรรมคลินิกโรคเฉพาะทาง",
                InfoMessage = "การให้คำปรึกษาและการรักษาโรคเฉพาะทาง โดยแพทย์เฉพาะทาง รวมทั้ง ศูนย์วางแผนครอบครัวที่มีบริการทางการแพทย์ที่ไม่ได้จัดที่พักรักษา เช่น การทำหมันและการยุติการตั้งครรภ์ กิจกรรมเหล่านี้สามารถดำเนินการได้โดยภาคเอกชน กลุ่มองค์กรดำเนินการต่าง ๆ คลินิกผู้ป่วยนอกและในโรงพยาบาล หรือคลินิกในสถานที่ทำงาน ในโรงเรียน บ้านพักผู้สูงอายุ องค์กรด้านแรงงาน มูลนิธิต่าง ๆ ตลอดจนบ้านของผู้ป่วยเองและบริการให้คำปรึกษาส่วนบุคคลสำหรับผู้ป่วยใน",
            });

            return model;
        }

        private static List<DBDBusinessModel> AddSpa() 
        {
            List<DBDBusinessModel> model = new List<DBDBusinessModel>();

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Spa,
                TSIC = "96101",
                BusinessName = "กิจกรรมสปา",
                InfoTitle = "กิจกรรมสปา",
                InfoMessage = "กิจกรรมสปาเพื่อการสร้างความผ่อนคลายทั้งร่างกายและจิตใจ มีโปรแกรมโภชนบำบัด สมาธิบำบัด การออกกำลังกาย การฝึกโยคะ วารีบำบัด เช่น ซาวน่าและอบไอน้ำ สุคนธบำบัด การบำรุงรักษาความงามร่วมด้วย รวมถึง กิจกรรมการนวดและกิจกรรมที่คล้ายกัน บริการนวดแผนโบราณ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Spa,
                TSIC = "96305",
                BusinessName = "กิจกรรมการบริการอาบอบนวดและการบริการอื่นๆที่คล้ายกัน",
                InfoTitle = "กิจกรรมการบริการอาบอบนวดและการบริการอื่นๆที่คล้ายกัน",
                InfoMessage = "การบริการอาบ อบ นวด การบริการของชาย/หญิงบริการ การบริการเป็นเพื่อนเข้าสังคม โรงน้ำชา",
            });

            return model;
        }

        private static List<DBDBusinessModel> AddPetMedicine() 
        {
            List<DBDBusinessModel> model = new List<DBDBusinessModel>();

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.PetMedicine,
                TSIC = "75000",
                BusinessName = "กิจกรรมเกี่ยวกับสัตวแพทย์",
                InfoTitle = "กิจกรรมเกี่ยวกับสัตวแพทย์",
                InfoMessage = "กิจกรรมบริการดูแลสุขภาพสัตว์และการควบคุมสัตว์ในฟาร์มเลี้ยง รวมทั้งกิจกรรมการดูแลสุขภาพและการควบคุมสัตว์เลี้ยง กิจกรรมเหล่านี้กระทำ โดยสัตวแพทย์ผู้มีคุณสมบัติเหมาะสมในโรงพยาบาลสัตว์ รวมทั้งการไปเยี่ยมเยียนที่ฟาร์ม สถานที่เลี้ยงสุนัขหรือที่บ้านในรูปแบบของการให้คำปรึกษาส่วนบุคคลและในห้องผ่าตัดหรือในที่อื่น ๆ นอกจากนี้ยังรวมถึงกิจกรรมของผู้ช่วยสัตวแพทย์หรือบุคลากรที่ทำหน้าที่เกี่ยวกับการสัตวบาล กิจกรรมด้านคลินิกและการบำบัดรักษารวมทั้งการวินิจฉัยโรคสัตว์และกิจกรรมรถพยาบาลฉุกเฉินสำหรับสัตว์",
            });

            return model;
        }

        private static List<DBDBusinessModel> AddConstruction() 
        {
            List<DBDBusinessModel> model = new List<DBDBusinessModel>();

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Construction,
                TSIC = " 42101",
                BusinessName = "การก่อสร้างถนนสะพานและอุโมงค์",
                InfoTitle = "การก่อสร้างถนนสะพานและอุโมงค์",
                InfoMessage = "การก่อสร้างมอเตอร์เวย์ ถนน ทางเดินรถและทางเดินเท้าอื่น ๆ การทำงานบนพื้นผิวของถนน ทางหลวง สะพานหรืออุโมงค์ การราดยางมะตอยถนนการทาสีเครื่องหมายต่าง ๆ บนถนน การติดตั้งเครื่องกั้น สัญญาณจราจรและอื่น ๆ การก่อสร้างสะพาน รวมทั้งสะพานสำหรับทางยกระดับ การก่อสร้างอุโมงค์ รวมถึงการขุดเจาะอุโมงค์รถไฟใต้ดิน การก่อสร้างทางวิ่งของเครื่องบิน รวมถึงทางขับและลานจอดอากาศยาน",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Construction,
                TSIC = " 42102",
                BusinessName = "การก่อสร้างทางรถไฟและรถใต้ดิน",
                InfoTitle = "การก่อสร้างทางรถไฟและรถใต้ดิน",
                InfoMessage = "การก่อสร้างทางรถไฟและทางรถใต้ดิน การโรยหินทางรถไฟและวางรางรถไฟ การติดตั้งอุปกรณ์ตัดต่อทางไฟฟ้า เครื่องประแจและอุปกรณ์สับราง การก่อสร้างระบบควบคุมและระบบความปลอดภัยสำหรับทางรถไฟ การก่อสร้างทางรถไฟยกระดับและระบบรถกระเช้าลอยฟ้า การปรับปรุงหรือการซ่อมรางรถไฟ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Construction,
                TSIC = " 42201",
                BusinessName = "การก่อสร้างโครงการสาธารณูปโภคเกี่ยวกับน้ำน้ำมันและก๊าซ",
                InfoTitle = "การก่อสร้างโครงการสาธารณูปโภคเกี่ยวกับน้ำน้ำมันและก๊าซ",
                InfoMessage = "การก่อสร้างท่อลำเลียง (น้ำ น้ำมัน ก๊าซและของเหลวอื่น ๆ ) เพื่อวางท่อทางไกล การวางท่อในเมืองหรือท้องถิ่น รวมถึงอาคาร/สิ่งก่อสร้างที่เกี่ยวข้องที่เป็นส่วนประกอบในระบบเหล่านั้น การก่อสร้างท่อลำเลียงน้ำมัน ก๊าซ รวมถึงเคมีภัณฑ์ น้ำมันดิบจากถ่านหินทั้งทางบกหรือใต้น้ำ การก่อสร้างท่อประปา ซึ่งเป็นท่อเมนและท่อย่อย การก่อสร้างระบบชลประทาน (คลองส่งน้ำ) การก่อสร้างระบบระบายน้ำ/สิ่งปฏิกูล รวมถึงการซ่อม การก่อสร้างภาชนะ การก่อสร้างและซ่อมแซมระบบกำจัดน้ำเสีย โรงบำบัดน้ำเสีย สถานีสูบน้ำ การขุดบ่อน้ำ การติดตั้งระบบสูบน้ำ รวมถึงการติดตั้งระบบบ่อเกรอะ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Construction,
                TSIC = " 42202",
                BusinessName = "การก่อสร้างโครงการสาธารณูปโภคเกี่ยวกับสายส่งไฟฟ้ากำลังและสายสัญญาณสื่อสาร",
                InfoTitle = "การก่อสร้างโครงการสาธารณูปโภคเกี่ยวกับสายส่งไฟฟ้ากำลังและสายสัญญาณสื่อสาร",
                InfoMessage = "การติดตั้งสายส่งไฟฟ้ากำลัง สายเคเบิลและสายสัญญาณสื่อสารต่าง ๆ ทั้งทางไกลในเมืองหรือท้องถิ่น รวมถึงอาคาร/สิ่งก่อสร้างที่เกี่ยวข้อง ซึ่งเป็นส่วนประกอบในระบบเหล่านั้น การติดตั้งและการซ่อมสายไฟ สายเคเบิล สายโทรศัพท์และสายสื่อสารต่าง ๆ ทั้งเหนือพื้นดิน ใต้น้ำหรือใต้ดิน การก่อสร้างโรงไฟฟ้า สถานีแปลงไฟฟ้า รวมถึงโรงไฟฟ้าย่อยที่ทำการจ่ายไฟฟ้าให้ในเมืองหรือท้องถิ่น การก่อสร้างเสาส่งสัญญาณโทรคมนาคม",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Construction,
                TSIC = " 42901",
                BusinessName = "การก่อสร้างระบบสาธารณูปโภคสิ่งอำนวยความสะดวก (ยกเว้นตัวอาคารของโรงงานอุตสาหกรรม) และโครงการวิศวกรรมโยธาอื่นๆที่เกี่ยวข้องในน้ำ",
                InfoTitle = "การก่อสร้างระบบสาธารณูปโภคสิ่งอำนวยความสะดวก (ยกเว้นตัวอาคารของโรงงานอุตสาหกรรม) และโครงการวิศวกรรมโยธาอื่นๆที่เกี่ยวข้องในน้ำ",
                InfoMessage = "การก่อสร้างและการซ่อมท่าเรือ ท่าเทียบเรือ ท่าน้ำ ประตูน้ำ ที่จอดเรือเลียบตามชายฝั่ง ที่จอดเรือคอยาว ที่จอดเรือขนาดเล็ก ท่าเทียบเรือสำราญ (ท่าจอดเรือ) เขื่อนหรือฝาย ทางเดินที่ยื่นลงในทะเล อู่เรือ รวมถึงการติดตั้งชิ้นส่วนสำเร็จรูป การก่อสร้างและการซ่อมที่กั้นน้ำ เขื่อนระบายน้ำ ประตูระบายน้ำ ประตูน้ำบานเลื่อน อู่ซ่อมเรือ และโครงสร้างเชิงกลที่ได้จากพลังน้ำที่คล้ายกัน การก่อสร้างและการซ่อมเขื่อนและพนัง การขุดลอกทางน้ำ การเคลื่อนย้ายหินและตะกอน และงานก่อสร้างทั่วไปอื่น ๆ ที่เกี่ยวข้องกับน้ำ การดำเนินงานใต้น้ำ (โดยนักประดาน้ำ มนุษย์กบหรือเทคนิคอื่น ๆ) และงานวิศวกรรมชลศาสตร์ต่าง ๆ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Construction,
                TSIC = " 42909",
                BusinessName = "การก่อสร้างโครงการวิศวกรรมโยธาอื่นๆซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "การก่อสร้างโครงการวิศวกรรมโยธาอื่นๆซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "การก่อสร้างระบบสาธารณูปโภค สิ่งอำนวยความสะดวก (ยกเว้น ตัวอาคารของโรงงานอุตสาหกรรม) การก่อสร้างและการซ่อมเหมืองแร่ เช่น สถานีลำเลียงและระบายแร่ อุโมงค์เหมืองแร่ การก่อสร้างและการซ่อมสิ่งอำนวยความสะดวกของสนามกีฬากลางแจ้ง รวมถึงพื้นที่แยกส่วนเพื่อการพัฒนาที่ดิน (เช่น ตัดถนนและโครงสร้างพื้นฐานของระบบสาธารณูปโภค) ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Construction,
                TSIC = " 43909",
                BusinessName = "กิจกรรมการก่อสร้างเฉพาะด้านอื่นๆซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "กิจกรรมการก่อสร้างเฉพาะด้านอื่นๆซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "กิจกรรมการก่อสร้างเฉพาะด้านอื่น ๆ ซึ่งเป็นงานที่ต้องใช้ทักษะพิเศษหรืออุปกรณ์ก่อสร้างพิเศษ งานป้องกันความชื้นและป้องกันน้ำ งานป้องกันความชื้นในอาคาร การจมโครงสร้าง การติดตั้งชิ้นส่วนเหล็กที่ไม่ได้ประกอบจากโรงงาน การดัดเหล็ก การก่ออิฐและการก่อหิน การมุงหลังคาบ้านที่พักอาศัยการติดตั้งและการรื้อถอนนั่งร้านและแท่นยกพื้น รวมทั้งการเช่านั่งร้านแท่นยกพื้น การตั้งปล่องและเตาอุตสาหกรรม งานที่ใช้ความสามารถเฉพาะที่จำเป็นต่อทักษะการปีนที่สูงและใช้เครื่องมือที่เกี่ยวข้อง เช่น การทำงานในที่สูงหรือบนตึกสูง ฯลฯ งานใต้พื้นผิว งานสร้างสระว่ายน้ำกลางแจ้ง การทำความสะอาดอาคารภายนอก ด้วยไอน้ำและเป่าทรายและกิจกรรมที่คล้ายกัน รวมทั้งการเช่าปั้นจั่นพร้อมคนขับและการให้เช่าเครื่องจักรและอุปกรณ์ที่ใช้ในงานก่อสร้างรวมถึงรถเครนโดยมีผู้ควบคุม",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Construction,
                TSIC = "41001",
                BusinessName = "การก่อสร้างอาคารที่พักอาศัย",
                InfoTitle = "การก่อสร้างอาคารที่พักอาศัย",
                InfoMessage = "การก่อสร้างอาคารที่เป็นที่พักอาศัยทุกประเภท บ้านเดี่ยว อาคารอยู่อาศัยรวมอาคารสูง การดัดแปลงหรือการปรับปรุงอาคารที่อยู่อาศัยเดิม การประกอบอาคารเพื่อการอยู่อาศัยสำเร็จรูปบริเวณสถานที่ก่อสร้าง",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Construction,
                TSIC = "41002",
                BusinessName = "การก่อสร้างอาคารที่ไม่ใช่ที่พักอาศัย",
                InfoTitle = "การก่อสร้างอาคารที่ไม่ใช่ที่พักอาศัย",
                InfoMessage = "การก่อสร้าง การก่อสร้างอาคาร/สิ่งก่อสร้างที่ไม่ใช่ที่พักอาศัยทุกประเภท อาคาร/สิ่งก่อสร้าง เพื่อการผลิตสินค้า เช่น โรงงาน โรงซ่อม โรงงานประกอบชิ้นส่วน โรงพยาบาล โรงเรียน อาคารสำนักงาน ศาสนสถาน โรงแรม ร้านค้า ศูนย์การค้า ภัตตาคาร ท่าอากาศยาน สิ่งอำนวยความสะดวกของสนามกีฬาในร่ม เช่น สนามเทนนิสในร่ม โรงยิม สถานที่สำหรับเล่นกีฬาในร่มทั่วไป โรงเก็บเรือ ลานน้ำแข็ง ฯลฯ คลังสินค้า อาคารจอดรถ รวมถึงที่จอดรถใต้ดิน การดัดแปลงหรือปรับปรุงอาคารที่ไม่ใช่ที่พักอาศัยเดิม การประกอบอาคารที่ไม่ใช่ที่พักอาศัยสำเร็จรูปบริเวณสถานที่ก่อสร้าง การบูรณะโบราณสถานและอาคาร",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Construction,
                TSIC = "43110",
                BusinessName = "การรื้อถอน",
                InfoTitle = "การรื้อถอน",
                InfoMessage = "การรื้อถอนหรือการทุบอาคาร และโครงสร้างอื่น ๆ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Construction,
                TSIC = "43120",
                BusinessName = "การเตรียมสถานที่ก่อสร้าง",
                InfoTitle = "การเตรียมสถานที่ก่อสร้าง",
                InfoMessage = "การเตรียมสถานที่เพื่อการก่อสร้าง ได้แก่ การเตรียมพื้นที่ก่อสร้าง งานดิน ได้แก่ งานขุด-ถม ปรับระดับบริเวณพื้นที่ก่อสร้าง ขุดคู ขนย้ายหิน ระเบิดหิน ฯลฯ การเตรียมบริเวณทำเหมือง เช่น การขนย้ายสิ่งกีดขวาง การพัฒนาและการเตรียมสถานที่ทำเหมือง ยกเว้น สถานที่ของน้ำมันและก๊าซ การเจาะ การเจาะดินและเก็บตัวอย่างวัสดุในงานก่อสร้าง สภาพทางภูมิศาสตร์และธรณีวิทยาหรือเพื่อวัตถุประสงค์ที่คล้ายกัน นอกจากนี้ยังรวมถึงการก่อสร้าง การระบายน้ำบริเวณก่อสร้าง การระบายน้ำเพื่อการเกษตรหรือบริเวณพื้นป่า และการแผ้วถางบริเวณเหมืองหรืออื่น ๆ (รวมทั้งการระเบิดเหมือง) จากบริเวณก่อสร้าง",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Construction,
                TSIC = "43210",
                BusinessName = "การติดตั้งไฟฟ้า",
                InfoTitle = "การติดตั้งไฟฟ้า",
                InfoMessage = "การติดตั้งระบบทุกประเภทของอาคาร และงานโครงสร้างด้านวิศวกรรมโยธา รวมถึงการติดตั้งข้อต่อและการเดินสายไฟ การเดินสายโทรคมนาคมสร้างเครือข่ายคอมพิวเตอร์และโทรทัศน์ทางสายเคเบิล รวมทั้งเส้นใยนำแสงจานดาวเทียม ระบบไฟฟ้าแสงสว่าง ระบบเตือนอัคคีภัย ระบบรักษาความปลอดภัย ไฟถนนและสัญญาณไฟ ไฟทางวิ่งของเครื่องบิน นอกจากนี้ยังรวมถึง การเชื่อมต่อกับอุปกรณ์เครื่องใช้ไฟฟ้าในครัวเรือน รวมทั้งแผงไฟฟ้าควบคุมความร้อน",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Construction,
                TSIC = "43221",
                BusinessName = "การติดตั้งระบบประปาและระบายน้ำ",
                InfoTitle = "การติดตั้งระบบประปาและระบายน้ำ",
                InfoMessage = "การติดตั้งระบบประปา และระบายน้ำ การต่อเติม การเปลี่ยนแปลง การซ่อมและบำรุงรักษาระบบและอุปกรณ์ต่าง ๆ นอกจากนั้นยังรวมถึงการติดตั้งระบบภายในอาคารหรือตามโครงการก่อสร้าง เช่น ท่อน้ำร้อนและน้ำเย็น การติดตั้งระบบดับไฟด้วยเครื่องพ่นน้ำ ระบบรดน้ำต้นไม้อัตโนมัติ การต่อท่อประปาและอุปกรณ์สุขภัณฑ์ อุปกรณ์จ่ายน้ำแบบใช้แรงดันสำหรับดับเพลิง (รวมทั้งหัวดับเพลิงที่ประกอบด้วยสายยางและท่อพ่น) ท่อกำจัดสิ่งปฏิกูล รวมทั้งท่อระบายน้ำและบ่อเกรอะ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Construction,
                TSIC = "43222",
                BusinessName = "การติดตั้งระบบทำความร้อน",
                InfoTitle = "การติดตั้งระบบทำความร้อน",
                InfoMessage = "การติดตั้งระบบทำความร้อน การต่อเติม การเปลี่ยนแปลง การซ่อมและบำรุงรักษาระบบและอุปกรณ์ต่าง ๆ นอกจากนั้นยังรวมถึงระบบทำความร้อนภายในอาคารหรือตามโครงการก่อสร้าง การติดตั้งระบบท่อ ระบบทำความร้อน (ไฟฟ้า ก๊าซ น้ำมัน) ระบบควบคุมความร้อนจากส่วนกลาง เตาหลอม หอผึ่งลมเย็น เครื่องทำน้ำร้อนพลังงานแสงอาทิตย์ การวางท่อไอน้ำ การติดตั้ง การซ่อมและบำรุงรักษาท่อก๊าซต่าง ๆ เช่น ก๊าซออกซิเจนที่ใช้ในโรงพยาบาล และการติดตั้งท่ออื่น ๆ ที่เกี่ยวข้อง",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Construction,
                TSIC = "43223",
                BusinessName = "การติดตั้งระบบระบายอากาศ",
                InfoTitle = "การติดตั้งระบบระบายอากาศ",
                InfoMessage = "การติดตั้งระบบระบายอากาศ การต่อเติม การเปลี่ยนแปลง การซ่อมและบำรุงรักษาระบบและอุปกรณ์ต่าง ๆ นอกจากนั้นยังรวมถึงระบบระบายอากาศภายในอาคารหรือตามโครงการก่อสร้าง ระบบทำความเย็น หรือเครื่องปรับอากาศ และท่อต่อ รวมถึงท่อต่าง ๆ ที่เกี่ยวข้อง",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Construction,
                TSIC = "43291",
                BusinessName = "การติดตั้งฉนวน",
                InfoTitle = "การติดตั้งฉนวน",
                InfoMessage = "การติดตั้งฉนวน การซ่อมและบำรุงรักษาฉนวนในอาคารและโครงสร้างวิศวกรรมโยธา ฉนวนกันความร้อน กันเสียง หรือกันสะเทือน ฉนวนป้องกันความร้อน ท่อน้ำร้อนและน้ำเย็น หม้อน้ำ ฉนวนที่เกี่ยวข้องกับงานป้องกันไฟ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Construction,
                TSIC = "43299",
                BusinessName = "การติดตั้งสิ่งก่อสร้างอื่นๆซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "การติดตั้งสิ่งก่อสร้างอื่นๆซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "การติดตั้ง การซ่อมและบำรุงรักษาอุปกรณ์ที่นอกเหนือจากระบบไฟฟ้า ระบบประปา ระบบทำความร้อนและระบบปรับอากาศหรือเครื่องจักรอุตสาหกรรมในอาคารและโครงสร้างทางวิศวกรรมโยธา การติดตั้งระบบและอุปกรณ์ต่าง ๆ ภายในอาคารหรือโครงการก่อสร้างอื่น ๆ เช่น ลิฟต์ บันไดเลื่อน ประตูอัตโนมัติประตูหมุน สายล่อฟ้า รางน้ำ กันสาด ผ้าใบบังแดด ลูกหมุนระบายอากาศระบบดูดฝุ่นเพื่อทำความสะอาด สัญญาณหรือเครื่องหมาย (จะให้แสงสว่างหรือไม่ก็ตาม)",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Construction,
                TSIC = "43301",
                BusinessName = "การติดตั้งส่วนประกอบอาคารและการตกแต่งภายใน",
                InfoTitle = "การติดตั้งส่วนประกอบอาคารและการตกแต่งภายใน",
                InfoMessage = "กิจกรรมการติดตั้งส่วนประกอบอาคารและการตกแต่งภายใน การติดตั้งประตู (ยกเว้น ประตูอัตโนมัติและประตูหมุน) หน้าต่าง กรอบประตู หน้าต่างการติดตั้งมุ้งลวด เหล็กดัด การติดตั้งบันได ระเบียง ครัว ชั้นวางของและอื่น ๆ ที่คล้ายกัน การติดตั้งเฟอร์นิเจอร์ เพดาน ผนังและผนังกั้นห้องแบบย้ายที่ได้",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Construction,
                TSIC = "43302",
                BusinessName = "การปูพื้นและผนัง",
                InfoTitle = "การปูพื้นและผนัง",
                InfoMessage = "การปูพื้นและผนังด้วยกระเบื้อง คอนกรีต หรือหินธรรมชาติ หรือกระเบื้องเคลือบ อุปกรณ์เครื่องดินเผา การปูพื้นและบุผนังด้วยหินขัด หินอ่อน หินแกรนิต และหินชนวน การปูพื้นด้วยพรมและพรมน้ำมัน รวมถึงยาง และพลาสติก การปูพื้นด้วยวัสดุอื่น ๆ เช่น พื้นไม้ปาร์เกต์และพื้นไม้อื่น ๆ รวมถึง งานแต่งสำเร็จที่เกี่ยวข้อง เช่น การขัดด้วยทราย การขัดด้วยแวกซ์ ฯลฯ การบุวอลเปเปอร์",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Construction,
                TSIC = "43303",
                BusinessName = "การทาสี",
                InfoTitle = "การทาสี",
                InfoMessage = "การทาสีภายในและภายนอกอาคาร/สิ่งก่อสร้าง",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Construction,
                TSIC = "43309",
                BusinessName = "การตกแต่งอาคารให้เสร็จสมบูรณ์อื่นๆซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "การตกแต่งอาคารให้เสร็จสมบูรณ์อื่นๆซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "การฉาบปูนผนังทั้งภายนอกและภายในอาคารหรือสิ่งก่อสร้างอื่น ๆ รวมถึงการบุวัสดุที่เป็นระแนง การติดตั้งแผ่นผนังยิปซัม การติดตั้งเครื่องโลหะแผ่นสำเร็จรูป รวมถึงเหล็กหรือเหล็กกล้าสำหรับประดับตกแต่ง การติดตั้งกระจก และกระจกเงา การทำความสะอาดอาคารเมื่อการก่อสร้างแล้วเสร็จ การตกแต่งเพื่อให้อาคารสมบูรณ์ รวมถึงการติดตั้งภายในร้านค้า บ้านเคลื่อนที่ เรือ ฯลฯ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Construction,
                TSIC = "43901",
                BusinessName = "การก่อสร้างฐานรากรวมถึงการตอกเสาเข็ม",
                InfoTitle = "การก่อสร้างฐานรากรวมถึงการตอกเสาเข็ม",
                InfoMessage = "กิจกรรมการสร้างฐานราก การตอกเสาเข็มและงานที่เกี่ยวข้อง รวมถึงการให้เช่าเครื่องจักรและอุปกรณ์ที่ใช้ในการก่อสร้างฐานรากโดยมีผู้ควบคุม",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Construction,
                TSIC = "43909",
                BusinessName = "กิจกรรมการก่อสร้างเฉพาะด้านอื่นๆซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "กิจกรรมการก่อสร้างเฉพาะด้านอื่นๆซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "กิจกรรมการก่อสร้างเฉพาะด้านอื่น ๆ ซึ่งเป็นงานที่ต้องใช้ทักษะพิเศษหรืออุปกรณ์ก่อสร้างพิเศษ งานป้องกันความชื้นและป้องกันน้ำ งานป้องกันความชื้นในอาคาร การจมโครงสร้าง การติดตั้งชิ้นส่วนเหล็กที่ไม่ได้ประกอบจากโรงงาน การดัดเหล็ก การก่ออิฐและการก่อหิน การมุงหลังคาบ้านที่พักอาศัยการติดตั้งและการรื้อถอนนั่งร้านและแท่นยกพื้น รวมทั้งการเช่านั่งร้านแท่นยกพื้น การตั้งปล่องและเตาอุตสาหกรรม งานที่ใช้ความสามารถเฉพาะที่จำเป็นต่อทักษะการปีนที่สูงและใช้เครื่องมือที่เกี่ยวข้อง เช่น การทำงานในที่สูงหรือบนตึกสูง ฯลฯ งานใต้พื้นผิว งานสร้างสระว่ายน้ำกลางแจ้ง การทำความสะอาดอาคารภายนอก ด้วยไอน้ำและเป่าทรายและกิจกรรมที่คล้ายกัน รวมทั้งการเช่าปั้นจั่นพร้อมคนขับและการให้เช่าเครื่องจักรและอุปกรณ์ที่ใช้ในงานก่อสร้างรวมถึงรถเครนโดยมีผู้ควบคุม",
            });

            return model;
        }

        private static List<DBDBusinessModel> AddElectronicSell() 
        {
            List<DBDBusinessModel> model = new List<DBDBusinessModel>();

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.ElectronicSell,
                TSIC = "46421",
                BusinessName = "การขายส่งเครื่องใช้ไฟฟ้าและอิเล็กทรอนิกส์ชนิดใช้ในครัวเรือน",
                InfoTitle = "การขายส่งเครื่องใช้ไฟฟ้าและอิเล็กทรอนิกส์ชนิดใช้ในครัวเรือน",
                InfoMessage = "การขายส่งเครื่องใช้ไฟฟ้าในครัวเรือน เช่น ตู้เย็น ตู้แช่แข็ง เครื่องล้างจาน เครื่องซักผ้า เครื่องดูดฝุ่น เครื่องขัดพื้น เครื่องบด เครื่องปั่น/กวนและเครื่องคั้นน้ำผลไม้ เครื่องเปิดกระป๋อง แปรงสีฟันไฟฟ้า เครื่องทำน้ำร้อนด้วยไฟฟ้า ผ้าห่มไฟฟ้า เครื่องเป่าผม เครื่องม้วนผม เตารีดไฟฟ้า เครื่องทำความร้อนในห้อง เตาอบไฟฟ้า เตาอบไมโครเวฟ ฯลฯ เครื่องใช้ในการประกอบอาหาร และผลิตความร้อนที่ไม่ต้องใช้ไฟฟ้า เช่น เตาหุงต้ม เตา การขายส่งเครื่องใช้อิเล็กทรอนิกส์ที่เกี่ยวกับเสียงและภาพเพื่อความบันเทิงในครัวเรือน ยานยนต์ ระบบแจ้งเตือนสาธารณะ และเครื่องขยายเสียงของเครื่องดนตรี เครื่องรับวิทยุ และโทรทัศน์ เครื่องบันทึกภาพวีดิทัศน์และเครื่องบันทึกซ้ำ เช่น เครื่องเล่น และเครื่องบันทึกซีดีและดีวีดี กล้องวีดิทัศน์ อุปกรณ์สเตอริโอ เช่น หูฟัง ไมโครโฟน ลำโพง เครื่องขยายเสียง กล้องดิจิทัล วีดีโอเกมคอนโซล ตู้เพลงและเครื่องใช้อิเล็กทรอนิกส์อื่น ๆ ชนิดใช้ในครัวเรือน",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.ElectronicSell,
                TSIC = "46434",
                BusinessName = "การขายส่งเกมและของเล่น",
                InfoTitle = "การขายส่งเกมและของเล่น",
                InfoMessage = "การขายส่งเกมและของเล่นซึ่งทำด้วยวัสดุทุกชนิด เช่น ตุ๊กตา ของเล่น และเกม (รวมถึงเกมอิเล็กทรอนิกส์) หุ่นจำลอง และยานยนต์สำหรับเด็ก (ยกเว้นจักรยานสองล้อและสามล้อที่ทำจากโลหะ)",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.ElectronicSell,
                TSIC = "47595",
                BusinessName = "ร้านขายปลีกเครื่องใช้ไฟฟ้าชนิดในครัวเรือน",
                InfoTitle = "ร้านขายปลีกเครื่องใช้ไฟฟ้าชนิดในครัวเรือน",
                InfoMessage = "ร้านขายปลีกเครื่องใช้ไฟฟ้าชนิดใช้ในครัวเรือน ตู้เย็น ตู้แช่แข็ง เครื่องทำความเย็น เครื่องล้างจาน เครื่องซักผ้า เครื่องดูดฝุ่น เครื่องขัดพื้น เครื่องบด เครื่องปั่น/กวนและเครื่องคั้นน้ำผลไม้ เครื่องเปิดกระป๋อง แปรงสีฟันไฟฟ้า เครื่องทำน้ำร้อนด้วยไฟฟ้า ผ้าห่มไฟฟ้า เครื่องเป่าผม เครื่องม้วนผม เตารีดไฟฟ้า เครื่องทำความร้อนในห้อง เตาอบไฟฟ้า เตาอบไมโครเวฟ ฯลฯ เครื่องใช้ทำอาหารและให้ความร้อนที่ไม่ใช้ไฟฟ้า เช่น เตาหุงต้ม เตาไฟที่ไม่ใช้ไฟฟ้า เตาแก๊ส จักรเย็บผ้า",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.ElectronicSell,
                TSIC = "46599",
                BusinessName = "การขายส่งเครื่องจักรและอุปกรณ์อื่นๆซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "การขายส่งเครื่องจักรและอุปกรณ์อื่นๆซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "การขายส่งสายไฟ สวิตช์และอุปกรณ์ติดตั้งอื่น ๆ ชนิดใช้ในโรงงานอุตสาหกรรมการขายส่งเครื่องใช้ไฟฟ้าอื่น ๆ เช่น มอเตอร์ไฟฟ้า หม้อแปลงไฟฟ้า อุปกรณ์ควบคุมและจ่ายไฟ แบตเตอรี่ การขายส่งเครื่องทำความเย็น เครื่องปรับอากาศการขายส่งอุปกรณ์เพื่อรักษาความปลอดภัยและอุปกรณ์ผจญเพลิง การขายส่งลิฟต์และสายพานลำเลียง การขายส่งเครื่องมือเครื่องใช้ในห้องปฏิบัติการ เครื่องมือวิทยาศาสตร์ การขายส่งเครื่องมือและอุปกรณ์ในการวัด การขายส่งเครื่องจักรอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น เพื่อใช้ในงานอุตสาหกรรม การค้า การนำร่องและในงานบริการอื่น ๆ เครื่องมือเครื่องใช้และอุปกรณ์ที่ใช้ในงานอาชีพ เช่น งานไฟฟ้าและอิเล็กทรอนิกส์",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.ElectronicSell,
                TSIC = "47999",
                BusinessName = "การขายปลีกโดยไม่มีร้านซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "การขายปลีกโดยไม่มีร้านซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "การขายปลีกโดยเร่ขายสินค้าตามถนนหรือตามบ้าน การขายปลีกโดยเครื่องขายสินค้าแบบหยอดเหรียญ การประมูลโดยไม่มีร้านอื่น ๆ (ขายปลีก) ได้แก่ การขายสินค้าประเภทอาหาร เครื่องดื่มและผลิตภัณฑ์ยาสูบ สิ่งทอ เสื้อผ้า รองเท้าและเครื่องหนัง สินค้าทางเภสัชภัณฑ์และทางการแพทย์ เครื่องหอม และเครื่องสำอาง คอมพิวเตอร์ อุปกรณ์สื่อสาร โทรคมนาคม เครื่องใช้ไฟฟ้าและอิเล็กทรอนิกส์ สินค้าวัฒนธรรม และพักผ่อนหย่อนใจ สินค้าทางเภสัชภัณฑ์และทางการแพทย์ เครื่องหอม และเครื่องสำอาง เป็นต้น",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.ElectronicSell,
                TSIC = "46104",
                BusinessName = "การขายส่งคอมพิวเตอร์และซอฟต์แวร์อุปกรณ์อิเล็กทรอนิกส์และเครื่องมือสื่อสารโดยได้รับค่าตอบแทนหรือตามสัญญาจ้าง",
                InfoTitle = "การขายส่งคอมพิวเตอร์และซอฟต์แวร์อุปกรณ์อิเล็กทรอนิกส์และเครื่องมือสื่อสารโดยได้รับค่าตอบแทนหรือตามสัญญาจ้าง",
                InfoMessage = "กิจกรรมขายส่งคอมพิวเตอร์และซอฟต์แวร์ อุปกรณ์และชิ้นส่วนอิเล็กทรอนิกส์และเครื่องมือสื่อสาร โดยได้รับค่าตอบแทนหรือตามสัญญาจ้าง เช่น คอมพิวเตอร์ อุปกรณ์ต่อพ่วงคอมพิวเตอร์และซอฟต์แวร์ การขายส่งวาล์ว และหลอดวิทยุ การขายส่งอุปกรณ์กึ่งตัวนำไฟฟ้า การขายส่งไมโครชิพและเครื่องเชื่อมต่อวงจรไฟฟ้า การขายส่งวงจรของเครื่องวิทยุ การขายส่งเทปเปล่าและแถบวีดิทัศน์ แผ่นเปล่าซีดีและดีวีดี การขายส่งเครื่องโทรศัพท์ และอุปกรณ์การสื่อสารโทรคมนาคม ทั้งนี้รวมถึงวิธีการขายทอดตลาดสินค้าดังกล่าว",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.ElectronicSell,
                TSIC = "46510",
                BusinessName = "การขายส่งคอมพิวเตอร์อุปกรณ์ต่อพ่วงคอมพิวเตอร์และซอฟต์แวร์",
                InfoTitle = "การขายส่งคอมพิวเตอร์อุปกรณ์ต่อพ่วงคอมพิวเตอร์และซอฟต์แวร์",
                InfoMessage = "การขายส่งคอมพิวเตอร์และอุปกรณ์ต่อพ่วงคอมพิวเตอร์ รวมทั้งการขายส่งซอฟต์แวร์",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.ElectronicSell,
                TSIC = "46521",
                BusinessName = "การขายส่งอุปกรณ์และชิ้นส่วนอิเล็กทรอนิกส์",
                InfoTitle = "การขายส่งอุปกรณ์และชิ้นส่วนอิเล็กทรอนิกส์",
                InfoMessage = "การขายส่งวาล์ว และหลอดวิทยุ การขายส่งอุปกรณ์กึ่งตัวนำไฟฟ้า การขายส่งไมโครชิพและเครื่องเชื่อมต่อวงจรไฟฟ้า การขายส่งวงจรของเครื่องวิทยุ การขายส่งเทปเปล่าและแถบวีดิทัศน์ แผ่นเปล่าซีดีและดีวีดี การขายส่งอุปกรณ์และชิ้นส่วนอิเล็กทรอนิกส์อื่น ๆ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.ElectronicSell,
                TSIC = "46522",
                BusinessName = "การขายส่งโทรศัพท์และอุปกรณ์การสื่อสารโทรคมนาคม",
                InfoTitle = "การขายส่งโทรศัพท์และอุปกรณ์การสื่อสารโทรคมนาคม",
                InfoMessage = "การขายส่งโทรศัพท์และอุปกรณ์การสื่อสารที่ใช้ส่งสัญญานอิเล็กทรอนิกส์ไปตามสายหรือออกอากาศ เช่น การออกอากาศทางวิทยุและโทรทัศน์ และอุปกรณ์การสื่อสารแบบไร้สาย เช่น การขายส่งโทรศัพท์ไร้สาย โทรศัพท์เคลื่อนที่ วิทยุติดตามตัว อุปกรณ์สื่อสารเคลื่อนที่ เครื่องโทรสาร เครื่องตอบรับโทรศัพท์ การขายส่งอุปกรณ์สื่อสารข้อมูล ได้แก่ บริดจ์ อุปกรณ์จัดเส้นทาง และเกตเวย์ โมเด็มและอุปกรณ์คลื่นพาห์ อุปกรณ์อินฟราเรด (เช่น รีโมทคอนโทรล) เสาอากาศสำหรับเครื่องส่งและเครื่องรับอุปกรณ์เคเบิลทีวี อุปกรณ์ที่ใช้สำหรับเครื่องส่งวิทยุ โทรทัศน์และการออกอากาศ รวมถึงกล้องโทรทัศน์ เครื่องส่งสัญญาณวิทยุและโทรทัศน์และอุปกรณ์สื่อสารอื่น ๆ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.ElectronicSell,
                TSIC = "47411",
                BusinessName = "ร้านขายปลีกคอมพิวเตอร์และอุปกรณ์ต่อพ่วงคอมพิวเตอร์",
                InfoTitle = "ร้านขายปลีกคอมพิวเตอร์และอุปกรณ์ต่อพ่วงคอมพิวเตอร์",
                InfoMessage = "ร้านขายปลีกคอมพิวเตอร์ เช่น คอมพิวเตอร์ชนิดตั้งโต๊ะ คอมพิวเตอร์ชนิดพกพา ฯลฯ ร้านขายปลีกอุปกรณ์ต่อพ่วงคอมพิวเตอร์ เช่น อุปกรณ์เก็บข้อมูล เครื่องพิมพ์ จอภาพ แป้นอักขระ เมาส์ ก้านและลูกบอลควบคุม (Track ball) ฯลฯ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.ElectronicSell,
                TSIC = "47412",
                BusinessName = "ร้านขายปลีกเครื่องเล่นวีดิโอเกมและซอฟต์แวร์สำเร็จรูป",
                InfoTitle = "ร้านขายปลีกเครื่องเล่นวีดิโอเกมและซอฟต์แวร์สำเร็จรูป",
                InfoMessage = "ร้านขายปลีกซอฟต์แวร์สำเร็จรูป เช่น ซอฟต์แวร์ระบบปฏิบัติการ ซอฟต์แวร์เกมและซอฟต์แวร์เพื่อการใช้งานในเชิงธุรกิจและด้านอื่น ๆ ร้านขายปลีกเครื่องเล่นวีดีโอเกมคอนโซล รวมถึงวีดีโอเกม",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.ElectronicSell,
                TSIC = "47413",
                BusinessName = "ร้านขายปลีกอุปกรณ์การสื่อสารโทรคมนาคม",
                InfoTitle = "ร้านขายปลีกอุปกรณ์การสื่อสารโทรคมนาคม",
                InfoMessage = "การขายปลีกโทรศัพท์และอุปกรณ์การสื่อสารที่ใช้ส่งสัญญานอิเล็กทรอนิกส์ไปตามสายหรือออกอากาศ เช่น การออกอากาศทางวิทยุและโทรทัศน์ และอุปกรณ์การสื่อสารแบบไร้สาย เช่น ร้านขายปลีกโทรศัพท์ไร้สาย โทรศัพท์เคลื่อนที่ วิทยุติดตามตัว อุปกรณ์สื่อสารเคลื่อนที่ เครื่องโทรสาร เครื่องตอบรับโทรศัพท์ รวมถึงระบบสัญญาณกันขโมยและระบบสัญญาณแจ้งอัคคีภัย ร้านขายปลีกอุปกรณ์สื่อสารข้อมูล ได้แก่ บริดจ์ อุปกรณ์จัดเส้นทาง และเกตเวย์ ร้านขายปลีกอุปกรณ์อินฟราเรด (เช่น รีโมทคอนโทรล) อุปกรณ์สำหรับรับส่งวิทยุ โทรทัศน์และการออกอากาศ จานดาวเทียม อุปกรณ์เคเบิลทีวี และอุปกรณ์สื่อสารอื่น ๆ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.ElectronicSell,
                TSIC = "47420",
                BusinessName = "การขายปลีกอุปกรณ์ที่เกี่ยวกับภาพและเสียงในร้านเฉพาะ",
                InfoTitle = "การขายปลีกอุปกรณ์ที่เกี่ยวกับภาพและเสียงในร้านเฉพาะ",
                InfoMessage = "การขายปลีกอุปกรณ์วิทยุและโทรทัศน์ สายอากาศ เครื่องขยายเสียง การขายปลีกเครื่องรับวิทยุและโทรทัศน์ การขายปลีกอุปกรณ์เครื่องสเตอริโอ รวมทั้งการขายปลีกเครื่องเล่นซีดีและดีวีดีและเครื่องบันทึกเสียง กล้องดิจิทัล เครื่องเล่นเทป",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.ElectronicSell,
                TSIC = "47743",
                BusinessName = "ร้านขายปลีกคอมพิวเตอร์และอุปกรณ์สื่อสารโทรคมนาคมที่ใช้แล้ว",
                InfoTitle = "ร้านขายปลีกคอมพิวเตอร์และอุปกรณ์สื่อสารโทรคมนาคมที่ใช้แล้ว",
                InfoMessage = "ร้านขายปลีกคอมพิวเตอร์และอุปกรณ์ต่อพ่วงที่ใช้แล้ว ร้านขายปลีกอุปกรณ์การสื่อสารโทรคมนาคมที่ใช้แล้ว เช่น โทรศัพท์ โทรศัพท์เคลื่อนที่",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.ElectronicSell,
                TSIC = "47744",
                BusinessName = "ร้านขายปลีกเครื่องใช้ไฟฟ้าและอิเล็กทรอนิกส์ชนิดใช้ในครัวเรือนที่ใช้แล้ว",
                InfoTitle = "ร้านขายปลีกเครื่องใช้ไฟฟ้าและอิเล็กทรอนิกส์ชนิดใช้ในครัวเรือนที่ใช้แล้ว",
                InfoMessage = "ร้านขายปลีกเครื่องใช้ไฟฟ้าที่ใช้แล้ว เช่น ตู้เย็น เครื่องซักผ้า เตาอบไมโครเวฟ เตาหุงต้ม ร้านขายปลีกอุปกรณ์ไฟฟ้าสำหรับให้แสงสว่างที่ใช้แล้ว เช่น โคมระย้า ตะเกียง ร้านขายปลีกเครื่องใช้อิเล็กทรอนิกส์ที่ใช้แล้ว เช่น วิทยุ โทรทัศน์ เครื่องเล่นซีดีและดีวีดี กล้องดิจิทัล",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.ElectronicSell,
                TSIC = "47891",
                BusinessName = "การขายปลีกคอมพิวเตอร์และอุปกรณ์สื่อสารโทรคมนาคม บนแผงลอยและตลาด",
                InfoTitle = "การขายปลีกคอมพิวเตอร์และอุปกรณ์สื่อสารโทรคมนาคม บนแผงลอยและตลาด",
                InfoMessage = "การขายปลีกคอมพิวเตอร์และอุปกรณ์สื่อสารโทรคมนาคมบนแผงลอยและตลาด คอมพิวเตอร์ และอุปกรณ์ต่อพ่วง เช่น อุปกรณ์จัดเก็บข้อมูล เครื่องพิมพ์ จอภาพ แป้นอักขระ เม้าส์ ก้านควบคุมและลูกบอลควบคุม ฯลฯ ซอฟต์แวร์สำเร็จรูป เครื่องเล่นวีดีโอเกมคอนโซล และวีดีโอเกม โทรศัพท์ โทรศัพท์เคลื่อนที่ วิทยุติดตามตัว เครื่องโทรสาร เสาอากาศ อุปกรณ์เคเบิลทีวี และอุปกรณ์สื่อสารอื่น ๆ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.ElectronicSell,
                TSIC = "47892",
                BusinessName = "การขายปลีกเครื่องใช้ไฟฟ้าและอิเล็กทรอนิกส์ชนิดใช้ในครัวเรือนบนแผงลอยและตลาด",
                InfoTitle = "การขายปลีกเครื่องใช้ไฟฟ้าและอิเล็กทรอนิกส์ชนิดใช้ในครัวเรือนบนแผงลอยและตลาด",
                InfoMessage = "การขายปลีกเครื่องใช้ไฟฟ้าและอิเล็กทรอนิกส์ชนิดใช้ในครัวเรือนบนแผงลอยและตลาด อุปกรณ์เสียงและภาพเพื่อความบันเทิงในบ้านหรือยานยนต์ เครื่องขยายเสียง วิทยุและโทรทัศน์ เครื่องเล่นและเครื่องบันทึกซีดีและดีวีดี กล้องวีดิทัศน์ กล้องดิจิทัล ฯลฯ เครื่องใช้ไฟฟ้า เช่น ตู้เย็น เครื่องซักผ้า เตาอบไมโครเวฟ เตาหุงต้ม อุปกรณ์ไฟฟ้าสำหรับให้แสงสว่าง เช่น โคมระย้า ตะเกียง",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.ElectronicSell,
                TSIC = "95110",
                BusinessName = "การซ่อมคอมพิวเตอร์และอุปกรณ์ต่อพ่วง",
                InfoTitle = "การซ่อมคอมพิวเตอร์และอุปกรณ์ต่อพ่วง",
                InfoMessage = "การซ่อมอุปกรณ์ทางอิเล็กทรอนิกส์ เช่น คอมพิวเตอร์ เครื่องคำนวณและอุปกรณ์ต่อพ่วง รวมทั้งการซ่อมและบำรุงรักษาอุปกรณ์ต่าง ๆ ดังต่อไปนี้ คอมพิวเตอร์แบบตั้งโต๊ะ คอมพิวเตอร์แบบวางบนตัก หน่วยขับจานแม่เหล็ก แฟลชไดรว์และอุปกรณ์หน่วยเก็บข้อมูลอื่น ๆ หน่วยขับจานบันทึกด้วยแสง (แผ่นซีดีบันทึกซ้ำได้ แผ่นซีดีอ่านอย่างเดียว แผ่นดีวีดีอ่านอย่างเดียวแผ่นดีวีดีบันทึกซ้ำได้) เครื่องพิมพ์ จอภาพ แป้นอักขระ เมาส์ทุกชนิดก้านควบคุมและอุปกรณ์ ลูกกลมควบคุมทิศทาง โมเด็มคอมพิวเตอร์ภายในและภายนอก คอมพิวเตอร์ปลายทางเฉพาะงาน คอมพิวเตอร์แม่ข่ายเครื่องสแกนเนอร์รหัสแท่ง เครื่องอ่านบัตรอัจฉริยะ และเครื่องฉายภาพคอมพิวเตอร์หมวดแสดงผลที่เป็นเสมือนจริง คอมพิวเตอร์ที่เชื่อมโยงกับระบบกลาง ซึ่งยังไม่ได้ใช้เครื่องกลในการดำเนินการ เช่น เครื่องรับ-จ่ายเงินอัตโนมัติการบริการ ณ จุดขาย (POS) ที่ไม่ได้ทำงานแบบจักรกล คอมพิวเตอร์มือถือ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.ElectronicSell,
                TSIC = "95120",
                BusinessName = "การซ่อมอุปกรณ์สื่อสาร",
                InfoTitle = "การซ่อมอุปกรณ์สื่อสาร",
                InfoMessage = "การซ่อมและบำรุงรักษาอุปกรณ์สื่อสาร เช่น โทรศัพท์ไร้สาย โทรศัพท์เคลื่อนที่อุปกรณ์โมเด็มและอุปกรณ์คลื่นพาห์ เครื่องโทรสาร อุปกรณ์ส่งผ่านข้อมูล (ได้แก่ อุปกรณ์จัดเส้นทาง เราท์เตอร์ บริดจ์ โมเด็ม) วิทยุรับ-ส่ง กล้องถ่ายวีดิทัศน์และกล้องโทรทัศน์เพื่อการพาณิชย์",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.ElectronicSell,
                TSIC = "95210",
                BusinessName = "การซ่อมเครื่องอิเล็กทรอนิกส์สำหรับผู้บริโภค",
                InfoTitle = "การซ่อมเครื่องอิเล็กทรอนิกส์สำหรับผู้บริโภค",
                InfoMessage = "การซ่อมและบำรุงรักษาเครื่องอิเล็กทรอนิกส์สำหรับผู้บริโภค ได้แก่ เครื่องรับโทรทัศน์ วิทยุ เครื่องบันทึกเทปวีดีโอ (VCR) เครื่องเล่นซีดี กล้องถ่ายวีดิทัศน์สำหรับครัวเรือน",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.ElectronicSell,
                TSIC = "95220",
                BusinessName = "การซ่อมเครื่องใช้ในครัวเรือนและอุปกรณ์สำหรับบ้านและสวน",
                InfoTitle = "การซ่อมเครื่องใช้ในครัวเรือนและอุปกรณ์สำหรับบ้านและสวน",
                InfoMessage = "การซ่อมและการบริการเกี่ยวกับเครื่องใช้ไฟฟ้าในครัวเรือน ตู้เย็น เตาประกอบอาหาร เครื่องซักผ้า เครื่องอบผ้า เครื่องปรับอากาศ ฯลฯ การซ่อมและบริการเกี่ยวกับอุปกรณ์สำหรับบ้านและสวน เช่น เครื่องตัดหญ้า เครื่องเล็มหญ้า เครื่องเป่าหิมะและใบไม้ กรรไกรตัดต้นไม้ ฯลฯ",
            });

            return model;
        }

        private static List<DBDBusinessModel> AddFitness()
        {
            List<DBDBusinessModel> model = new List<DBDBusinessModel>();

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Fitness,
                TSIC = "93112",
                BusinessName = "การดำเนินงานของสถานที่ออกกำลังกาย",
                InfoTitle = "การดำเนินงานของสถานที่ออกกำลังกาย",
                InfoMessage = "การดำเนินงานของสถานที่ออกกำลังกาย ซึ่งมีสิ่งอำนวยความสะดวกที่จำเป็นต่อการทำกิจกรรมสร้างสุขภาพ เช่น สปอร์ตคลับ ศูนย์ฟิตเนส บริการแอโรบิค ศูนย์โยคะ ฯลฯ",
            });

            return model;
        }

        private static List<DBDBusinessModel> AddCarCare() 
        {
            List<DBDBusinessModel> model = new List<DBDBusinessModel>();

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.CarCare,
                TSIC = "96309",
                BusinessName = "กิจกรรมบริการส่วนบุคคลอื่นๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "กิจกรรมบริการส่วนบุคคลอื่นๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "กิจกรรมเกี่ยวกับการนัดหมายและสำนักงานจัดหาคู่ กิจกรรมเกี่ยวกับการลำดับ หรือสืบวงศ์ตระกูลหรือเครือญาติ การบริการสักและเจาะตามร่างกาย การบริการขนของ ขัดรองเท้า ให้บริการการจอดรถ การบริการห้องน้ำสาธารณะการบริการตัดกุญแจ สะเดาะกุญแจ การบริการนำรถไปจอด กิจกรรมการบริการส่วนบุคคลอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น เช่น บริการจัดการงานแต่งงาน บริการจดทะเบียนรถยนต์ รถจักรยานยนต์ รับต่อ พรบ. เติมเงินมือถือ รับชำระค่าบริการสาธารณูปโภค รับทำวีซ่า ต่อหนังสือเดินทาง พิสูจน์สัญชาติแรงงานต่างด้าว",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.CarCare,
                TSIC = "45203",
                BusinessName = "การบำรุงรักษายานยนต์ทั่วไป",
                InfoTitle = "การบำรุงรักษายานยนต์ทั่วไป",
                InfoMessage = "การทำความสะอาดและการบริการบำรุงรักษาที่ทำเป็นประจำ เช่น การบริการล้างรถ การป้องกันสนิม การขัดสีเคลือบเงา การดูแลรักษารถ การล้าง และการขัดเงา ฯลฯ การเปลี่ยนถ่ายน้ำมันเครื่อง น้ำมันเบรก น้ำมันเกียร์ น้ำมันคลัชต์ การทำความสะอาดเบาะ พรม รวมถึงการซ่อมเบาะรถยนต์",
            });

            return model;
        }

        private static List<DBDBusinessModel> AddAccountAndLawConsult() 
        {
            List<DBDBusinessModel> model = new List<DBDBusinessModel>();

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AccountAndLawConsult,
                TSIC = "69100",
                BusinessName = "กิจกรรมทางกฎหมาย",
                InfoTitle = "กิจกรรมทางกฎหมาย",
                InfoMessage = "การเป็นตัวแทนพิทักษ์สิทธิประโยชน์ ไม่ว่าจะกระทำก่อนการพิจารณาคดีในศาลหรือที่เกี่ยวกับศาลหรือภายใต้การแนะนำของทนายความ เช่น การให้คำปรึกษาและการเป็นทนายความในคดีแพ่ง การให้คำปรึกษาและการเป็นทนายความในคดีอาญา การให้คำปรึกษาและการเป็นทนายความเกี่ยวกับข้อพิพาทด้านแรงงาน การให้คำปรึกษาและการให้คำแนะนำทั่วไป การเตรียมเอกสารทางกฎหมาย เช่น เอกสารที่เกี่ยวกับการก่อตั้งบริษัท ข้อตกลงในการเป็นหุ้นส่วนหรือเอกสารอื่น ๆ ที่คล้ายกันซึ่งเกี่ยวข้องกับการก่อตั้งบริษัท สิทธิบัตรและลิขสิทธิ์ การเตรียมสัญญาหรือข้อตกลง พินัยกรรม สัญญาทรัสต์ ฯลฯ การดำเนินการของเจ้าพนักงานรับรองเอกสาร พนักงานจดทะเบียนกฎหมายแพ่ง เจ้าพนักงานศาล อนุญาโตตุลาการ ผู้ตรวจสอบและผู้ไต่สวน",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.AccountAndLawConsult,
                TSIC = "69200",
                BusinessName = "กิจกรรมเกี่ยวกับบัญชีการทำบัญชีและการตรวจสอบบัญชี การให้คำปรึกษาด้านภาษี",
                InfoTitle = "กิจกรรมเกี่ยวกับบัญชีการทำบัญชีและการตรวจสอบบัญชี การให้คำปรึกษาด้านภาษี",
                InfoMessage = "การบันทึกรายการธุรกรรมทางการค้าที่เกิดจากธุรกิจหรืออื่น ๆ การจัดเตรียมหรือการตรวจสอบบัญชีการเงิน การตรวจสอบบัญชีและการรับรองความถูกต้องการจัดเตรียมการขอคืนภาษีเงินได้ส่วนบุคคลและนิติบุคคล กิจกรรมการให้คำปรึกษาและการเป็นผู้แทนนอกเหนือจากการเป็นทนายว่าความด้านภาษีแก่ลูกค้า",
            });

            return model;
        }

        private static List<DBDBusinessModel> AddCosmetic() 
        {
            List<DBDBusinessModel> model = new List<DBDBusinessModel>();

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Cosmetic,
                TSIC = "20232",
                BusinessName = "การผลิตเครื่องหอม เครื่องสำอาง และผลิตภัณฑ์ในห้องน้ำ",
                InfoTitle = "การผลิตเครื่องหอม เครื่องสำอาง และผลิตภัณฑ์ในห้องน้ำ",
                InfoMessage = "การผลิตน้ำหอมและผลิตภัณฑ์ในห้องน้ำ เช่น น้ำหอมและเครื่องสำอาง ครีมกันแดดและครีมทาผิว ผลิตภัณฑ์ตกแต่งเล็บมือและเล็บเท้า แชมพูสระผม น้ำยาเคลือบเส้นผม ยาดัดและยืดผม ยาสีฟัน ผลิตภัณฑ์สำหรับอนามัยในช่องปากและสารยึดเกาะทางทันตกรรม ครีมโกนหนวด รวมทั้งน้ำยาก่อนและหลังโกนหนวด ยาระงับกลิ่นกาย เกลืออาบน้ำ และครีมกำจัดขน",
            });

            return model;
        }

        private static List<DBDBusinessModel> AddTourism() 
        {
            List<DBDBusinessModel> model = new List<DBDBusinessModel>();

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Tourism,
                TSIC = "79110",
                BusinessName = "ตัวแทนธุรกิจการเดินทาง",
                InfoTitle = "ตัวแทนธุรกิจการเดินทาง",
                InfoMessage = "บริการของธุรกิจตัวแทนที่เกี่ยวข้องเบื้องต้นในการขายหรือบริการด้านการเดินทาง การท่องเที่ยว การจัดหาพาหนะและที่พักแรมให้แก่สาธารณชนทั่วไปและแก่ลูกค้าทางธุรกิจ",
            });
            
            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Tourism,
                TSIC = "79120",
                BusinessName = "ธุรกิจจัดนำเที่ยว",
                InfoTitle = "ธุรกิจจัดนำเที่ยว",
                InfoMessage = "การจัดรายการนำเที่ยวซึ่งขายผ่านตัวแทนธุรกิจการเดินทาง หรือขายโดยธุรกิจจัดนำเที่ยวโดยตรง รายการนำเที่ยวอาจรวมถึงการจัดหาพาหนะ ที่พักแรมอาหารและการเข้าชมพิพิธภัณฑ์ สถานที่ทางประวัติศาสตร์หรือวัฒนธรรม การแสดงมหรสพ ดนตรีหรือกิจกรรมกีฬา รวมถึงการพาคนไปประกอบพิธีฮัจย์ และฮุมเราะห์",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Tourism,
                TSIC = "79901",
                BusinessName = "กิจกรรมของมัคคุเทศก์",
                InfoTitle = "กิจกรรมของมัคคุเทศก์",
                InfoMessage = "การบริการของมัคคุเทศก์",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Tourism,
                TSIC = "79909",
                BusinessName = "กิจกรรมบริการสำรองอื่นๆและกิจกรรมที่เกี่ยวข้องซึ่งมิได้ จัดประเภทไว้ในที่อื่น",
                InfoTitle = "กิจกรรมบริการสำรองอื่นๆและกิจกรรมที่เกี่ยวข้องซึ่งมิได้ จัดประเภทไว้ในที่อื่น",
                InfoMessage = "การบริการสำรองอื่น ๆ ที่เกี่ยวข้องกับการท่องเที่ยว ได้แก่ สำรองการเดินทางโรงแรม ภัตตาคาร การให้เช่ารถ การเข้าชมสถานที่ต่าง ๆ ด้านความบันเทิงและการกีฬา ฯลฯ การบริการธุรกิจการจัดสรรแบ่งเวลาในการเข้าใช้ที่พัก กิจกรรมการขายตั๋วเข้าชมภาพยนตร์ กีฬาและความเพลิดเพลินอื่น ๆ และกิจกรรมด้านการบันเทิง การจัดบริการช่วยเหลือนักท่องเที่ยว การจัดหาข้อมูลสารสนเทศเกี่ยวกับการท่องเที่ยวให้นักท่องเที่ยว",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Tourism,
                TSIC = "93210",
                BusinessName = "กิจกรรมด้านสวนสนุกและธีมปาร์ค",
                InfoTitle = "กิจกรรมด้านสวนสนุกและธีมปาร์ค",
                InfoMessage = "กิจกรรมด้านสวนสนุกหรือธีมปาร์ค รวมไปถึงการดำเนินงานเกี่ยวกับสิ่งดึงดูดความน่าสนใจประเภทต่าง ๆ เช่น การเล่นเครื่องยนต์บังคับ การเล่นเรือเกม การแสดง การจัดนิทรรศการตามแนวคิดและการจัดสถานที่ปิกนิก",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Tourism,
                TSIC = "93291",
                BusinessName = "กิจกรรมสวนพักผ่อนหย่อนใจและชายหาด",
                InfoTitle = "กิจกรรมสวนพักผ่อนหย่อนใจและชายหาด",
                InfoMessage = "กิจกรรมสวนพักผ่อนหย่อนใจและชายหาด รวมถึงการให้เช่าสิ่งอำนวยความสะดวก เช่น ห้องอาบน้ำ ตู้เก็บของ เก้าอี้ ฯลฯ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Tourism,
                TSIC = "93292",
                BusinessName = "กิจกรรมการแสดงโชว์เพื่อความบันเทิงและการนันทนาการ",
                InfoTitle = "กิจกรรมการแสดงโชว์เพื่อความบันเทิงและการนันทนาการ",
                InfoMessage = "การดำเนินงานเกี่ยวกับการแสดงโชว์ดอกไม้ไฟ แสงและเสียง การดำเนินงานเกี่ยวกับการแสดงมอเตอร์ไซค์ไต่ถัง การสู้วัวกระทิง การแสดงความสามารถในการขี่ม้าและใช้ห่วงเชือกคล้องวัวและการแสดงอื่น ๆ เพื่อความบันเทิงและการนันทนาการ กิจกรรมของผู้ผลิตและผู้จัดการแสดงโชว์ (ซึ่งนอกเหนือไปจากการจัดงานทางศิลปะหรือการแข่งขันกีฬาทุกชนิด) ที่มีหรือไม่มีสิ่งอำนวยความสะดวก",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Tourism,
                TSIC = "93293",
                BusinessName = "กิจกรรมการดำเนินงานร้านเกมและตู้เกมหยอดเหรียญ",
                InfoTitle = "กิจกรรมการดำเนินงานร้านเกมและตู้เกมหยอดเหรียญ",
                InfoMessage = "การดำเนินงานร้านเกมทั้งออนไลน์และไม่ออนไลน์ การดำเนินงานเกี่ยวกับตู้เกมหยอดเหรียญ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Tourism,
                TSIC = "93299",
                BusinessName = "กิจกรรมด้านความบันเทิงและการนันทนาการอื่นๆซึ่งมิได้ จัดประเภทไว้ในที่อื่น",
                InfoTitle = "กิจกรรมด้านความบันเทิงและการนันทนาการอื่นๆซึ่งมิได้ จัดประเภทไว้ในที่อื่น",
                InfoMessage = "กิจกรรมต่าง ๆ เหล่านี้ได้แก่ การดำเนินงานเกี่ยวกับสิ่งอำนวยความสะดวกด้านนันทนาการในการเดินทาง เช่น ที่จอดเรือสำราญกีฬา การดำเนินงานเกี่ยวกับสกีภูเขา การให้เช่าอุปกรณ์เพื่อการนันทนาการและเพื่อความเพลิดเพลิน ซึ่งเป็นส่วนหนึ่งของสิ่งอำนวยความสะดวกด้านนันทนาการ การดำเนินงานเกี่ยวกับดิสโกเทคและฟลอร์เต้นรำ และกิจกรรมด้านความบันเทิงและนันทนาการอื่น ๆ (ยกเว้น สวนสนุกและธีมปาร์ค) ซึ่งมิได้จัดประเภทไว้ในที่อื่น เช่น บริการตู้เพลง การให้บริการฟังเพลงและร้องเพลงโดยคาราโอเกะ",
            });

            return model;
        }

        private static List<DBDBusinessModel> AddSoftwareHouse()
        {
            List<DBDBusinessModel> model = new List<DBDBusinessModel>();

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.SoftwareHouse,
                TSIC = "58201",
                BusinessName = "การจัดทำซอฟต์แวร์สำเร็จรูป",
                InfoTitle = "การจัดทำซอฟต์แวร์สำเร็จรูป",
                InfoMessage = "การจัดทำซอฟต์แวร์เกมคอมพิวเตอร์สำเร็จรูป เป็นการจัดทำที่มีวัตถุประสงค์เพื่อนำไปเล่นกับคอมพิวเตอร์ทุกระบบ รวมทั้ง บนอินเทอร์เน็ต โดยการชำระเงิน อาจทำในรูปแบบของสมาชิกหรือชำระในการเล่นแต่ละครั้ง Role - Playing Games(RPGs) เกมกลยุทธ์ เกมผจญภัย เกมสำหรับเด็ก ฯลฯ การจัดทำหรือพัฒนาซอฟต์แวร์เกมสำเร็จรูปที่สามารถดาวน์โหลดและจัดเก็บลงในอุปกรณ์ เพื่อการติดตั้ง หรือใช้งานต่อไป",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.SoftwareHouse,
                TSIC = "58202",
                BusinessName = "การจัดทำซอฟต์แวร์สำเร็จรูป(ยกเว้นซอฟต์แวร์เกมสำเร็จรูป)",
                InfoTitle = "การจัดทำซอฟต์แวร์สำเร็จรูป(ยกเว้นซอฟต์แวร์เกมสำเร็จรูป)",
                InfoMessage = "การจัดทำซอฟต์แวร์ระบบ ทั้งที่เป็นโปรแกรมสำเร็จรูปและที่สามารถดาวน์โหลดและจัดเก็บลงในอุปกรณ์เพื่อการติดตั้งหรือใช้งานต่อไป ซอฟต์แวร์ระบบปฏิบัติการซอฟต์แวร์ระบบเครือข่าย ซอฟต์แวร์จัดการฐานข้อมูล ซอฟต์แวร์ที่เป็นเครื่องมือในการพัฒนาโปรแกรมและภาษา ชุดคำสั่งโปรแกรมประยุกต์ที่ใช้ในการเพิ่มประสิทธิภาพทางธุรกิจหรือที่ใช้ในบ้านเพื่อความบันเทิงหรือการศึกษา(รวมถึงโปรแกรมประยุกต์ที่ใช้ในสำนักงาน เช่น โปรแกรมประมวลผลคำ โปรแกรมสเปรดชีทหรือโปรแกรมฐานข้อมูลอย่างง่าย โปรแกรมกราฟฟิก โปรแกรมจัดการโครงการ โปรแกรมการฝึกอบรมผ่านทางคอมพิวเตอร์ ฯลฯ) โปรแกรมประยุกต์ที่ใช้ในการดำเนินธุรกิจทั่ว ๆ ไปเป็นโปรแกรมที่ออกแบบมาเพื่อใช้ดำเนินงานหรือจัดการกระบวนการทางธุรกิจ ซึ่งไม่ได้เจาะจงใช้กับอุตสาหกรรมใดอุตสาหกรรมหนึ่งโดยเฉพาะ เช่น โปรแกรมบัญชี โปรแกรมจัดการทรัพยากรมนุษย์ โปรแกรมจัดการลูกค้าสัมพันธ์ โปรแกรมระบบ GIS โปรแกรมออกแบบเว็บไซต์ โปรแกรมประยุกต์ที่ใช้ในการดำเนินธุรกิจเฉพาะด้านเป็นโปรแกรมที่ใช้ดำเนินงานในอุตสาหกรรมใดอุตสาหกรรมหนึ่งโดยเฉพาะ เช่น การผลิต การค้าปลีก การดูแลสุขภาพ วิศวกรรม ร้านอาหาร โปรแกรมอำนวยความสะดวกเป็นโปรแกรมที่ใช้ในการดำเนินงานเฉพาะด้านมากๆ เช่น โปรแกรมบีบอัดข้อมูล โปรแกรมป้องกันไวรัส โปรแกรมเครื่องมือค้นหารูปแบบอักษร โปรแกรมอ่านไฟล์ โปรแกรมจดจำเสียง โปรแกรมประยุกต์อื่น ๆซึ่งมิได้จัดประเภทไว้ในที่อื่น การจัดทำหรือพัฒนาซอฟต์แวร์สำเร็จรูปทุกชนิดที่ใช้งานผ่านระบบออนไลน์ โดยสามารถเข้าใช้งานโปรแกรมผ่านทางคอมพิวเตอร์ อุปกรณ์คอมพิวเตอร์พกพาขนาดเล็ก(PDA) หรือเครื่องมืออื่น ๆ ที่สามารถออนไลน์ได้ โดยไม่ต้องติดตั้งโปรแกรมดังกล่าวลงในเครื่อง เช่น Windows Live",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.SoftwareHouse,
                TSIC = "62011",
                BusinessName = "กิจกรรมการจัดทำโปรแกรมเว็บเพจและเครือข่ายตามวัตถุประสงค์ของผู้ใช้",
                InfoTitle = "กิจกรรมการจัดทำโปรแกรมเว็บเพจและเครือข่ายตามวัตถุประสงค์ของผู้ใช้",
                InfoMessage = "การออกแบบโครงสร้างและเนื้อหาของเว็บเพจและ/หรือการเขียนโปรแกรมคอมพิวเตอร์ที่จำเป็นในการสร้างและใช้งานเว็บเพจที่จัดทำขึ้นตามวัตถุประสงค์ของผู้ใช้ การออกแบบ พัฒนาและใช้งานระบบเครือข่าย เช่น อินทราเน็ตเอ็กซ์ทราเน็ตและเครือข่ายเสมือนส่วนตัว การบริการออกแบบและพัฒนาระบบความปลอดภัยของเครือข่าย ได้แก่ การออกแบบ การพัฒนาและการนำซอฟต์แวร์และฮาร์ดแวร์มาใช้เพื่อควบคุมการเข้าถึงข้อมูลและโปรแกรมและเพื่อการแลกเปลี่ยนข้อมูลอย่างปลอดภัยระหว่างเครือข่าย",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.SoftwareHouse,
                TSIC = "62012",
                BusinessName = "กิจกรรมการจัดทำโปรแกรมคอมพิวเตอร์ตามวัตถุประสงค์ของผู้ใช้ (ยกเว้นโปรแกรมเว็บเพจและเครือข่าย)",
                InfoTitle = "กิจกรรมการจัดทำโปรแกรมคอมพิวเตอร์ตามวัตถุประสงค์ของผู้ใช้ (ยกเว้นโปรแกรมเว็บเพจและเครือข่าย)",
                InfoMessage = "การพัฒนาซอฟต์แวร์เพื่อให้ตรงกับความต้องการของผู้ใช้ การออกแบบโครงสร้างและเนื้อหาโปรแกรมคอมพิวเตอร์และ/หรือการเขียนโปรแกรมคอมพิวเตอร์ที่จำเป็นในการสร้างและใช้งาน ซอฟต์แวร์ระบบ (รวมถึงโปรแกรมส่วนปรับปรุงและโปรแกรมเสริม) ซอฟต์แวร์ประยุกต์ (รวมถึงโปรแกรมส่วนปรับปรุงและโปรแกรมเสริม) ฐานข้อมูล การแก้ไขและการปรับแต่งซอฟต์แวร์ที่มีอยู่เพื่อสามารถนำไปใช้งานกับระบบสารสนเทศของลูกค้าได้อย่างเหมาะสมรวมถึงการให้ความช่วยเหลือและแก้ไขปัญหาทางด้านซอฟต์แวร์",
            });

            //model.Add(new DBDBusinessModel
            //{
            //    BusinessType = BusinessType.SoftwareHouse,
            //    TSIC = "62021",
            //    BusinessName = "กิจกรรมการให้คำปรึกษาทางด้านฮาร์ดแวร์",
            //    InfoTitle = "กิจกรรมการให้คำปรึกษาทางด้านฮาร์ดแวร์",
            //    InfoMessage = "การให้คำปรึกษาทางด้านเทคโนโลยีสารสนเทศที่เกี่ยวข้องกับฮาร์ดแวร์ เช่น ความต้องการของระบบทางด้านฮาร์ดแวร์และการบำรุงรักษาฮาร์ดแวร์ การบริการแบบครบวงจร การบริการรวมระบบคอมพิวเตอร์ เช่น การวิเคราะห์ระบบปัจจุบันของลูกค้า การประเมินความต้องการระบบในปัจจุบันและอนาคต การบริการทางเทคนิคในการแก้ปัญหาเฉพาะทางให้แก่ลูกค้า รวมถึงจัดทำเอกสารเพื่อศึกษาความสามารถในการรองรับการใช้งาน ประสิทธิภาพการทำงานหรือระบบรักษาความปลอดภัย",
            //});

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.SoftwareHouse,
                TSIC = "62022",
                BusinessName = "กิจกรรมการให้คำปรึกษาทางด้านซอฟต์แวร์",
                InfoTitle = "กิจกรรมการให้คำปรึกษาทางด้านซอฟต์แวร์",
                InfoMessage = "การให้คำปรึกษาทางด้านเทคโนโลยีสารสนเทศที่เกี่ยวข้องกับระบบเทคโนโลยีสารสนเทศและซอฟต์แวร์ ความต้องการของระบบทางด้านซอฟต์แวร์และการจัดซื้อซอฟต์แวร์ ความปลอดภัยของระบบ การบริการความรู้ความชำนาญทางด้านซอฟต์แวร์และบริการสนับสนุนทางเทคนิค การให้ความช่วยเหลือลูกค้าในการใช้งานหรือแก้ปัญหาด้านซอฟต์แวร์ การบริการอัพเกรด",
            });

            //model.Add(new DBDBusinessModel
            //{
            //    BusinessType = BusinessType.SoftwareHouse,
            //    TSIC = "62023",
            //    BusinessName = "กิจกรรมการจัดการสิ่งอำนวยความสะดวกด้านคอมพิวเตอร์",
            //    InfoTitle = "กิจกรรมการจัดการสิ่งอำนวยความสะดวกด้านคอมพิวเตอร์",
            //    InfoMessage = "การจัดการและดูแลโครงสร้างระบบเทคโนโลยีสารสนเทศพื้นฐาน ณ สถานที่ของลูกค้า รวมถึงฮาร์ดแวร์ ซอฟต์แวร์และระบบเครือข่าย การจัดการและดูแลระบบเครือข่ายสื่อสารและการเชื่อมต่ออุปกรณ์ฮาร์ดแวร์สำหรับวิเคราะห์ปัญหาด้านเครือข่าย การเก็บรวบรวมสถิติเกี่ยวกับประสิทธิภาพ และการใช้งานระบบ เพื่อใช้ในการบริหารจัดการระบบเครือข่ายและปรับปรุงประสิทธิภาพการสื่อสารข้อมูลในระบบเครือข่ายให้คล่องตัวยิ่งขึ้น รวมถึงระบบรักษาความปลอดภัยที่ควบคุมจากระยะทางไกล หรือบริการด้านความปลอดภัยที่เกี่ยวข้อง การจัดการและดำเนินงานระบบคอมพิวเตอร์ของลูกค้าประจำวัน",
            //});

            //model.Add(new DBDBusinessModel
            //{
            //    BusinessType = BusinessType.SoftwareHouse,
            //    TSIC = "62090",
            //    BusinessName = "กิจกรรมการบริการเทคโนโลยีสารสนเทศและคอมพิวเตอร์อื่นๆ",
            //    InfoTitle = "กิจกรรมการบริการเทคโนโลยีสารสนเทศและคอมพิวเตอร์อื่นๆ",
            //    InfoMessage = "กิจกรรมอื่น ๆ ที่เกี่ยวข้องทางด้านเทคโนโลยีสารสนเทศและคอมพิวเตอร์ ซึ่งมิได้จัดประเภทไว้ในที่อื่น เช่น การกู้คืนระบบคอมพิวเตอร์ (โดยเน้นเรื่องความเสียหายจากภัยพิบัติที่จะมีผลกระทบกับระบบสารสนเทศ) การติดตั้งซอฟต์แวร์ การติดตั้งคอมพิวเตอร์ส่วนบุคคลและอุปกรณ์ต่อพ่วงและการบำรุงรักษาระบบคอมพิวเตอร์",
            //});

            return model;
        }

        private static List<DBDBusinessModel> AddCosmeticOnline() 
        {
            List<DBDBusinessModel> model = new List<DBDBusinessModel>();

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.CosmeticOnline,
                TSIC = "46103",
                BusinessName = "การขายส่งสิ่งทอเสื้อผ้ารองเท้าเครื่องหนังและของใช้ในครัวเรือนโดยได้รับค่าตอบแทนหรือตามสัญญาจ้าง",
                InfoTitle = "การขายส่งสิ่งทอเสื้อผ้ารองเท้าเครื่องหนังและของใช้ในครัวเรือนโดยได้รับค่าตอบแทนหรือตามสัญญาจ้าง",
                InfoMessage = "กิจกรรมขายส่งสิ่งทอ เสื้อผ้า รองเท้า เครื่องหนังและของใช้ในครัวเรือน โดยได้รับค่าตอบแทนหรือตามสัญญาจ้าง ผ้าและของใช้ในครัวเรือนที่ทำจากผ้ารวมถึงอุปกรณ์ตัดเย็บ เช่น เข็ม ด้ายเย็บผ้า เครื่องแต่งกาย ชุดกีฬา รองเท้า เครื่องหนัง เครื่องประกอบเครื่องแต่งกาย เช่น ถุงมือ เนคไท สายโยง สายรั้งกางเกง และของที่ทำจากขนสัตว์ เฟอร์นิเจอร์ เครื่องใช้ในครัวเรือน เครื่องใช้อิเล็กทรอนิกส์ชนิดใช้ในครัวเรือน เช่น วิทยุและโทรทัศน์ เครื่องสเตอริโอ วีดิโอเกมคอนโซล อุปกรณ์สำหรับให้แสงสว่าง ของมีคม เครื่องเคลือบดินเผา และเครื่องแก้ว เครื่องใช้ที่ทำจากไม้ เครื่องสานและเครื่องใช้ที่ทำจากไม้ก๊อก ฯลฯ สินค้าทางเภสัชภัณฑ์และเคมีภัณฑ์ทางยา เครื่องหอม เครื่องสำอาง และผลิตภัณฑ์ในห้องน้ำ จักรยาน ชิ้นส่วนและอุปกรณ์เสริม จักรยาน เครื่องหนังและเครื่องใช้ในการเดินทาง เครื่องเขียน หนังสือ หนังสือพิมพ์ นิตยสาร นาฬิกา เครื่องประดับ เครื่องดนตรี อุปกรณ์กีฬา เกม และของเล่น ร่ม อุปกรณ์การถ่ายภาพ เครื่องมือทางทัศนศาสตร์และเลนส์ (แว่นตากันแดด กล้องสองตา แว่นขยาย) แถบวีดิทัศน์ ซีดี ดีวีดี ที่บันทึกข้อมูลแล้ว ทั้งนี้รวมถึงวิธีการขายทอดตลาดสินค้าดังกล่าว",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.CosmeticOnline,
                TSIC = "47911",
                BusinessName = "การขายปลีกโดยการรับสั่งสินค้าทางไปรษณีย์โทรทัศน์วิทยุ และโทรศัพท์",
                InfoTitle = "การขายปลีกโดยการรับสั่งสินค้าทางไปรษณีย์โทรทัศน์วิทยุ และโทรศัพท์",
                InfoMessage = "การขายปลีกโดยการรับสั่งสินค้าทางไปรษณีย์ โทรทัศน์ วิทยุและโทรศัพท์และผู้ขายจะทำการจัดส่งสินค้ากับให้ลูกค้า โดยผู้ซื้อจะทำการตัดสินใจซื้อโดยพิจารณาจากโฆษณา ใบรายการสินค้า (shopping channel) ได้แก่ การขายสินค้าประเภทอาหาร เครื่องดื่มและผลิตภัณฑ์ยาสูบ สิ่งทอ เสื้อผ้า รองเท้าและเครื่องหนัง สินค้าทางเภสัชภัณฑ์และทางการแพทย์ เครื่องหอมและเครื่องสำอาง คอมพิวเตอร์ อุปกรณ์สื่อสารโทรคมนาคม เครื่องใช้ไฟฟ้าและอิเล็กทรอนิกส์ สินค้าวัฒนธรรมและพักผ่อนหย่อนใจ สินค้าทางเภสัชภัณฑ์และทางการแพทย์ เครื่องหอมและเครื่องสำอาง เป็นต้น",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.CosmeticOnline,
                TSIC = "47912",
                BusinessName = "การขายปลีกทางอินเทอร์เน็ต",
                InfoTitle = "การขายปลีกทางอินเทอร์เน็ต",
                InfoMessage = "การขายปลีกทางอินเทอร์เน็ต โดยผู้ซื้อจะตัดสินใจซื้อโดยพิจารณาจากโฆษณาและข้อมูลบนอินเทอร์เน็ต โดยปกติจะผ่านกระบวนการที่จัดไว้เป็นการเฉพาะในเว็บไซต์และผลิตภัณฑ์ที่สั่งซื้อจะดาวน์โหลดผ่านทางอินเทอร์เน็ตหรืออาจทำการจัดส่งสินค้าให้กับลูกค้าก็ได้ รวมถึงการขายปลีกโดยการประมูลขายปลีกสินค้าทางอินเทอร์เน็ต ได้แก่ การขายสินค้าประเภทอาหาร เครื่องดื่มและผลิตภัณฑ์ยาสูบ สิ่งทอ เสื้อผ้า รองเท้าและเครื่องหนัง สินค้าทางเภสัชภัณฑ์และทางการแพทย์ เครื่องหอมและเครื่องสำอาง คอมพิวเตอร์ อุปกรณ์สื่อสารโทรคมนาคม เครื่องใช้ไฟฟ้าและอิเล็กทรอนิกส์ สินค้าวัฒนธรรมและพักผ่อนหย่อนใจ สินค้าทางเภสัชภัณฑ์และทางการแพทย์ เครื่องหอมและเครื่องสำอาง เป็นต้น ทั้งนี้รวมถึงวิธีการ ขายทอดตลาดสินค้าดังกล่าว",
            });

            return model;
        }

        private static List<DBDBusinessModel> AddFabricECommerce()
        {
            List<DBDBusinessModel> model = new List<DBDBusinessModel>();

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.FabricECommerce,
                TSIC = "46103",
                BusinessName = "การขายส่งสิ่งทอเสื้อผ้ารองเท้าเครื่องหนังและของใช้ในครัวเรือนโดยได้รับค่าตอบแทนหรือตามสัญญาจ้าง",
                InfoTitle = "การขายส่งสิ่งทอเสื้อผ้ารองเท้าเครื่องหนังและของใช้ในครัวเรือนโดยได้รับค่าตอบแทนหรือตามสัญญาจ้าง",
                InfoMessage = "กิจกรรมขายส่งสิ่งทอ เสื้อผ้า รองเท้า เครื่องหนังและของใช้ในครัวเรือน โดยได้รับค่าตอบแทนหรือตามสัญญาจ้าง ผ้าและของใช้ในครัวเรือนที่ทำจากผ้ารวมถึงอุปกรณ์ตัดเย็บ เช่น เข็ม ด้ายเย็บผ้า เครื่องแต่งกาย ชุดกีฬา รองเท้า เครื่องหนัง เครื่องประกอบเครื่องแต่งกาย เช่น ถุงมือ เนคไท สายโยง สายรั้งกางเกง และของที่ทำจากขนสัตว์ เฟอร์นิเจอร์ เครื่องใช้ในครัวเรือน เครื่องใช้อิเล็กทรอนิกส์ชนิดใช้ในครัวเรือน เช่น วิทยุและโทรทัศน์ เครื่องสเตอริโอ วีดิโอเกมคอนโซล อุปกรณ์สำหรับให้แสงสว่าง ของมีคม เครื่องเคลือบดินเผา และเครื่องแก้ว เครื่องใช้ที่ทำจากไม้ เครื่องสานและเครื่องใช้ที่ทำจากไม้ก๊อก ฯลฯ สินค้าทางเภสัชภัณฑ์และเคมีภัณฑ์ทางยา เครื่องหอม เครื่องสำอาง และผลิตภัณฑ์ในห้องน้ำ จักรยาน ชิ้นส่วนและอุปกรณ์เสริม จักรยาน เครื่องหนังและเครื่องใช้ในการเดินทาง เครื่องเขียน หนังสือ หนังสือพิมพ์ นิตยสาร นาฬิกา เครื่องประดับ เครื่องดนตรี อุปกรณ์กีฬา เกม และของเล่น ร่ม อุปกรณ์การถ่ายภาพ เครื่องมือทางทัศนศาสตร์และเลนส์ (แว่นตากันแดด กล้องสองตา แว่นขยาย) แถบวีดิทัศน์ ซีดี ดีวีดี ที่บันทึกข้อมูลแล้ว ทั้งนี้รวมถึงวิธีการขายทอดตลาดสินค้าดังกล่าว",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.FabricECommerce,
                TSIC = "47911",
                BusinessName = "การขายปลีกโดยการรับสั่งสินค้าทางไปรษณีย์โทรทัศน์วิทยุ และโทรศัพท์",
                InfoTitle = "การขายปลีกโดยการรับสั่งสินค้าทางไปรษณีย์โทรทัศน์วิทยุ และโทรศัพท์",
                InfoMessage = "การขายปลีกโดยการรับสั่งสินค้าทางไปรษณีย์ โทรทัศน์ วิทยุและโทรศัพท์และผู้ขายจะทำการจัดส่งสินค้ากับให้ลูกค้า โดยผู้ซื้อจะทำการตัดสินใจซื้อโดยพิจารณาจากโฆษณา ใบรายการสินค้า (shopping channel) ได้แก่ การขายสินค้าประเภทอาหาร เครื่องดื่มและผลิตภัณฑ์ยาสูบ สิ่งทอ เสื้อผ้า รองเท้าและเครื่องหนัง สินค้าทางเภสัชภัณฑ์และทางการแพทย์ เครื่องหอมและเครื่องสำอาง คอมพิวเตอร์ อุปกรณ์สื่อสารโทรคมนาคม เครื่องใช้ไฟฟ้าและอิเล็กทรอนิกส์ สินค้าวัฒนธรรมและพักผ่อนหย่อนใจ สินค้าทางเภสัชภัณฑ์และทางการแพทย์ เครื่องหอมและเครื่องสำอาง เป็นต้น",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.FabricECommerce,
                TSIC = "47912",
                BusinessName = "การขายปลีกทางอินเทอร์เน็ต",
                InfoTitle = "การขายปลีกทางอินเทอร์เน็ต",
                InfoMessage = "การขายปลีกทางอินเทอร์เน็ต โดยผู้ซื้อจะตัดสินใจซื้อโดยพิจารณาจากโฆษณาและข้อมูลบนอินเทอร์เน็ต โดยปกติจะผ่านกระบวนการที่จัดไว้เป็นการเฉพาะในเว็บไซต์และผลิตภัณฑ์ที่สั่งซื้อจะดาวน์โหลดผ่านทางอินเทอร์เน็ตหรืออาจทำการจัดส่งสินค้าให้กับลูกค้าก็ได้ รวมถึงการขายปลีกโดยการประมูลขายปลีกสินค้าทางอินเทอร์เน็ต ได้แก่ การขายสินค้าประเภทอาหาร เครื่องดื่มและผลิตภัณฑ์ยาสูบ สิ่งทอ เสื้อผ้า รองเท้าและเครื่องหนัง สินค้าทางเภสัชภัณฑ์และทางการแพทย์ เครื่องหอมและเครื่องสำอาง คอมพิวเตอร์ อุปกรณ์สื่อสารโทรคมนาคม เครื่องใช้ไฟฟ้าและอิเล็กทรอนิกส์ สินค้าวัฒนธรรมและพักผ่อนหย่อนใจ สินค้าทางเภสัชภัณฑ์และทางการแพทย์ เครื่องหอมและเครื่องสำอาง เป็นต้น ทั้งนี้รวมถึงวิธีการ ขายทอดตลาดสินค้าดังกล่าว",
            });

            return model;
        }

        private static List<DBDBusinessModel> AddSparPower()
        {
            List<DBDBusinessModel> model = new List<DBDBusinessModel>();

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.SparPower,
                TSIC = "35101",
                BusinessName = "การผลิตและการส่งไฟฟ้า",
                InfoTitle = "การผลิตและการส่งไฟฟ้า",
                InfoMessage = "การผลิตกระแสไฟฟ้าจำนวนมาก การส่งกระแสไฟฟ้าจากแหล่งผลิตไปยังศูนย์จ่าย และส่งไปยังผู้ใช้ปลายทาง ซึ่งรวมถึงการสร้างสิ่งอำนวยความสะดวกในการผลิตพลังงานไฟฟ้า รวมทั้งความร้อน นิวเคลียร์ ไฟฟ้าจากพลังน้ำ กังหันก๊าซ ดีเซล พลังงานแสงอาทิตย์ (solar cell) และพลังงานหมุนเวียนและพลังงานทดแทนอื่น ๆ การติดตั้งระบบการส่งกระแสไฟฟ้า ซึ่งส่งจากแหล่งผลิตไปยังระบบการจ่ายกระแสไฟฟ้า เช่น การไฟฟ้าฝ่ายผลิตแห่งประเทศไทยและหน่วยงานอื่น ๆ ซึ่งผลิตและจำหน่ายไฟฟ้าให้แก่ผู้ใช้ทั่วไป แต่ไม่ได้เป็นหน่วยงานของการไฟฟ้าฝ่ายผลิตแห่งประเทศไทย",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.SparPower,
                TSIC = "35102",
                BusinessName = "การจ่ายไฟฟ้า",
                InfoTitle = "การจ่ายไฟฟ้า",
                InfoMessage = "การจัดระบบจ่ายไฟฟ้า (เช่น สายไฟ เสาไฟฟ้า มิเตอร์และการต่อสายไฟ) ซึ่งจ่ายกระแสไฟฟ้าจากแหล่งผลิตไฟฟ้า หรือระบบการจ่ายกระแสไฟฟ้าให้แก่ผู้บริโภค เช่น การไฟฟ้านครหลวง การไฟฟ้าส่วนภูมิภาคและหน่วยงานอื่น ๆ ซึ่งดำเนินกิจการหลักเกี่ยวกับการจ่าย และการจำหน่ายพลังงานไฟฟ้าที่รับซื้อมาจากการไฟฟ้าฝ่ายผลิตแห่งประเทศไทยหรือจากโรงผลิตไฟฟ้าแหล่งอื่น ๆ การขายกระแสไฟฟ้าให้แก่ผู้บริโภค กิจกรรมของตัวแทนหรือตัวแทนผู้จำหน่ายกระแสไฟฟ้าผ่านระบบการจัดจำหน่ายโดยผู้อื่น การดำเนินงานเกี่ยวกับกิจการแลกเปลี่ยนพลังงานไฟฟ้าและการจ่ายพลังงานไฟฟ้า",
            });

            return model;
        }

        private static List<DBDBusinessModel> AddEducation() 
        {
            List<DBDBusinessModel> model = new List<DBDBusinessModel>();

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Education,
                TSIC = "85410",
                BusinessName = "การศึกษาด้านกีฬาและนันทนาการ",
                InfoTitle = "การศึกษาด้านกีฬาและนันทนาการ",
                InfoMessage = "กิจกรรมการเรียนการสอนด้านกรีฑาสำหรับผู้สนใจ เช่น จัดในรูปค่ายการเรียนรู้หรือโรงเรียนเฉพาะทาง รวมทั้งค่ายฝึกสอนกีฬาแบบพักแรมและภาคกลางวัน ทั้งนี้ไม่รวมการเรียนการสอนตามหลักสูตรปกติในโรงเรียน วิทยาลัยและมหาวิทยาลัย การจัดการเรียนการสอนอาจจัดตามแหล่งต่าง ๆ ได้อย่างหลากหลาย เช่น ในสถานที่ฝึกอบรม สถาบันการศึกษาหรืออื่น ๆ การจัดการเรียน การสอนในหมวดนี้ต้องมีการจัดเป็นระบบอย่างเป็นทางการ การศึกษาในกลุ่มนี้ครอบคลุมถึง การเรียนการสอนกีฬาประเภทต่าง ๆ (เบสบอล บาสเกตบอล คริกเก็ต ฟุตบอล ฯลฯ) การจัดค่าย การสอนเชียร์ลีดเดอร์ ยิมนาสติก ขี่ม้า ว่ายน้ำ การเป็นครูสอนกีฬาอาชีพ ครูสอนกีฬา ผู้ฝึกสอนกีฬา การสอนศิลปะการต่อสู้ การสอนเกมไพ่ (เช่น บริดจ์) และการสอนโยคะ (กิจกรรมของบุคคลที่เกี่ยวข้องกับการกีฬา)",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Education,
                TSIC = "85421",
                BusinessName = "กิจกรรมการเรียนการสอนด้านการเต้นรำ",
                InfoTitle = "กิจกรรมการเรียนการสอนด้านการเต้นรำ",
                InfoMessage = "การเต้นรำและโรงเรียนสอนเต้นรำ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Education,
                TSIC = "85422",
                BusinessName = "กิจกรรมการเรียนการสอนด้านดนตรี",
                InfoTitle = "กิจกรรมการเรียนการสอนด้านดนตรี",
                InfoMessage = "สถานที่จัดการสอนประเภทนี้อาจเรียกว่า โรงเรียน สตูดิโอและชั้นเรียน เป็นต้น รวมถึงการเรียนเปียโนและดนตรีชนิดต่าง ๆ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Education,
                TSIC = "85423",
                BusinessName = "กิจกรรมการเรียนการสอนด้านศิลปะ",
                InfoTitle = "กิจกรรมการเรียนการสอนด้านศิลปะ",
                InfoMessage = "สถานที่จัดการเรียนการสอนประเภทนี้อาจเรียกว่า โรงเรียน สตูดิโอและชั้นเรียน เป็นต้น เช่น โรงเรียนสอนศิลปะ ยกเว้น สถาบันด้านศิลปะ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Education,
                TSIC = "85429",
                BusinessName = "การศึกษาด้านวัฒนธรรมอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "การศึกษาด้านวัฒนธรรมอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "สถานที่จัดการเรียนการสอนประเภทนี้อาจเรียกว่า โรงเรียน สตูดิโอ และชั้นเรียน เป็นต้น เช่น โรงเรียนสอนการละคร (ยกเว้น สถาบันการละคร) โรงเรียนสอนศิลปะการแสดง (ยกเว้น สถาบันด้านศิลปะการแสดง) โรงเรียนสอนถ่ายรูป (ไม่เกี่ยวกับการค้า) และการศึกษาด้านวัฒนธรรมอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Education,
                TSIC = "85491",
                BusinessName = "กิจกรรมการเรียนการสอนภาษา",
                InfoTitle = "กิจกรรมการเรียนการสอนภาษา",
                InfoMessage = "การเรียนภาษาและการฝึกทักษะการพูด การเขียน การฟัง การอ่านในภาษาต่าง ๆ เช่น ภาษาอังกฤษ ภาษาจีน ภาษาญี่ปุ่น ฯลฯ ในสถานที่ฝึกอบรม สถาบันการศึกษา สถานประกอบการ หรือที่พัก",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Education,
                TSIC = "85492",
                BusinessName = "กิจกรรมการเรียนการสอนด้านเทคโนโลยีสารสนเทศ",
                InfoTitle = "กิจกรรมการเรียนการสอนด้านเทคโนโลยีสารสนเทศ",
                InfoMessage = "การเรียนการสอนด้านเทคโนโลยีสารสนเทศ เช่น การฝึกอบรมคอมพิวเตอร์ สถาบันฝึกอบรมด้านเทคโนโลยีสารสนเทศ",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Education,
                TSIC = "85493",
                BusinessName = "กิจกรรมการกวดวิชาทั่วไป",
                InfoTitle = "กิจกรรมการกวดวิชาทั่วไป",
                InfoMessage = "การให้บริการสอนเสริม การเตรียมสอบเข้ามหาวิทยาลัย การกวดวิชาทั่วไป การกวดวิชาเพื่อการสอบทางวิชาชีพ เช่น โรงเรียนกวดวิชา",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Education,
                TSIC = "85494",
                BusinessName = "กิจกรรมการเรียนการสอนตัดเสื้อผ้าและเสริมสวย",
                InfoTitle = "กิจกรรมการเรียนการสอนตัดเสื้อผ้าและเสริมสวย",
                InfoMessage = "การเรียนตัดเสื้อผ้าและเสริมสวย เช่น โรงเรียนสอนตัดเสื้อผ้า สถาบันเสริม ความงาม การฝึกอบรมตัดเสื้อผ้าและเสริมสวย",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Education,
                TSIC = "85495",
                BusinessName = "กิจกรรมการเรียนการสอนสปาบำบัด",
                InfoTitle = "กิจกรรมการเรียนการสอนสปาบำบัด",
                InfoMessage = "การเรียนสปาบำบัด ประกอบด้วยการฝึกอบรมในการเสริมสวยบำบัด การนวด เพื่อบำบัด การบำบัดด้วยน้ำ (วารีบำบัด) การบำบัดด้วยกลิ่นหอมธรรมชาติ (สุคนธบำบัด) โภชนบำบัดและสมาธิบำบัด",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Education,
                TSIC = "85496",
                BusinessName = "กิจกรรมการเรียนการสอนนวด",
                InfoTitle = "กิจกรรมการเรียนการสอนนวด",
                InfoMessage = "การเรียนนวด เช่น การฝึกอบรมนวดแผนไทย การฝึกอบรมนวด โรงเรียนนวดแผนไทย",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Education,
                TSIC = "85497",
                BusinessName = "กิจกรรมการเรียนการสอนขับขี่",
                InfoTitle = "กิจกรรมการเรียนการสอนขับขี่",
                InfoMessage = "การเรียนขับขี่ เช่น โรงเรียนสอนขับรถ โรงเรียนการบินที่ไม่ได้มุ่งสู่การสำเร็จประกาศนียบัตรอนุปริญญาหรือปริญญาบัตร",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.Education,
                TSIC = "85499",
                BusinessName = "การศึกษาอื่นๆซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "การศึกษาอื่นๆซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "การเตรียมความพร้อมเพื่อศึกษาต่อต่างประเทศ หลักสูตรเตรียมสอบวัดความรู้ และประสบการณ์ทางด้านวิชาชีพ การสอนการอ่านเร็ว การเรียนรู้ศาสนา การฝึกช่วยชีวิต การฝึกกู้ภัย การฝึกพูดในที่สาธารณะ การสอนทำอาหาร การศึกษาอื่น ๆ ที่ไม่ได้มุ่งสู่การสำเร็จประกาศนียบัตรอนุปริญญาหรือปริญญาบัตร",
            });

            return model;
        }

        private static List<DBDBusinessModel> AddSEC() 
        {
            List<DBDBusinessModel> model = new List<DBDBusinessModel>();

            //model.Add(new DBDBusinessModel
            //{
            //    BusinessType = BusinessType.SEC,
            //    TSIC = "58202",
            //    BusinessName = "การจัดทำซอฟต์แวร์สำเร็จรูป (ยกเว้นซอฟต์แวร์เกมสำเร็จรูป)",
            //    InfoTitle = "การจัดทำซอฟต์แวร์สำเร็จรูป (ยกเว้นซอฟต์แวร์เกมสำเร็จรูป)",
            //    InfoMessage = "การจัดทำซอฟต์แวร์ระบบ ทั้งที่เป็นโปรแกรมสำเร็จรูปและที่สามารถดาวน์โหลดและจัดเก็บลงในอุปกรณ์เพื่อการติดตั้งหรือใช้งานต่อไป ซอฟต์แวร์ระบบปฏิบัติการซอฟต์แวร์ระบบเครือข่าย ซอฟต์แวร์จัดการฐานข้อมูล ซอฟต์แวร์ที่เป็นเครื่องมือในการพัฒนาโปรแกรมและภาษา ชุดคำสั่งโปรแกรมประยุกต์ที่ใช้ในการเพิ่มประสิทธิภาพทางธุรกิจหรือที่ใช้ในบ้านเพื่อความบันเทิงหรือการศึกษา (รวมถึงโปรแกรมประยุกต์ที่ใช้ในสำนักงาน เช่น โปรแกรมประมวลผลคำ โปรแกรมสเปรดชีทหรือโปรแกรมฐานข้อมูลอย่างง่าย โปรแกรมกราฟฟิก โปรแกรมจัดการโครงการ โปรแกรมการฝึกอบรมผ่านทางคอมพิวเตอร์ ฯลฯ) โปรแกรมประยุกต์ที่ใช้ในการดำเนินธุรกิจทั่ว ๆ ไปเป็นโปรแกรมที่ออกแบบมาเพื่อใช้ดำเนินงานหรือจัดการกระบวนการทางธุรกิจ ซึ่งไม่ได้เจาะจงใช้กับอุตสาหกรรมใดอุตสาหกรรมหนึ่งโดยเฉพาะ เช่น โปรแกรมบัญชี โปรแกรมจัดการทรัพยากรมนุษย์ โปรแกรมจัดการลูกค้าสัมพันธ์ โปรแกรมระบบ GIS โปรแกรมออกแบบเว็บไซต์ โปรแกรมประยุกต์ที่ใช้ในการดำเนินธุรกิจเฉพาะด้านเป็นโปรแกรมที่ใช้ดำเนินงานในอุตสาหกรรมใดอุตสาหกรรมหนึ่งโดยเฉพาะ เช่น การผลิต การค้าปลีก การดูแลสุขภาพ วิศวกรรม ร้านอาหาร โปรแกรมอำนวยความสะดวกเป็นโปรแกรมที่ใช้ในการดำเนินงานเฉพาะด้านมากๆ เช่น โปรแกรมบีบอัดข้อมูล โปรแกรมป้องกันไวรัส โปรแกรมเครื่องมือค้นหารูปแบบอักษร โปรแกรมอ่านไฟล์ โปรแกรมจดจำเสียง โปรแกรมประยุกต์อื่น ๆซึ่งมิได้จัดประเภทไว้ในที่อื่น การจัดทำหรือพัฒนาซอฟต์แวร์สำเร็จรูปทุกชนิดที่ใช้งานผ่านระบบออนไลน์ โดยสามารถเข้าใช้งานโปรแกรมผ่านทางคอมพิวเตอร์ อุปกรณ์คอมพิวเตอร์พกพาขนาดเล็ก (PDA) หรือเครื่องมืออื่น ๆ ที่สามารถออนไลน์ได้ โดยไม่ต้องติดตั้งโปรแกรมดังกล่าวลงในเครื่อง เช่น Windows Live",
            //});

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.SEC,
                TSIC = "66191",
                BusinessName = "บริการที่ปรึกษาการลงทุน",
                InfoTitle = "บริการที่ปรึกษาการลงทุน",
                InfoMessage = "บริการที่ปรึกษาการลงทุน บริการที่ปรึกษาด้านการควบรวมกิจการ บริการที่ปรึกษาธุรกิจการเงินและธุรกิจเงินร่วมลงทุน บริการที่ปรึกษาด้านการฟื้นฟูกิจการ รวมทั้งจัดทำแผนฟื้นฟูกิจการข้อมูลการจัดตั้งนิติบุคคล เปรียบเทียบช่วงเวลา",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.SEC,
                TSIC = "66192",
                BusinessName = "กิจกรรมการประมวลผลและการเรียกชำระเงินสำหรับธุรกรรม ทางการเงิน",
                InfoTitle = "กิจกรรมการประมวลผลและการเรียกชำระเงินสำหรับธุรกรรม ทางการเงิน",
                InfoMessage = "กิจกรรมธุรกรรมทางการเงินและธุรกรรมการชำระเงิน รวมถึงธุรกรรมเกี่ยวกับบัตรเครดิต",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.SEC,
                TSIC = "66193",
                BusinessName = "บริการดูแลและรักษาหลักทรัพย์",
                InfoTitle = "บริการดูแลและรักษาหลักทรัพย์",
                InfoMessage = "บริการดูแลและรักษาหลักทรัพย์ รวมถึงบริการดูแลรักษาทรัพย์สินโดยได้รับค่าธรรมเนียมตอบแทนหรือตามสัญญาจ้าง",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.SEC,
                TSIC = "66199",
                BusinessName = "กิจกรรมอื่นๆที่ช่วยเสริมกิจกรรมการให้บริการทางการเงิน ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "กิจกรรมอื่นๆที่ช่วยเสริมกิจกรรมการให้บริการทางการเงิน ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "บริการที่ปรึกษาและนายหน้าการจำนองอสังหาริมทรัพย์ บริการจัดการดูแลทรัพย์สินบริการรับมอบหมายอำนาจในการจัดการทรัพย์สิน",
            });

            return model;
        }

        private static List<DBDBusinessModel> AddOrganicPlant() 
        {

            List<DBDBusinessModel> model = new List<DBDBusinessModel>();

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.OrganicPlant,
                TSIC = "01299",
                BusinessName = "การปลูกพืชยืนต้นประเภทอื่นๆซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "การปลูกพืชยืนต้นประเภทอื่นๆซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "การปลูกต้นไม้เพื่อนำมาแยกน้ำยางไม้ เช่น การปลูกต้นเมเปิล การปลูกต้นสน การปลูก ต้นยูคาลิปตัส การปลูกไม้กฤษณา และต้นสนที่ใช้ประดับในงานคริสต์มาส และการปลูกพืชยืนต้นประเภทอื่นๆ เช่น การทำสวน การทำสวนเกษตรผสมผสาน ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.OrganicPlant,
                TSIC = "01619",
                BusinessName = "กิจกรรมสนับสนุนการผลิตพืชผลซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "กิจกรรมสนับสนุนการผลิตพืชผลซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "กิจกรรมทางการเกษตร โดยได้รับค่าตอบแทนหรือตามสัญญาจ้าง การเตรียมพื้นที่เพาะปลูก การปลูก การให้ปุ๋ย การตัดแต่งกิ่งก้านต้นไม้ผลและไม้เถา การปักดำข้าวและกล้าหัวผักกาด การเก็บเกี่ยว การจัดหาเครื่องจักรกลทางการเกษตรพร้อมผู้ควบคุมและคนงาน การดูแลรักษาที่ดินให้อยู่ในสภาพดี เพื่อการใช้งานทางการเกษตร",
            });

            model.Add(new DBDBusinessModel
            {
                BusinessType = BusinessType.OrganicPlant,
                TSIC = " 01139",
                BusinessName = "การปลูกพืชผักอื่นๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoTitle = "การปลูกพืชผักอื่นๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
                InfoMessage = "การปลูกพืชผักกินดอก เช่น แค โสน ขจร ฯลฯ การปลูกพืชที่มีเมล็ด ยกเว้น เมล็ดหัวผักกาด การปลูกชูการ์ บีทและพืชผักอื่น ๆ ซึ่งมิได้จัดประเภทไว้ในที่อื่น",
            });



            return model;

        }

    }
    public static class BusinessType
    {
        public static string Restaurant
        {
            get
            {
                return "Restaurant";
            }
        }

        public static string Retail 
        {
            get 
            {
                return "Retail";
            }
        }

        public static string CoffeeShop
        {
            get 
            {
                return "CoffeeShop";
            }
        }

        public static string Hotel
        {
            get 
            {
                return "Hotel";
            }
        }

        public static string AGP 
        {
            get 
            {
                return "AGP";
            }
        }

        public static string Logistics
        {
            get 
            {
                return "Logistics";
            }
        }

        public static string MedicTool 
        {
            get 
            {
                return "MedicTool";
            }
        }

        public static string PatientService 
        {
            get 
            {
                return "PatientService"; 
            }
        }

        public static string CosmeticShortTerm
        {
            get 
            {
                return "CosmeticShortTerm";
            }
        }

        public static string Spa 
        {
            get 
            {
                return "Spa";
            }
        }

        public static string PetMedicine 
        {
            get 
            {
                return "PetMedicine";
            }
        }

        public static string Construction 
        {
            get 
            {
                return "Construction";
            }
        }

        public static string ElectronicSell 
        {
            get 
            {
                return "ElectronicSell";
            }
        }

        public static string Fitness 
        {
            get 
            {
                return "Fitness";
            }
        }

        public static string CarCare
        {
            get 
            {
                return "CarCare";
            }
        }

        public static string AccountAndLawConsult 
        {
            get 
            {
                return "AccountAndLawConsult";
            }
        }

        public static string Cosmetic 
        {
            get 
            {
                return "Cosmetic";
            }
        }
        
        public static string Tourism 
        {
            get 
            {
                return "Tourism";
            }
        }

        public static string SoftwareHouse 
        {
            get 
            {
                return "SoftwareHouse";
            }
        }

        public static string CosmeticOnline 
        {
            get 
            {
                return "CosmeticOnline";
            }
        }

        public static string FabricECommerce 
        {
            get 
            {
                return "FabricECommerce";
            }
        }

        public static string SparPower 
        {
            get 
            {
                return "SparPower";
            }
        }

        public static string Education 
        {
            get 
            {
                return "Education";
            }
        }

        public static string SEC 
        {
            get 
            {
                return "SEC";
            }
        }

        public static string OrganicPlant 
        {
            get 
            {
                return "OrganicPlant";
            }
        }

    }

}
